{"id": "n6fzin2", "author": "AutoModerator", "body": "We've launched a r/CryptoCurrency and Moons Discord! Join to chat about crypto and moons, sign up for news, governance, and other alerts, and watch burns as they happen! https://discord.gg/ZuU9Gqeqmy\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"}
{"id": "n6gaoeg", "author": "rsicher1", "body": "Not even a little worried\n\nBuying more\n\nNot selling until I retire"}
{"id": "n6gc975", "author": "BrowsingCoins", "body": "Firing the statistics guy for a bad report is wild"}
{"id": "n6j7kng", "author": "Kaliberrrr", "body": "I regret quitting my job two weeks ago. I'm about to call my last workplace and ask if I'm able to work there again"}
{"id": "n6gabfg", "author": "gemino616", "body": "Bought the dip!\n\n$20 dollar this time!"}
{"id": "n6gta2v", "author": "MikeysOnTheMoon", "body": "Stack that eth gents"}
{"id": "n6iloo3", "author": "devCheckingIn", "body": "Total crypto market cap now back below the levels seen in early December, and that's with all the new stablecoins minted over the past 8 months."}
{"id": "n6jtpd2", "author": "kironet996", "body": "so many poor and angry people here"}
{"id": "n6gg7ic", "author": "C-Dull", "body": "We haven’t had a Green Day since… Sunday?"}
{"id": "n6l6tuv", "author": "devCheckingIn", "body": "Swing trading really doesn't work with crypto.  When you think you get a buy in at a low price, that ends up being your bagholding price for the following two months."}
{"id": "n6jrqeu", "author": "ghost-age-1000", "body": "Rejoice people! I have finally opened shorts . Now we going back up real soon."}
{"id": "n6hloya", "author": "Ok-3ak3ak", "body": "Is this dip a good opportunity to buy?"}
{"id": "n6jpw28", "author": "delastunicorn", "body": "The emotion here is funny."}
{"id": "n6jr2j5", "author": "Every_Hunt_160", "body": "We back to eating Ramen for dinner today boys ?"}
{"id": "n6hhcbg", "author": "jwz9904", "body": "All the eth to 10k youtubers have vanished today"}
{"id": "n6m096t", "author": "ozera202", "body": "Every day I regret not selling in December…. Every fucking day ."}
{"id": "n6huofs", "author": "vb90", "body": "Overcrowded with shorts. We are most probably on the lows for the weekend. Obviously no guarantees for what will happen next week."}
{"id": "n6j6kp3", "author": "ivan971", "body": "People in here calling the end times because of a knee jerk reaction to some unexpected bad news.  \n\nGreen on Monday."}
{"id": "n6iewvw", "author": "MichaelAischmann", "body": "Friendly reminder: Crypto is global!\n\nI feel like people in this sub are overly focused on what the US does."}
{"id": "n6jv7qj", "author": "SeverusSchnaps", "body": "This sub is seriously off its meds lately. My lord.\n\nETH was sitting at $2400 just last month, now it’s $3400. That’s a clean $1K gain from my entry. BTC? Same story. Up big.\nBut sure, let’s all act like the sky is falling.\n\nAnd you know what? Just some friendly NFA:\nIf you simply buy anything (crypto, stocks, I don’t care) on a regular basis (weekly, monthly, whatever), you’ll probably win.\n\n\nJust like you did when your mom sent you to football camp even though you couldn’t tell a soccer ball from a weird-ass egg-shaped one.\n\nStay consistent. Ignore the noise. Stack and chill."}
{"id": "n6kkb83", "author": "davink91", "body": "10x shorts on everything. Surely we must go up now. Everyone is welcome."}
{"id": "n6iq2as", "author": "nomoney110", "body": "Please don't use the dip to buy more alts and then cry again. Buy BTC."}
{"id": "n6g17m7", "author": "Swerve99", "body": "imma have to tariff this sub"}
{"id": "n6hwvl9", "author": "cascading_disruption", "body": "2Y yield tells the story and the market says, the rate cuts are coming next month and the risk appetite for risky assets will be gigantic when that happens next month.\n\nSo, sit back and relax and enjoy the dip cause it really is just that. A dip. BTC above 90-100k is business as usual."}
{"id": "n6g2vsf", "author": "MichaelAischmann", "body": "Let's eat the dip.\n\nWhat are you buying?"}
{"id": "n6hzp1v", "author": "LinoStar69", "body": "green candles getting smaller and smaller"}
{"id": "n6l3qgy", "author": "brahahaga", "body": "legit fun seeing folks who entered the space at the ATH overreacting"}
{"id": "n6lcvwd", "author": "PumpzandGainz", "body": "Stack cheap sats and stay humble 🧡"}
{"id": "n6m1ctu", "author": "Pass_TheGravy", "body": "Just keep buying, just keep buying."}
{"id": "n6gok8o", "author": "gowithflow192", "body": "I don't believe we've topped but we've broken key support and I think market will trade down this month. Parabolic phase in October or November.\n\nGreat signal to sell and sit in cash for the month? It's very unlikely to bounce back up.\n\nIf I had much cash I would actually be buying now but this is the alternative way."}
{"id": "n6hr3e2", "author": "ABrad11", "body": "Going to be 110k then it’s blast off again"}
{"id": "n6ie353", "author": "Medium_Change4574", "body": "I'm preparing one last bag of cash to be deployed into altcoins in August/September if altcoins hit the YTD lows. All this gambling better be worth it in the end lol"}
{"id": "n6kjnrk", "author": "barthib", "body": "**CNBC report**: Ethereum turns 10: From scrappy experiment to Wall Street’s invisible backbone\n\nhttps://www.cnbc.com/2025/08/02/ethereum-turns-10-from-scrappy-experiment-to-wall-streets-invisible-backbone.html"}
{"id": "n6h0p0a", "author": "PM_ME_YOUR___ISSUES", "body": "Is the mango man making inflammatory statements again?"}
{"id": "n6hvjej", "author": "Old_Rafa", "body": "Cardano +0.02% right now\n\nBuckle up fellas"}
{"id": "n6komw3", "author": "rsicher1", "body": "It will be ok"}
{"id": "n6jymm4", "author": "MichaelAischmann", "body": "The \"keep cool\" of the BTC & ETH holders is clashing with the \"it's over\" of other alt holders in this sub."}
{"id": "n6lgt7l", "author": "LaserGuy626", "body": "It's not a coincidence that shortly after Coinbase releases perpetuals that Bitcoin dumps. Saylor posted yesterday that short term, Bitcoin is a trading asset. He keeps all their Bitcoin on Coinbase.\n\n\nMust be nice to own a controlling supply. He's effectively holding a gun to the crypto communities head everytime his stock dumps as well. Short his stock and he'll dump Bitcoin and make money on the short side with perpetuals."}
{"id": "n6khvro", "author": "davink91", "body": "I'm out. Done with this shit. BTC only."}
{"id": "n6kjnlx", "author": "JustHalfANoob", "body": "Did you guys even say thank you once? 😂"}
{"id": "n6gb1oc", "author": "Pure_Concentrate8770", "body": "Amazing (un)employment numbers. Such a slowdown will necessitate Rate cuts inshallah \n\n\nAny economic policy will prioritise employment over (fears of) inflation. An impactful slowdown of jobs will lead to stagflation unless it is arrested by rate cuts"}
{"id": "n6jps5u", "author": "bimbobandit2016", "body": "113k was my line in the sand but I can't bring myself to admit that it's over"}
{"id": "n6k7q99", "author": "goldtank123", "body": "Fu king hell. It’s a blood bath again"}
{"id": "n6kawqg", "author": "davide3991", "body": "Alts causally losing -38%"}
{"id": "n6kju47", "author": "piggleii", "body": "Really feel like cutting my losses on my small ETH position so I can start full-on trolling ETH again."}
{"id": "n6kkeue", "author": "BrowsingCoins", "body": "Below 112 looks nasty to me"}
{"id": "n6lq84r", "author": "jwz9904", "body": "6 straight red days for btc"}
{"id": "n6gceeq", "author": "Preme2", "body": "Is it… is it over?? We’re in the clear until Sunday."}
{"id": "n6j5mt8", "author": "AlertCrab9829", "body": "Put 3k into Tao few days ago already down 15% lol"}
{"id": "n6lhlo3", "author": "Ok_Golf_6467", "body": "Stablecoins doing well today 💎"}
{"id": "n6if8rj", "author": "thorsann", "body": "I did not expect such a short bull run"}
{"id": "n6lvf5y", "author": "vekypula", "body": "This is extremely strange price behaviour after such a long consolidation and breakout to the upside. \n\nPrepare yourself for a blackswan event next week, imo.\n\nSomeone big knows something and its exiting, fast."}
{"id": "n6kktu1", "author": "VariatCA", "body": "Put half my profits that I took from the 118-122k range and just put them back into BTC at a 112.5k average. Going to keep the other half of the profits in case there's another panic leg-down, or if ETH decides to get overly-emotional and I'll pick up some of that too lol."}
{"id": "n6knxla", "author": "Maleficent_Sound_919", "body": "\"$112k is support\"\n\nSure buddy for how long... this is such a whale driven dump"}
{"id": "n6hmden", "author": "jwz9904", "body": "**Ether ETFs end 20-day inflow streak**"}
{"id": "n6i0xs2", "author": "jwz9904", "body": "6th btc.d green and counting"}
{"id": "n6l5j7i", "author": "decomposition_", "body": "Guys we’re at market cap levels not seen in 3 weeks… EVERYONE FUCKING PANIC! SELL EVERYTHING NOW WE’RE SO OVER"}
{"id": "n6i4e69", "author": "Paddy_Powers", "body": "All I see are bargains to be had! Well as far as BTC and ETH are concerned, I've got burned too many times by alts."}
{"id": "n6jm207", "author": "VariatCA", "body": "For perspective, BTC's pullback from the 118k range is only about 4% down. This is in-line with the NASDAQ, which is similarly down nearly 4% over the last two days from the same exact macro-economic concerns. \n\nEveryone's just waiting for some guidance and clarity this weekend from the administration. It's a shame this stuff has a tendency to happen right at the end of the week, as the stock markets have a chance to cool down but Crypto has to sit in limbo with its 24/7 market open lol.\n\nAt this point in time though, most of Crypto is moving with market sentiment. If the stock market continues hurting, BTC/ETH will follow their lead, and if it recovers they will spring back to life hastily."}
{"id": "n6jqm6i", "author": "Fumbles1231", "body": "Moons are holding up way better than I thought they would. Figured they'd be back down the 9 cents by now"}
{"id": "n6ko0cj", "author": "Maleficent_Sound_919", "body": "Altseason = never gonna happen again 200% gain is the new 2000% gain from back in the day"}
{"id": "n6kpndk", "author": "inappropriateshallot", "body": "honestly, just buy the dip, we live in clown world and it will go up again for no reason"}
{"id": "n6ktvo1", "author": "whataboutbenson", "body": "Everything looks like absolute shit. I'm buying."}
{"id": "n6i6kc4", "author": "ThinCrusts", "body": "I think we're gonna dump and crab for a few months like we did when BTC broke 100k.  \n\nMight be the time to catch a few alts that pump but not worth the headache imo.  \n\nGlhf"}
{"id": "n6k6s1u", "author": "LaOnionLaUnion", "body": "I'd like to use avout the remittance taxes (US) and fees with remittance services. USD to PHP mostly. Crypto sounds promising, but I haven't tried it. Has anyone got advice?"}
{"id": "n6kiwvr", "author": "Kaliberrrr", "body": "It keeps bleeding and im jobless cuz i quit my job 2 weeks ago..what should I do? Pray to the gods?"}
{"id": "n6haon2", "author": "Suspicious-Holiday42", "body": "Alt season, where are you hiding"}
{"id": "n6hi4lv", "author": "WhyYesIAmADog", "body": "I swear to xrp if i hear one more xrpeep out of any of you im going to turn this mother fing xrp around and there will be no accumlucation of xrp"}
{"id": "n6ixphc", "author": "Apprehensive_Fee3821", "body": "The trading volume is too low at weekend, I guess the price will bouncing between 112k-114k until the next Monday."}
{"id": "n6kkozc", "author": "Davek56", "body": "Ooooh, you look ugly."}
{"id": "n6knm35", "author": "TexasBoyz-713", "body": "Alt season is like the episode of South Park where Stan’s dad was playing “Chase the Dragon”\n\nAlmost there… but somehow never will reach it"}
{"id": "n6kzpxt", "author": "barthib", "body": "Percentage of the drop between the highest point of cryptos in July and the bottom of today:\n\n* BTC –8.9 %\n* ETH –13.5 %\n* SOL –23.9 %\n* XRP –24.9 %\n\n**ETH has the smallest drop among alts, although its faster rise since April should trigger the deepest correction.**\nIt might indicate that a repricing is occurring in the space: investors and speculators might be reallocating in the network that Wall Street seems to use preferably to implement the first commercial blockchain applications (Robinhood, eToro, Coinbase, BlackRock, Circle...)."}
{"id": "n6l608j", "author": "SevereArrivals13", "body": "The margin of profit on Bitcoin just got bigger, buy it, leave it be and touch grass"}
{"id": "n6hwm6z", "author": "cascading_disruption", "body": "Last chance to buy ETH over 3.5k!"}
{"id": "n6i5k1v", "author": "KalEl729", "body": "Atleast all maxis are back in their caves."}
{"id": "n6j5k27", "author": "JustHalfANoob", "body": "Bull run? More like the bull ran away 😂"}
{"id": "n6jqzbd", "author": "skyline917", "body": "SELL SELL SELL!!!!!!!"}
{"id": "n6kpvv1", "author": "JeJ34", "body": "Is it alt season yet ??"}
{"id": "n6lwtvd", "author": "jwz9904", "body": "bloody sunday came early."}
{"id": "n6ixbqg", "author": "KalEl729", "body": "Eth at 4k any day now lol😂😂"}
{"id": "n6hedue", "author": "light_death-note", "body": "Think of this as a discount. Once the fed cuts rates, we go 📈"}
{"id": "n6j78d7", "author": "OverallHearing5", "body": "It’s never gonna stop going down as long as the crypto president is doing his thing"}
{"id": "n6kepq4", "author": "verysillyman", "body": "Nice bull market and alt season guys!"}
{"id": "n6k1e7o", "author": "Cautious_You7796", "body": "The charts for Chainlink and Solana don't look too bad, at least so far anyways."}
{"id": "n6j7ohk", "author": "LtViperNL", "body": "Slow bleed, Sunday dump, Monday recovery, rest of week bleed. Rinse and repeat"}
{"id": "n6hxmhi", "author": "Farvaharr", "body": "Another leg down just seems inevitable"}
{"id": "n6hodwd", "author": "Farvaharr", "body": "Breaking 113K would be a shit show"}
{"id": "n6jd3bh", "author": null, "body": "[deleted]"}
{"id": "n6li9nb", "author": "davink91", "body": "Literally holding worthless fiat would ve turned out better in the last 2 years than investing in crypto. Who could ve thought"}
{"id": "n6kimcx", "author": "ReflectionLumpy1040", "body": "The U.S. Suicide Hotline:\n\nDial 988, text 988, or visit 988lifeline.org for online chat. 988 is a free, confidential service available 24/7 for anyone experiencing emotional distress, a mental health crisis, or thoughts of suicide. You can call, text, or chat with trained counselors who provide support and resources"}
{"id": "n6hsmqh", "author": "kironet996", "body": "BTC and ETH etfs both in red, buckle up"}
{"id": "n6iydkm", "author": "AprilsMostAmazing", "body": "did you all take partial profits?"}
{"id": "n6k1nto", "author": "33NoBody33", "body": "Seeing Eric Trump tweet buy the eth and BTC dip makes me not want to do crypto anymore tbh. Don’t wanna support the trump crime family. Buying crypto used to be anti people like that"}
{"id": "n6kvc80", "author": "Next_Statement6145", "body": "where is the bottom?"}
{"id": "n6hb7n8", "author": "whataboutbenson", "body": "Trump giving Immortan Joe vibes."}
{"id": "n6kcswp", "author": "UpwardCharterhouse", "body": "My fartcoin bags are not doing so hot"}
{"id": "n6kmjmj", "author": "Medium_Change4574", "body": "There goes all the gains on some alts lmao"}
{"id": "n6m1kc4", "author": "Nequientt", "body": "i might have actually picked the wrong club"}
{"id": "n6ko3pk", "author": "Maleficent_Sound_919", "body": "I should have known in December to cash out... never in my life have seen alts dump so fast after the top and now even more downward"}
{"id": "n6l5246", "author": "kironet996", "body": "imagine not taking profits and laughing at people who did"}
{"id": "n6g0g1q", "author": "Dzerikas", "body": "Sooo..what are the chances of a September rate cut now?"}
{"id": "n6g6xf3", "author": "MichaelAischmann", "body": "I do not believe we'll see a 51% attack on Monero today."}
{"id": "n6g9aa9", "author": "BrowsingCoins", "body": "112k is my optimistic hold"}
{"id": "n6gkjxb", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-08-01 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|320|  \n|XRP|78|  \n|ETH|71|  \n|MOON|40|  \n|SAFE|18|  \n|ALGO|17|  \n|SOL|15|  \n|XMR|14|  \n|HOME|13|  \n|CORECHAIN|11|  \n|ADA|10|  \n|HBAR|10|  \n|IP|10|  \n|SNT|8|  \n|USDT|8|  \n|BCH|7|  \n|FARTCOIN|7|  \n|LINK|6|  \n|REQ|6|  \n|SUI|6|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6jegtr", "author": "vb90", "body": "Look on the brightside, there are some people putting in more longs now. Monday will be a crap-shoot."}
{"id": "n6kglfu", "author": "Next_Statement6145", "body": "time to be greedy"}
{"id": "n6jsxg1", "author": "bizaroo933", "body": "Americans destroyed the bullmarket. First Powell with his hawkish speech, then orange buffoon with his tarrifs and nuclear treath’s to Russia. And ofcourse, fat burgers were selling like animals. Result? No altseason, but SHIT season."}
{"id": "n6gme15", "author": "Ok_Golf_6467", "body": "Instructions unclear. Bought more AVAX"}
{"id": "n6iei6z", "author": "Due-Inspection-5660", "body": "everyone who sold today and yesterday - do you not remember what happened in April?\n\nTrump backpedalled on the tariffs and we rallied 10-20% almost immediately. are you really not expecting him to announce some more deals or extensions for some countries before 7 august?\n\nas for the bad jobs report, it's actually good for crypto once investors swallow the pill and start looking forward to a cut in september."}
{"id": "n6iep0z", "author": "Due-Inspection-5660", "body": "Also keep in mind strategy and metaplanet are currently raising over $7bn to buy bitcoin.... this buying pressure will hit the market next week and push us back up."}
{"id": "n6kc9dm", "author": "nomoney110", "body": "they want it cheap"}
{"id": "n6ke8yq", "author": "Foughtapotamus", "body": "Should I sell my alts? Is it gonna get much worse and rebuy?"}
{"id": "n6kg9s9", "author": "YappingOldMan", "body": "Buy when others are fearful, I know it’s easier said than done"}
{"id": "n6kjaod", "author": "JuniorRepublic2438", "body": "Ooo this is a juicy shakeout."}
{"id": "n6kl7ua", "author": "ithastogoupfromhere", "body": "riding the trend ungreedy with 2x shorts the whole day"}
{"id": "n6km3q1", "author": "panthera_N", "body": "ran out of cash to <buy the dip>"}
{"id": "n6ld49b", "author": "namieorange", "body": "Man this is like a Church comvention. Everyone preaching.\nHappy you saved your 2x, go on with life 😆"}
{"id": "n6iwhrw", "author": "panthera_N", "body": "ETH has hit ATH $4800 2021, please give ETH holders a chance to break even 😭😭😭"}
{"id": "n6kzvcn", "author": "VariatCA", "body": "It's funny, I made a comment a couple weeks ago when most Alts were on fire and people were proclaiming the Alt Season finally arrived. It was about a sudden FOMO-urge to just convert my entire portfolio into Doge at around 0.27 and ride the wave up.\n\nI would've lost 30% of my portfolio in only 10 days. That's the danger of alts & memecoins."}
{"id": "n6l5ju4", "author": "oopssomething", "body": "Wake me up when september ends"}
{"id": "n6hecg3", "author": null, "body": "[removed]"}
{"id": "n6g95oa", "author": "ICE-FlGHT", "body": "I hate even saying this but..\n\nChat are alts cooked?"}
{"id": "n6joj8a", "author": "Maleficent_Sound_919", "body": "Alts are done the days of 10x for all alts are over imo"}
{"id": "n6kzc04", "author": "wooly_torch", "body": "Alt season bull of 2025 will last for approximately 13 seconds. Each second will see alts 2x-10x before days end. Once they have reached max pumpage, they will 2x-10x all at once in a fantastic one second pump that will he known as the Great Pumpage. And the age of gains will begin.\n\nThe age of gains will end on the 14th second, and we will be thrown into alt armageddon from whence there is no return - at least not in our grandchildrens’ lifetimes."}
{"id": "n6ly372", "author": "MikeysOnTheMoon", "body": "That was the bottom for eth, hope u caught it"}
{"id": "n6iu1x8", "author": "Due-Inspection-5660", "body": "Also for you bears, you should be aware that the US appeals court is going to rule on Trump's tariffs soon and it's very likely they're gonna rule them unlawful and they will be removed - [https://www.reuters.com/legal/government/us-appeals-court-scrutinizes-trumps-use-tariffs-trade-deadline-looms-2025-07-31/](https://www.reuters.com/legal/government/us-appeals-court-scrutinizes-trumps-use-tariffs-trade-deadline-looms-2025-07-31/)\n\nObviously trump will then appeal to the supreme court but I dont see how any court is not going to rule them unlawful as they clearly require congressional approve.\n\nOnce the tariffs get removed we're gonna moon like crazy.\n\nSo, sitting on the sidelines now is crazy in my opinion."}
{"id": "n6ki9wm", "author": "Farvaharr", "body": "POST THE HOTLINE 😂😂"}
{"id": "n6gsz6v", "author": "KalEl729", "body": "Xrp and sui shouldve fallen off a cliff by now…"}
{"id": "n6ht6lx", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-08-01 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|320|  \n|XRP|78|  \n|ETH|71|  \n|MOON|40|  \n|SAFE|18|  \n|ALGO|17|  \n|SOL|15|  \n|XMR|14|  \n|HOME|13|  \n|CORECHAIN|11|  \n|ADA|10|  \n|HBAR|10|  \n|IP|10|  \n|SNT|8|  \n|USDT|8|  \n|BCH|7|  \n|FARTCOIN|7|  \n|LINK|6|  \n|REQ|6|  \n|SUI|6|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6hwhrx", "author": "jwz9904", "body": "i guess alt seasoners taking a breather now"}
{"id": "n6j2bmf", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-08-01 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|320|  \n|XRP|78|  \n|ETH|71|  \n|MOON|40|  \n|SAFE|18|  \n|ALGO|17|  \n|SOL|15|  \n|XMR|14|  \n|HOME|13|  \n|CORECHAIN|11|  \n|ADA|10|  \n|HBAR|10|  \n|IP|10|  \n|SNT|8|  \n|USDT|8|  \n|BCH|7|  \n|FARTCOIN|7|  \n|LINK|6|  \n|REQ|6|  \n|SUI|6|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6jlfqi", "author": "decomposition_", "body": "There’s $139M worth of leverage close to getting liquidated on Bitcoin on the way down to $112453"}
{"id": "n6jlmg0", "author": "ithastogoupfromhere", "body": "my xrp puts looking good"}
{"id": "n6l7jkk", "author": "VaultBoy9", "body": "Did anyone else notice that the daily low for BTC (per Coinbase) was exactly $12,000.01? What a coincidence."}
{"id": "n6krfix", "author": "decomposition_", "body": "Longs are getting absolutely fucking clobbered this week"}
{"id": "n6lhrjf", "author": null, "body": "[deleted]"}
{"id": "n6kiumy", "author": "Cricketdogeorgy", "body": "Last chance to sell above 110k"}
{"id": "n6j9v5b", "author": "cryptojimmy8", "body": "I see americans thought the market was open today"}
{"id": "n6hkzyb", "author": null, "body": "[deleted]"}
{"id": "n6kdab7", "author": "ThatChrisGuy7", "body": "Idk when to close the xrp short"}
{"id": "n6kef69", "author": "lurkinns", "body": "So btc might drop to 110k and eth 3200 in the next few hours"}
{"id": "n6kg01q", "author": "vb90", "body": "We broke support. Next leg down is 3.3T. Another 10% down, and of course another 20% for alts."}
{"id": "n6kk98l", "author": "namieorange", "body": "Lol it doesn't stop"}
{"id": "n6hqygk", "author": "bimbobandit2016", "body": "Don't be a pussy. There's only a few weeks left in the cycle. If you can't hold through a few weeks of uncertainty, you shouldn't be in financial markets"}
{"id": "n6jd2hz", "author": "Antique-Athlete-8838", "body": "Bull cycle over yet?"}
{"id": "n6jqdat", "author": "bimbobandit2016", "body": "I think we have one more push up left at best. After that all bets are off"}
{"id": "n6jzzip", "author": "meeleen223", "body": "Moons singlehandedly holding my portfolio up\n\nBut i fully expect final alt scare before parabolic move up EOY"}
{"id": "n6g7kcp", "author": "jwz9904", "body": "so employment numbers are bad it seems. How can people get the numbers so wrong?"}
{"id": "n6jo50x", "author": "Qowudyeibflsla", "body": "Oh look. BTC sneeze alt bleed. Gonna lose the monthly gains by the end of next week"}
{"id": "n6lwrvp", "author": "_Commando_", "body": "So 123k cycle top?  And poor ETH didnt even touch its prior ATH created a tripple top at 4k ouch...."}
{"id": "n6hgfbw", "author": "Striking_Conflict176", "body": "Possible move down to 108k anyone?"}
{"id": "n6kg4v8", "author": "beerbaron105", "body": "Post the hotline!"}
{"id": "n6kjmry", "author": "SevereArrivals13", "body": "BTC is at 113k, BNB at $740, Moons holding after a 100% pump, and few are still complaining lol"}
{"id": "n6kmuvz", "author": "tehrcrd", "body": "Strap your seatbelts, altseason this year will feel like getting from 0 to Mach9 in 10 seconds."}
{"id": "n6ktcwd", "author": "Farvaharr", "body": "Honestly don’t know if I should buy back in, I sold my spot 3 days ago but timing this shit is too damn hard"}
{"id": "n6l8u8x", "author": "davink91", "body": "Not enough pain. Alts are about to breakdown even more. At least another 40%-50% drop from here. Alts/BTC ratio stil at 0.34 and far higher than 0.25 which we hit every cycle. Expect half prices for most coins within next 2 months."}
{"id": "n6khepy", "author": "bizaroo933", "body": "Can alts go even lower then this? 😆"}
{"id": "n6ki4s8", "author": "that_ol_bs", "body": "Eric Trump says to buy the dip. I would listen."}
{"id": "n6kll67", "author": "hubmash", "body": "Sigh…looks like I’m going to round trip my ETH leveraged long from 3000. I took some profits at 3850 but not nearly enough."}
{"id": "n6kr0qy", "author": null, "body": "[deleted]"}
{"id": "n6hjlkb", "author": "KalEl729", "body": "No recovery today. We are 100% dipping further."}
{"id": "n6jiwk4", "author": "KalEl729", "body": "I think once it hits 110k is a good time to enter in"}
{"id": "n6jn9pz", "author": "BrowsingCoins", "body": "So when is that AI and crypto meta coming back or is it over for good?"}
{"id": "n6joxmy", "author": "ieatmoondust", "body": "Interestingly, Coincodex is quite bullish on Moons projections in the coming months."}
{"id": "n6kwy5z", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-08-01 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|320|  \n|XRP|78|  \n|ETH|71|  \n|MOON|40|  \n|SAFE|18|  \n|ALGO|17|  \n|SOL|15|  \n|XMR|14|  \n|HOME|13|  \n|CORECHAIN|11|  \n|ADA|10|  \n|HBAR|10|  \n|IP|10|  \n|SNT|8|  \n|USDT|8|  \n|BCH|7|  \n|FARTCOIN|7|  \n|LINK|6|  \n|REQ|6|  \n|SUI|6|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6h38sy", "author": "xarips", "body": "There are freaking millions of alt coins now. Liquidity is spread so fucking thin.\n\nAnd yet yall STILL think some type of 2021 esque parabolic alt run will happen.\n\nJust lol."}
{"id": "n6lfjha", "author": "GhostEntropy", "body": "ETH set to retrace it's Tom Lee pump, exactly like it retraced its ETF pump. This asset relies entirely on false narratives & hype/hopium."}
{"id": "n6itunx", "author": "Call1-800Bitch", "body": "XRP OR BUST"}
{"id": "n6gtmup", "author": "Over_Explanation3348", "body": "Stop trading and believe in something… look into SPX6900"}
{"id": "n6k9dp3", "author": "still_salty_22", "body": "Ffs birdbrained goldfish fucking empty headed bs geezus.."}
{"id": "n6kfhcw", "author": "Relevant-Werewolf-12", "body": "yes… lower… lower…"}
{"id": "n6jljb6", "author": null, "body": "[deleted]"}
{"id": "n6kac26", "author": "vb90", "body": "The most predictable bounce of all time at 3.711T."}
{"id": "n6kddu7", "author": "ICE-FlGHT", "body": "Uhhhh fam? \n\nWhats the news?"}
{"id": "n6ki8kh", "author": "Farvaharr", "body": "DAMN WE GETTING BULLIED"}
{"id": "n6gbk7d", "author": "jwz9904", "body": "Too slow powell is supported by Too Wrong numbers"}
{"id": "n6kgpq4", "author": "Intelligent-Ad8242", "body": "My wif bags got slaughtered."}
{"id": "n6kwdmx", "author": "KristianME", "body": "Ada, Sol etc. will do new record lows this year if we get a BTC retrace to around 100k."}
{"id": "n6gxf2h", "author": "WhyYesIAmADog", "body": "All i hear about now is xrp this, xrp that, nobody talks about any of the other cryptos anymore and its frustrating, stop talking about xrp so much xrp out"}
{"id": "n6jnw2s", "author": "Maleficent_Sound_919", "body": "Manipulation over and over and over this bull run = over!"}
{"id": "n6lqnxu", "author": "Dinnen22", "body": "https://i.redd.it/aqye6f37sogf1.gif"}
{"id": "n6joqzn", "author": "DICKDORKDAVE", "body": "Fake run we saw from 70k is almost over.  \nShould be down to about 75k this coming week or next."}
{"id": "n6kgwse", "author": "thec4nman", "body": "Hotline, anyone?"}
{"id": "n6l0xw8", "author": "bizaroo933", "body": "So support level doesnt excist anymore. Interesting"}
{"id": "n6gb6oh", "author": "jwz9904", "body": "i'm never retiring"}
{"id": "n6lap7z", "author": "OwlSuspicious9254", "body": "I’m about to deploy more capital into alts.  Already have plenty of BTC and ETH.  My main holdings are LINK, ONDO, ADA, AERO, SOL.  Anything else I need?"}
{"id": "n6ge7ix", "author": "MichaelAischmann", "body": "America is lead by a Commander in Cheat."}
{"id": "n6m1bsu", "author": "HSuke", "body": "BLS data is usually extremely accurate. They were off by **only 0.01%** this time, which was the largest correction they ever made since 2020.\n\nhttps://np.reddit.com/r/explainlikeimfive/comments/1mfhamk/comment/n6i05fb/\n\nIt's totally normal for data to get revised as more survey results come in."}
{"id": "n6idrvi", "author": "Annual_Juggernaut_47", "body": "Do you follow the jobs numbers? They’ve been consistently revised down for years. The statistical probability of the revisions being due to chance is essentially zero. The modeling is bad, so it’s not just one bad report. The data they provide has been consistently poor, and major economic decisions are based on it."}
{"id": "n6j9j44", "author": "DryMyBottom", "body": "mc Donald's?"}
{"id": "n6h2it6", "author": "x_lincoln_x", "body": "Whale hello there."}
{"id": "n6imlhk", "author": "Ashamed_Moment_2477", "body": "Who needs stablecoins anyway?"}
{"id": "n6k98ce", "author": "DryGeneral990", "body": "But I thought there were record ETF inflows?"}
{"id": "n6j8gnt", "author": "KalEl729", "body": "This exactly. Dont know whats going on"}
{"id": "n6jv9do", "author": "namieorange", "body": "We're angry because we're poor. We were pre rich last week 😁"}
{"id": "n6h0fym", "author": "Montana-Safari7", "body": "Wake me up when September ends."}
{"id": "n6gifh8", "author": "DBRiMatt", "body": "Damn, it's been red all month!"}
{"id": "n6gjyz6", "author": "jwz9904", "body": "today will be GREEN"}
{"id": "n6lazc9", "author": "goldtank123", "body": "It works in an upswing. Works well with meme coins"}
{"id": "n6l76by", "author": "VaultBoy9", "body": "The only swings we have here are emotional ones"}
{"id": "n6l8evp", "author": "piggleii", "body": "Martingale. Look it up."}
{"id": "n6jsd3k", "author": "decomposition_", "body": "Especially because $100M of longs just got liquidated 😂 now the pressure is towards you instead of"}
{"id": "n6jtbzj", "author": "DICKDORKDAVE", "body": "Good move. I didn't short but sold most at 118k. Should dip below 100k soon."}
{"id": "n6hqmbw", "author": "bimbobandit2016", "body": "Charts say that if you're a bull, you want to defend this line at 113k. I've personally bought twice since yesterday"}
{"id": "n6hp0bg", "author": "OderWieOderWatJunge", "body": "You never know until it's too late. In 2022, people bought dips all the way down and now they have a shitty buy in average"}
{"id": "n6hso4m", "author": "kironet996", "body": "etfs are selling, ofc"}
{"id": "n6iyg8j", "author": "SpontaneousDream", "body": "It's never happening, and IF it does, it'll happen at a far lower ratio than now. Maybe something like 10k ETH, 500k BTC"}
{"id": "n6hiry5", "author": "Suspicious-Holiday42", "body": "in 2021 some guaranteed that ETH will go to 20k-30k by the end of 2021"}
{"id": "n6m7sr6", "author": "MarioWilson122", "body": "Yeah 2025 hasn't gone very well for alt traders for sure. People came in so optimistic but are now hoping to leave the year at breakeven.\n\nMaybe the biggest bullrun ever still happens but im sure to some people that sounds like a unfunny joke"}
{"id": "n6nhl75", "author": "piggleii", "body": "Fuck man"}
{"id": "n6m0fbi", "author": "jwz9904", "body": "that seems like the top for Alts though, you may have to regret for longer i afraid"}
{"id": "n6jm19g", "author": "Pat_McCrotch", "body": "Not really seeing any shorts down here on order flow.. mostly longs trying to catch the “low”"}
{"id": "n6hvz0l", "author": "c05d", "body": "Think there is still another down leg"}
{"id": "n6jijpn", "author": "OwlSuspicious9254", "body": "I feel like this jobs data will mean the Fed is forced to cut rates sooner which will be good for crypto.  Maybe short term bad but bullish long term."}
{"id": "n6j90tv", "author": "decomposition_", "body": "While they freak out we can buy in cheaper and laugh as the shorts get liquidated"}
{"id": "n6joeh4", "author": "Maleficent_Sound_919", "body": "Wanne bet?"}
{"id": "n6y4naf", "author": "OwlSuspicious9254", "body": "This aged well"}
{"id": "n6jdll9", "author": "TheBruteMasterr", "body": "Im thinking green week next week as well"}
{"id": "n6ife9d", "author": "Medium_Change4574", "body": "Because MMs are only focused on what the US does. The market didn't significantly move a single time when the EU cut rates and they cut a lot of times lol"}
{"id": "n6il9dg", "author": "Blooberino", "body": "But bUrGeRs. Every day it's the BuRgErS! They sell everything, every single day, without fail, and a never ending supply. bUrGeRs!!!1"}
{"id": "n6it46k", "author": "reversenotation", "body": "This burger stuff started out as a meme, but memes go over way too many people's heads here - they lack the ability to understand and separate a meme from literal reality."}
{"id": "n6jze5i", "author": "Paddy_Powers", "body": ">Just like you did when your mom sent you to football camp\n\n\nMy mom never sent me to football camp. What are these 'balls' that you speak of? "}
{"id": "n6kustd", "author": "Electrical_Invite552", "body": "People here are dumb and have the shortest attention spans I have ever seen. They will all be panic buying again in a few weeks when we start to climb."}
{"id": "n6lboy3", "author": "The_Nothing00", "body": "I'm still in the green, but I won't be for long if it keeps dropping like this..."}
{"id": "n6jvedh", "author": "SeverusSchnaps", "body": "Also buy BTC and ETH\n\n\nDon't buy XRP"}
{"id": "n6iqvx7", "author": "Every_Hunt_160", "body": "You got any money to buy the dip ?"}
{"id": "n6j1y4t", "author": "c05d", "body": "this"}
{"id": "n6iztjh", "author": "Ok-3ak3ak", "body": "Why not? Sometimes the market dip then it pullback"}
{"id": "n6ic0ij", "author": "Annual_Juggernaut_47", "body": "Yep. Enjoy the rest of summer. Get ready for the final leg up in fall."}
{"id": "n6i8ofk", "author": "dimi727", "body": "Because of 25 Points Cut? I doubt"}
{"id": "n6g605a", "author": "ieatvegans", "body": "Alcohol."}
{"id": "n6gagdm", "author": "gemino616", "body": "A 50m lottery ticket.  Wish me luck"}
{"id": "n6ghuo6", "author": "blastermckaster", "body": "Holding ADA, ALGO, and just bought ETH 5x leverage."}
{"id": "n6g7h6c", "author": "jwz9904", "body": "Ramen"}
{"id": "n6g4qwt", "author": "ieatmoondust", "body": "Loading up on BONK"}
{"id": "n6m1p10", "author": "decomposition_", "body": "That’s my kind of play, beats gambling with leveraging crypto or meme coins"}
{"id": "n6hboqr", "author": "StraightStackin", "body": "How can you say \"the market will trade down this month\" then also say \"if I had much cash I would actually be buying now.\"  Why would you buy now if its gonna go down all month?"}
{"id": "n6h8urw", "author": "Mirade_1", "body": "Broken key support on what?"}
{"id": "n6hsszf", "author": null, "body": "[deleted]"}
{"id": "n6koqhr", "author": "Maleficent_Sound_919", "body": "lol..."}
{"id": "n6h23vy", "author": "x_lincoln_x", "body": "He fired the job report messenger and will replace a sycophant rendering that role useless.  The investing world hates uncertainty and this will only make it worse."}
{"id": "n6hcaq8", "author": "kipha01", "body": "He also moved two nuclear subs closer to Russia in reaction to inflammatory remarks."}
{"id": "n6hwa1u", "author": "AlertCrab9829", "body": "Time to buy"}
{"id": "n6kpljj", "author": "HoldCtrlW", "body": "In 4 years we will revisit these prices"}
{"id": "n6jzusv", "author": "VariatCA", "body": "It's always the altcoin/memecoin/shitcoin holders panicking that the world's ending, as if they haven't seen a pullback in their lives.\n\nWe had these *all the way up from 16k back at the start of 2023.* Every time BTC found a new plateau, it spent months range-trading +/- 10 to 15%.\n\nIf shitcoin holders weren't such emotional & panicky traders, they wouldn't have gotten themselves balls-deep into shitcoins in the first place."}
{"id": "n6jzg5v", "author": "Farvaharr", "body": "It’s so over"}
{"id": "n6lu6ra", "author": "PatMu5tard", "body": "He’s gonna be the cause of the next mega crash"}
{"id": "n6klspj", "author": "TexasBoyz-713", "body": "Shoulda been that way a long time ago!"}
{"id": "n6kj4h7", "author": "DryGeneral990", "body": "This is the way"}
{"id": "n6kk74r", "author": "piggleii", "body": "You will regret. Because every single last BTC miner on the planet including the whole of El Salvador is selling their BTC to buy ETH. You see now how great ETH is?"}
{"id": "n6kjwnn", "author": "piggleii", "body": "Thanks J Pow. You really showed Trump who’s boss."}
{"id": "n6gi2xv", "author": "Dzerikas", "body": "Theres like a 90% of rate cuts now right?"}
{"id": "n6gcku7", "author": "MichaelAischmann", "body": "But Trump is bringing all the jobs back to the US. Or so he said."}
{"id": "n6k5wzp", "author": "DryGeneral990", "body": "Imagine telling people 1-4 years ago that it's over when BTC dips below 113k."}
{"id": "n6kc4dy", "author": "namieorange", "body": "Lol yeah, some of my alts and memes are in a blood ocean"}
{"id": "n6kq79d", "author": "reversenotation", "body": "\"Small ETH position\" that means you've already sold some I bet.  It always was weird how you did a 180 by buying ETH after vociferously hating on it for years."}
{"id": "n6kkn3y", "author": "Hairy_Shine_6629", "body": "Better start getting used to it"}
{"id": "n6knaxh", "author": "TexasBoyz-713", "body": "Tasty*"}
{"id": "n6lrqp3", "author": "LinoStar69", "body": "About to be 7"}
{"id": "n6mbzg5", "author": "DryGeneral990", "body": "How many straight green days did it have this year?"}
{"id": "n6j7e72", "author": "PMmeuroneweirdtrick", "body": "I bought $3k of HBAR at peak in Jan and only made it to green 2 weeks ago. Back to red again now. Gotta buy the dip to get average lower."}
{"id": "n6jofk0", "author": "Maleficent_Sound_919", "body": "\\-15% so far!"}
{"id": "n6lup9b", "author": "ThatChrisGuy7", "body": "Staking stables and lightly shorting is nice in times like these"}
{"id": "n6inqck", "author": "MichaelAischmann", "body": "The bull isn't done just because we've seen a 10% setback. These drops happened in all previous bull runs too."}
{"id": "n6io7mn", "author": "LinoStar69", "body": "short and weak"}
{"id": "n6kdbgu", "author": "DryGeneral990", "body": "No one expected BTC to hit ATH so early last year either"}
{"id": "n6il810", "author": "Realistic_Poetry5800", "body": "Crypto doesnt care lol"}
{"id": "n6iiq03", "author": "pumse1337", "body": "Noob"}
{"id": "n6iilzk", "author": "Realistic_Wrap_9767", "body": "Expect the unexpected"}
{"id": "n6m03jc", "author": "VariatCA", "body": "It's literally following the S&P and NASDAQ's reaction to the August-1st tariff news and Jobs Report. BTC has a bit more volatility due to the ease of access for market liquidity and smaller marketcap, and alts are the same with respect to BTC.\n\nThe S&P and Nasdaq basically gave back their last 30 days of gains in a 24 hour period. People shouldn't be shocked that an asset as highly-correlated with Wall Street as BTC would follow suit.\n\nThis isn't some isolated crypto event, it's the markets speaking with their wallets that they didn't exactly appreciate the recent news."}
{"id": "n6m0syb", "author": "Tip-Actual", "body": "You guys must be new to crypto . These dips are nothing but low order book manipulating whales."}
{"id": "n6mgdhp", "author": "TechnicalRadish78", "body": "yeah man it's all going to zero. everyone sell NOW NOW NOW"}
{"id": "n6ko8gz", "author": "Maleficent_Sound_919", "body": "Panic hasnt even started yet $92k incoming"}
{"id": "n6m9z1l", "author": "KalEl729", "body": "Eth back to 2021 levels soon. The next week doesnt look good. Such a massive dump\nMeans someone knows something. Ill get into btc now finally as i should have"}
{"id": "n6kuhx8", "author": "robis87", "body": "$12k\\* is tho"}
{"id": "n6hmucd", "author": "KalEl729", "body": "Uh oh."}
{"id": "n6l7m2a", "author": "devCheckingIn", "body": "You could also say we were first at this market cap on Dec. 6."}
{"id": "n6isjwd", "author": "piggleii", "body": "But not by ETH?"}
{"id": "n6jo1jo", "author": "Maleficent_Sound_919", "body": "\"some guidance and clarity this weekend from the administration\"\n\nFUCK THEM HE JUST WANTS TO BURY THE EPSTEIN FILES!"}
{"id": "n6jpp0v", "author": "ieatvegans", "body": "For more perspective, from the recent ATH, BTC is down 8.5%"}
{"id": "n6jypkr", "author": "SevereArrivals13", "body": "How could they be dipping if there is no one selling at these low prices\n\nAll the peanut salesmen have sold for nothing and got their Moons removed and burned off forever"}
{"id": "n6kswqq", "author": "olduvai_man", "body": "This place when alts get crushed: \"Never gonna be another alt-season\"\n\nThis place when alts start moving: \"Alt-season loading.\""}
{"id": "n6koqfw", "author": "VariatCA", "body": "Most alts have done nothing to improve or increase their network activity or real-world utilization in years. Teamed by skeleton crews who slowly sell their initial token holdings to keep the lights on every month, or highly diluting the market with new coins that meet no increased demand.\n\nMost of the old projects aren't doing anything to deserve, nor attract, an investment invigoration. They're just quietly dead in the water."}
{"id": "n6kvz1k", "author": "lumpyshoulder762", "body": "So crypto legislation being signed into law wasn’t the reason for the recent pump and the recent dump wasn’t caused by renewed global tariffs and bad economic data? Of course there are reasons crypto pumps and dumps. Just open up the front page of any news website. Jfc. "}
{"id": "n6ku4tu", "author": "piggleii", "body": "If shit’s your thing, I won’t judge."}
{"id": "n6k986c", "author": "inappropriateshallot", "body": "Que?"}
{"id": "n6kkpwl", "author": "hazza-sj", "body": "What was the plan when you quit your job? Just hope it goes up forever?"}
{"id": "n6ksbbx", "author": "decomposition_", "body": "Why quit a job with no alternative income?"}
{"id": "n6kk1yi", "author": "bobsagetslover420", "body": "better freshen up that LinkedIn profile"}
{"id": "n6kj5kl", "author": "Realistic_Wrap_9767", "body": "Don’t invest more than you can afford to lose mate."}
{"id": "n6kjmek", "author": "VariatCA", "body": "Maybe get another job..."}
{"id": "n6hik8m", "author": "Dickerbear", "body": "There is no alt season"}
{"id": "n6lc5yq", "author": "goldtank123", "body": "I used these methods to buy intra day dips and pumps."}
{"id": "n6l4tmx", "author": "kironet996", "body": "eth will revisit 1400 imo"}
{"id": "n6i53ws", "author": "KalEl729", "body": "Timberrrr"}
{"id": "n6i77rv", "author": "jwz9904", "body": "Btc maxis in caves, alt holders in graves"}
{"id": "n6iyiv7", "author": "JalapenoPeppr", "body": "We are?? Didn’t get the memo"}
{"id": "n6k84qi", "author": "DryGeneral990", "body": "More like bear run after you and chase you up a tree"}
{"id": "n6k1vui", "author": "namieorange", "body": "Selling in big red candles seems like a fantastic idea"}
{"id": "n6kr1y3", "author": "TexasBoyz-713", "body": "Feast your eyes!"}
{"id": "n6m8qyn", "author": "DryGeneral990", "body": "Yes the season is fall cause that's what alts are doing"}
{"id": "n6mccue", "author": "DryGeneral990", "body": "It's Sunday in Asia"}
{"id": "n6k8hjk", "author": "DryGeneral990", "body": "I should have known it wouldn't hit 4k this week when people started predicting ETH to 80k"}
{"id": "n6jb66v", "author": "piggleii", "body": "Yes and all the ETH haters will cry HAHAHAHA"}
{"id": "n6izf02", "author": "Due-Inspection-5660", "body": "yeah it is going to hit $4k soon. are you really so dumb that you think a 10% pullback means it's game over lmao?"}
{"id": "n6izizu", "author": "Ok-3ak3ak", "body": "After this dip! Even ETH need a break"}
{"id": "n6hevap", "author": "jwz9904", "body": "everyone waiting for cuts and then we will sell the news together"}
{"id": "n6jgx5g", "author": null, "body": "[deleted]"}
{"id": "n6j9b47", "author": "olduvai_man", "body": "Raoul Pal: \"Here's why that means we're entering the banana zone.\"\n\nYou'd think you predict something this often and you'd be right at least once. Guess not."}
{"id": "n6jo9lj", "author": "Maleficent_Sound_919", "body": "Monday dump, Tuesday dump..."}
{"id": "n6hy6vf", "author": "piggleii", "body": "This post is a bottom signal."}
{"id": "n6hy1nd", "author": "jwz9904", "body": "get ready to buy"}
{"id": "n6hq55p", "author": "DryMyBottom", "body": "well, we were below $100k 3 months ago so I wouldn't rule out the hypothesis to touch that again "}
{"id": "n6iy1su", "author": "SpontaneousDream", "body": "113k? Lol nah. A true shitshow would be a flash crash below 100k. That would absolutely decimate alts."}
{"id": "n6k7s86", "author": "DryGeneral990", "body": "ETH hasn't even hit ATH this cycle"}
{"id": "n6jdf12", "author": "jdf-", "body": "Imagine how low they will go during the actual bear!"}
{"id": "n6lj2my", "author": "VariatCA", "body": "Maybe for shitcoins.\n\nMeanwhile here in reality, BTC is up +288% from August 2nd 2023, up a staggering +$84,000."}
{"id": "n6kircf", "author": "DryGeneral990", "body": "Imagine contemplating suicide when BTC dips below 113k."}
{"id": "n6kio2d", "author": "Farvaharr", "body": "😭💀"}
{"id": "n6ht3lg", "author": "jwz9904", "body": "buckle up to blast off!"}
{"id": "n6hvw20", "author": "veryspookygirl", "body": "where can one see this information?"}
{"id": "n6hujqh", "author": "OderWieOderWatJunge", "body": "Sold almost everything, I'm buckled up to buy cheap in bear again"}
{"id": "n6iyt8f", "author": "DBRiMatt", "body": "Nope, just screenshots. 👍"}
{"id": "n6jafut", "author": "Burner26_", "body": "Can't take profits if you don't make profits."}
{"id": "n6jb3cg", "author": "piggleii", "body": "You think anyone who's not mostly in BTC is in profits?"}
{"id": "n6j56zj", "author": "namieorange", "body": "Yes and reinvest it in the dump. But it dumped more lol\nStill rotating at every pump. I'm hopeless"}
{"id": "n6izflo", "author": "Ok-3ak3ak", "body": "I think the best time to take profits is when it break à New ATH not when it dip"}
{"id": "n6kacbh", "author": "MichaelAischmann", "body": "Crypto was always permissionless aka for everyone. It has been used by worse people than Eric Trump if we're honest."}
{"id": "n6k7i81", "author": "DryGeneral990", "body": "Remember what happened the last time he said to buy ETH"}
{"id": "n6k4ltc", "author": "whataboutbenson", "body": "I feel you man. But it’s way bigger than those thugs."}
{"id": "n6lc729", "author": "GhostEntropy", "body": "for alts? zero"}
{"id": "n6ko1vv", "author": "PMmeuroneweirdtrick", "body": "Hmm perhaps take profits not screenshots is sage advice"}
{"id": "n6kogaj", "author": "TexasBoyz-713", "body": "3 comments in a row… damn you mean business"}
{"id": "n6ksmh7", "author": "piggleii", "body": "What if the top ain’t in?"}
{"id": "n6lb0wb", "author": "goldtank123", "body": "I took profits but then jumped back in"}
{"id": "n6lrw57", "author": "TechnicalRadish78", "body": "I've been hodling since 2017. If I took profits all the times I was told I should I'd have a fraction of my current holdings."}
{"id": "n6l74bz", "author": "TroubleInMyMind", "body": "This whole thread has been delusional exit liquidity all year"}
{"id": "n6g2c3o", "author": "Medium_Change4574", "body": "On CME Group it jumped from 37.7% (yesterday) to 89.8% today"}
{"id": "n6g5m2k", "author": "MarioWilson122", "body": "Should be a chance to get some type of cut even if its small. Im sure we are all hoping for a 1 or 2 point cut but probably not too likely."}
{"id": "n6g0rdi", "author": "MichaelAischmann", "body": "73% for 25 bps decrease, 8% for 50 bps decrease.\n\nSource: Polymarket"}
{"id": "n6g9922", "author": "SimbaTheWeasel", "body": "Papa Powell doesn’t want to cut"}
{"id": "n6h2wcc", "author": "x_lincoln_x", "body": "Last article I saw it mentioned said about 85% chance of rate cut in September."}
{"id": "n6g0o19", "author": "VincenteThomp", "body": "Reply hazy, ask again later."}
{"id": "n6g2u45", "author": "jwheel888", "body": "0 with ole' Jerome in charge. He is only concerned with going against Trump"}
{"id": "n6jmh0o", "author": "Pat_McCrotch", "body": "Yeah.. maybe start the week with a drop to stop out all the weekend warriors and trigger panic shorts, then the reversal comes. I could see the previous ATH of 112 being a logical support. Or 110 which would still hold bullish scenario intact. Drop below 109 and we’ll be back in the range from June"}
{"id": "n6jiu7f", "author": "Farvaharr", "body": "Explain"}
{"id": "n6ju6ni", "author": "namieorange", "body": "Bro, change your keywords every 10 posts, at least. To make it more entertaining, at least within the same daily"}
{"id": "n6juw2c", "author": "skyline917", "body": "You’re chatting pure waffle, mate,proper tapped. Soundin’ like a Tesco trolley with a dodgy wheel after one too many tins. You’ve fully lost the plot. Give your head a wobble, grab a cuppa, and stop moving mad with that bollocks.”"}
{"id": "n6jw0dt", "author": "reversenotation", "body": "Posting worthless idiot tier takes dozens of times a day, every single day."}
{"id": "n6gt25g", "author": "xarips", "body": "imagine buying that trash lmao"}
{"id": "n6iovia", "author": "dandiestweed", "body": "TACO Pedo President 🌮"}
{"id": "n6ir3iq", "author": "Simke11", "body": "People have short memories."}
{"id": "n6ise6n", "author": "piggleii", "body": "Powell will ensure there are no cuts."}
{"id": "n6ihqtk", "author": "Paddy_Powers", "body": "I'm thinking the exact same thing. BTC to $150k before we know it"}
{"id": "n6kemlc", "author": "lurkinns", "body": "Depends on your risk tolerance. If you feel comfortable taking a full hit for a possible recovery you should keep it otherwise sell off until you are comfortable"}
{"id": "n6kfkcm", "author": "KristianME", "body": "I sold my alts except eth 3 days ago. Not touching it again. Just dca btc and eth."}
{"id": "n6iws9y", "author": "kironet996", "body": "imagine buying top"}
{"id": "n6ixq34", "author": "SpontaneousDream", "body": "So glad I'm off that shitshow. It's still down massively against BTC. ETH/BTC is literally at the same price since **2016.**"}
{"id": "n6j8eot", "author": "PMmeuroneweirdtrick", "body": "If you factor in inflation you need about $5,500 to break even, or approx 15% return. Anything less and you have made a loss."}
{"id": "n6ix10m", "author": "jwz9904", "body": "Who do i send my plea to?"}
{"id": "n6lq9wr", "author": "Fhaticito", "body": "OnLy a LoSs if YoU SeLL HoDL"}
{"id": "n6icims", "author": "Annual_Juggernaut_47", "body": "You mad they are better traders than you?"}
{"id": "n6hewnm", "author": "jwz9904", "body": "orangeman owns you"}
{"id": "n6ggucd", "author": "noviwu97", "body": "It's been cooked for more than a year"}
{"id": "n6ghc1c", "author": "blastermckaster", "body": "Alt season is far from here. I expect the peak around October - November. It's a great time to enter. Definitely 3x - 10x opportunities in the Top 50."}
{"id": "n6ge73c", "author": "Simke11", "body": "No, alt season any minute now."}
{"id": "n6k64bv", "author": "DryGeneral990", "body": "There's too many damn alts with unlimited supply. Why own anything but BTC?"}
{"id": "n6jvg8m", "author": "tj78492", "body": "Even the ones that do, it doesn't matter if they dropped 90% first"}
{"id": "n6jq28m", "author": "piggleii", "body": "Grrrr"}
{"id": "n6m97gb", "author": "DryGeneral990", "body": "They will pump just long enough to create generational bag holders."}
{"id": "n6m74tq", "author": "TrumpAllOverMe", "body": "Narrator: it wasn’t"}
{"id": "n6mcw49", "author": "DryGeneral990", "body": "Wait til you see tomorrow's bottom"}
{"id": "n6j1tzy", "author": "MichaelAischmann", "body": "Tariffs or not I really don't care & neither do the protocols I use."}
{"id": "n6ixfhj", "author": "KalEl729", "body": "Copium max bro please chill a lil."}
{"id": "n6klm93", "author": "TexasBoyz-713", "body": "Are alts really that cooked?"}
{"id": "n6gtliq", "author": "jwz9904", "body": "time to buy"}
{"id": "n6irbno", "author": null, "body": "[deleted]"}
{"id": "n6jq5le", "author": "piggleii", "body": "Let’s get it over with then."}
{"id": "n6l9j3q", "author": "LTP-N", "body": "What's the coincidence with that vs. any other price?"}
{"id": "n6lavs8", "author": "Pat_McCrotch", "body": "yea i saw that too as it happened live, it's the exact high from may 22nd. it's a logical line of defense for buyers"}
{"id": "n6lc0hh", "author": "GhostEntropy", "body": "People set limit orders for round numbers, what's the coincidence?"}
{"id": "n6lbsdy", "author": "bimbobandit2016", "body": "Algorithms rule the financial markets now"}
{"id": "n6l9146", "author": "piggleii", "body": "No, I didn’t."}
{"id": "n6kubt3", "author": "piggleii", "body": "Ok reset and we can go up again."}
{"id": "n6lq0jb", "author": "jwz9904", "body": "The year is over halfway done already"}
{"id": "n6kjxl5", "author": "nomoney110", "body": "It will soon go up again once the last retail idiot has sold."}
{"id": "n6jcnac", "author": "OneManGangTootToot", "body": "Hurrrrrr hurrrrrrr"}
{"id": "n6ho9c0", "author": "jwz9904", "body": "i'll just use an aggregator"}
{"id": "n6jluv6", "author": "MichaelAischmann", "body": "No. Maybe. But Mostly No."}
{"id": "n6jo7bt", "author": "Maleficent_Sound_919", "body": "$92k coming soon"}
{"id": "n6k51iy", "author": "whataboutbenson", "body": "Surely down then, no?"}
{"id": "n6kbon8", "author": "MarioWilson122", "body": "Im sure we should see atleast a few more nice moves that are similar to 2 weeks ago before that happens. Which made it feel almost like we were heading towards a parabolic stage. The real movement probably wont happen until after they cut which is hopefully next month."}
{"id": "n6k6lns", "author": "SevereArrivals13", "body": "There is no one left to sell at these prices, the paper hands got their Moons burned with ease. \n\nNow we continue climbing up and reaching the next level of paper hands that will get their Moons bought up by advertisers and burned."}
{"id": "n6h2q0a", "author": "x_lincoln_x", "body": "Its guesstimate until real data comes in.  This same situation happened in the beginning of the pandemic."}
{"id": "n6g903h", "author": "Olskoolah", "body": "Lie this month to look good, then revise last months to not get caught. Nobody cares about last month’s lie because this month is the focus. Repeat monthly"}
{"id": "n6gaxyf", "author": "Pure_Concentrate8770", "body": "It’s good, now JPow has to cut rates"}
{"id": "n6g7xvr", "author": "devCheckingIn", "body": "Probably fudging them so the Fed could skip rate cuts this whole summer."}
{"id": "n6ly5zk", "author": "Annual_Juggernaut_47", "body": "So you’re shorting from here?"}
{"id": "n6ly37l", "author": "jwz9904", "body": "i hope noy but i am open to this possibility as well. Another 4 years of bagholding"}
{"id": "n6m3nt6", "author": "namieorange", "body": "Why? Because there's a correction like we've had like 10x already?"}
{"id": "n6hh8zk", "author": "jwz9904", "body": "Gotta wait"}
{"id": "n6hp2id", "author": "OderWieOderWatJunge", "body": "Any number is possible"}
{"id": "n6kmza7", "author": "Tsjanith", "body": "This is not what I'm feeling..."}
{"id": "n6kwcc3", "author": "Paddy_Powers", "body": "Then don't. Just DCA and sit back."}
{"id": "n6lb4h6", "author": "Next_Statement6145", "body": "these prophesies whenever the market starts moving in a direction are just hilarious"}
{"id": "n6lcj7z", "author": "MikeysOnTheMoon", "body": "SYBAU"}
{"id": "n6lcyp6", "author": "ieatvegans", "body": "You know as much as we do, which is nothing."}
{"id": "n6lj9tt", "author": "Annual_Juggernaut_47", "body": "You shorting?"}
{"id": "n6la9y5", "author": "nomoney110", "body": "we will pumps soon, maybe sunday evening."}
{"id": "n6l8znm", "author": "piggleii", "body": "Grrrrrr"}
{"id": "n6kj7of", "author": "DryGeneral990", "body": "Remember Luna?"}
{"id": "n6kj1qk", "author": "DryGeneral990", "body": "Last time he said to buy ETH at 2800, it dumped to 1400"}
{"id": "n6kqe33", "author": "HopiumTrump", "body": "you're still in profit right now"}
{"id": "n6krozl", "author": "decomposition_", "body": "Tim Apple can’t keep “getting” away with this"}
{"id": "n6hms65", "author": "PatMu5tard", "body": "Tip. Never think in certainties in crypto"}
{"id": "n6hk9yl", "author": "jwz9904", "body": "Seems like it"}
{"id": "n6jlkur", "author": "MichaelAischmann", "body": "DCA is the way."}
{"id": "n6hesre", "author": "JeopardyQBot", "body": "what about november when xrp. xlm, ada, doge etc all went up multiple Xs?"}
{"id": "n6hb78l", "author": "StraightStackin", "body": "The concentration of alts market cap  is still in the top percentage of coins."}
{"id": "n6h9217", "author": "jwz9904", "body": "i have only heard about the fabled alt season"}
{"id": "n6lnsc6", "author": "piggleii", "body": "Are you saying the narrative that every single BTC miner on the planet was selling their BTC to buy ETH to stake was false?!?!?!"}
{"id": "n6gvgt6", "author": "bowdenta", "body": "I had good results with P90X"}
{"id": "n6jo2m2", "author": "Maleficent_Sound_919", "body": "$92k even"}
{"id": "n6lbjaq", "author": "The_Nothing00", "body": "450k EOY! Golden bull!!! Greatest admin ever for crypto! LEt's go!"}
{"id": "n6kiszx", "author": "DryGeneral990", "body": "You mean beared"}
{"id": "n6khk9k", "author": "vb90", "body": "could've been worse, your wife getting slaughtered."}
{"id": "n6kmlhc", "author": "kebrzt", "body": "I got confused for a second"}
{"id": "n6haghp", "author": "Taraih", "body": "You mean ETH"}
{"id": "n6h251p", "author": "DryGeneral990", "body": "Tell us more about XRP"}
{"id": "n6gz8pq", "author": "HoldCtrlW", "body": "**XRP XRP XRP XRP XRP XRP XRP**"}
{"id": "n6hb33e", "author": "R8_M3_SXC", "body": "We always talk about XRP"}
{"id": "n6jprso", "author": "Next_Statement6145", "body": "you should be making so much money shorting it then"}
{"id": "n6jqa5l", "author": "PatMu5tard", "body": "What makes it fake? 🤣"}
{"id": "n6gfw2c", "author": "flyingstalli0n", "body": "I am retiring after alt season"}
{"id": "n6jmwlh", "author": "BrowsingCoins", "body": "They always revise them, but in both directions. This revision was exceptionally large in the downward direction and points to a weaker economy that many thought we had."}
{"id": "n6lzw8v", "author": "HSuke", "body": "It's because it takes time to collect the data from all the sources. BLS data gets revised because the initial estimates are often based on incomplete data, and later data collection provides a more complete and accurate picture.\n\nhttps://www.axios.com/2025/08/01/jobs-report-july-2025-revisions\n\nIt's kind of like how election estimates can swing wildly as more votes come in.\n\nThey were off by **only 0.01%** this time, which was the largest mistake they ever made since 2020.\n\nhttps://np.reddit.com/r/explainlikeimfive/comments/1mfhamk/comment/n6i05fb/"}
{"id": "n6jpdnq", "author": "ieatmoondust", "body": "Sir, this is a Wendy's..."}
{"id": "n6j0ufu", "author": "Alfador8", "body": "People outside the US that want dollars."}
{"id": "n6k1acu", "author": "PMmeuroneweirdtrick", "body": "I have screenshots to prove I'm pre rich and a bank account to prove I'm poor"}
{"id": "n6gj7ot", "author": "MichaelAischmann", "body": "You want some empathy? I mean Down Under has been through more red hours this month than most of us. ❤"}
{"id": "n6la1u9", "author": "VariatCA", "body": "I tried to tell Mr. Martingale how bad his gambling strategy is, but he was insistent... he just kept doubling-down on it."}
{"id": "n6ht08w", "author": "throwawayworries212", "body": "My SL triggered right in the 24hr low where it bounced, but I bought back in anyway. I don't know what I'm doing, but I do know I'm doing my part"}
{"id": "n6hxoph", "author": "flarept1", "body": "113,112, 110 and 108 are all valid bullish targets according to TA. Lower than that and it's not good.\n\nAnyways, it's never a straight arrow up or down. We're probably consolidating some now.\n\nIt doesn't account for trump shenanigans ofc.\n\nBut sentiment is usually a sign of a reversal soon.\n\nAll the ETH ATH incoming was a signal of a pullback.\n\nJust like now everyone is saying bull market is over and that ETH is going back to sub 3k.\n\nWe're probably ranging today and tomorrow we recover some ground, then chop the rest of the month."}
{"id": "n6hz3xq", "author": "SeverusSchnaps", "body": "BTC maxis did the same with BTC 100k, Doge maxis with Doge to 1$ and Ada maxis with Ada to 10$\n\n\nSo what's the point? "}
{"id": "n6jpu57", "author": "ieatmoondust", "body": "Jerome Powell is going to \"accidentally OD on fentanyl\" in the next few weeks. Shame about that habit, such a disgrace."}
{"id": "n6jst3x", "author": "KalEl729", "body": "Its definitely dumping on Monday"}
{"id": "n6zbgj0", "author": "ivan971", "body": "Yep, hopefully we stay up for a few days."}
{"id": "n6kcarb", "author": "SeverusSchnaps", "body": "In Europe we kick them with our feet. Thus we call it football. In the colonies they drag it across some field and call it football too... "}
{"id": "n6k9522", "author": "Proper_Mastodon324", "body": "I've been stacking ETH at low prices the last few weeks. If ETH does well in the coming months I will be very happy. Need it not to crash tho 😅"}
{"id": "n6hduae", "author": "ElPeroTonteria", "body": "because in TA all things are possible."}
{"id": "n6htke2", "author": "ABrad11", "body": "Pinky promise"}
{"id": "n6htlkj", "author": "Simke11", "body": "Pinky promise"}
{"id": "n6hb6aq", "author": "whataboutbenson", "body": "Ironically makes it less likely that Powell will cut rates."}
{"id": "n6jepa0", "author": "decomposition_", "body": "He’s distracting from how many times his name shows up in the Epstein documents"}
{"id": "n6k0r3h", "author": null, "body": "[deleted]"}
{"id": "n6kjwjv", "author": "DynamoPro", "body": "It’s always been the way"}
{"id": "n6ks8fi", "author": "decomposition_", "body": "Yet if J Pow did what Trump was requesting, you’d blame the next Democratic administration for the inflation that resulted from that lol"}
{"id": "n6h2fpu", "author": "x_lincoln_x", "body": "I read 85%... in September."}
{"id": "n6gmmxz", "author": "VariatCA", "body": "Yep, he'll bring back all the low-wage factory labor for cheap goods to compete against CHYNA, and he'll greenlight importing tons of H1B-Visa immigrants to get paid low wages to do the high-wage tech jobs we need here. We Americans can't be expected to handle STEM tech jobs soon after our education departments are gutted, after all."}
{"id": "n6h2zvd", "author": "pikkuhillo", "body": "Yes, by deporting all the migrants doing manual labor there will be much jobs available which Americannots or won't do :>"}
{"id": "n6ksdk8", "author": "piggleii", "body": "No actually I swapped a small amount of my BTC for ETH. Still holding ETH but I think it’s proving itself to be a losing position, especially long term it’s probably a bad decision."}
{"id": "n6j88a3", "author": "AlertCrab9829", "body": "Yea put more in when was dipping but dipped again of course, feel like I should just swap it into ADA because that’s also down 15% on the weekly now and feels like a safer bet on not dumping completely"}
{"id": "n6m1dp2", "author": "decomposition_", "body": "Na dude it’s totally a hedge fund conspiracy that just happens to match the magnitude and direction of the broader market"}
{"id": "n6mc9re", "author": "DryGeneral990", "body": "It's as if everything follows each other."}
{"id": "n6nvash", "author": "vekypula", "body": "The tariffs were announced a month ago."}
{"id": "n6kozo7", "author": "KristianME", "body": "Might actually happen. I dont think economy is in a good place, unwarranted push to ATH. Also a lot of uncertainty with Trump, and tarrifs will decrease economic growth in US. \n\nMy portfolio will last longer than the old man, so i dont care if we get a proper dip sub 100k, ready to load up then."}
{"id": "n6l5f8t", "author": "kironet996", "body": "still have my limit order there from few years back :("}
{"id": "n6jsiri", "author": "KalEl729", "body": "Leak those files. Let the orange burn!!"}
{"id": "n6jz63m", "author": "VariatCA", "body": "I'm not terribly concerned about comparing a short-term burst ATH value of 123k any more than I was concerned about 111.6k back in May/June. It's a benchmark of comparison, sure, but it's a short lived valuation at which very little trading occurred. \n\nThe strength of comparison lies in the range it fights to hold. Since July 10th it's been fighting to maintain the 117.5k range, and fluctuated only a couple percent above/below that."}
{"id": "n6jvofp", "author": "tj78492", "body": "Which is nothing frfr, the numbers are just bigger now"}
{"id": "n6kverd", "author": "Maleficent_Sound_919", "body": "You won't catch me ever saying the last part"}
{"id": "n6kp2ug", "author": "Maleficent_Sound_919", "body": "They did went up 200-500% but I expected more got greedy"}
{"id": "n6loeyl", "author": "inappropriateshallot", "body": "You see reasons, I see excuses.-  *tips sombrero and saunters away on donkey into the mist*"}
{"id": "n6kfqbs", "author": "LaOnionLaUnion", "body": "If I send 8k USD to the Philippines the sending bank will charge me 45 and the receiving bank will do the exchange. But it’s still cheaper than remittance services which charge horrible exchange rates. \n\nTrump added a 1% tax on remittances that will start in January. That would make the cost an additional 80. I imagine with crypto I’m going to lose less money changing over to PHP."}
{"id": "n6m7uwt", "author": "DryGeneral990", "body": "Maybe he thought it would go straight to a million"}
{"id": "n6lryt5", "author": "TechnicalRadish78", "body": "It'll revisit zero amirite."}
{"id": "n6iybi9", "author": "digitalundergrad", "body": "This man cave is more like a man's grave."}
{"id": "n6i9r6z", "author": "hodler1992", "body": "Hodlers gonna hodl"}
{"id": "n6lbve1", "author": "The_Nothing00", "body": "Sell the red and then buy back in when it hits a new ATH. Genius move."}
{"id": "n6krtvn", "author": "JeJ34", "body": "😂"}
{"id": "n6m7zmw", "author": "KalEl729", "body": "Just one guy lol"}
{"id": "n6izv9x", "author": "KalEl729", "body": "Its been on an extended break since 2021"}
{"id": "n6htq9x", "author": "throwawayworries212", "body": "Polymarket predicting a rate cut, so fingers crossed!"}
{"id": "n6jpjap", "author": "xarips", "body": "blue haired lefties in a nutshell man"}
{"id": "n6jl016", "author": "shortsermons", "body": "Yea"}
{"id": "n6kcaoo", "author": "DoctorMario1000", "body": "Raol “eth to 20k in 2021” Paul"}
{"id": "n6i48jq", "author": "Farvaharr", "body": "It’s just basic chart analysis"}
{"id": "n6je7et", "author": "decomposition_", "body": "It’d also decimate practically all longs"}
{"id": "n6jo5q1", "author": "Maleficent_Sound_919", "body": "Yeah thats a problem..."}
{"id": "n6ln8tp", "author": "davink91", "body": "Good for u man. Why dont u join the BTC sub then, what r u doing in a crypto sub?"}
{"id": "n6kjiz5", "author": "VariatCA", "body": "Or having to explain to the Operator that it's because you put your life savings into something called Fartcoin and it's down 90%"}
{"id": "n6kktkt", "author": "Davek56", "body": "Valid."}
{"id": "n6hyi2m", "author": "kironet996", "body": "coinglass"}
{"id": "n6jilm4", "author": "AprilsMostAmazing", "body": "i'm in profit on many different alts and that's other partial selling"}
{"id": "n6j1rxi", "author": "jdf-", "body": "Waiting for ATHs will guarantee you lose everything"}
{"id": "n6j2frd", "author": "AprilsMostAmazing", "body": "well the profits should have been taken during the pump"}
{"id": "n6kxepu", "author": "Medium_Change4574", "body": "I took neither cause the whole pump was a fucking joke and not screenshot worthy in the first place"}
{"id": "n6kqfsj", "author": "reversenotation", "body": "Maybe the Enter key on the keyboard is stuck?"}
{"id": "n6kp48q", "author": "Maleficent_Sound_919", "body": "Im pissed"}
{"id": "n6kvcf4", "author": "Maleficent_Sound_919", "body": "Alts still fucked and $150-165k top max"}
{"id": "n6m9eyy", "author": "DryGeneral990", "body": "A tale as old as time"}
{"id": "n6g2u4m", "author": "brkinard", "body": "Fed CME Watch: 90% chance cut. Always correct."}
{"id": "n6g0w8d", "author": "Dzerikas", "body": "Wow so an actual chance??"}
{"id": "n6gic1m", "author": "Dzerikas", "body": "But the job report kinda forces him too🤔"}
{"id": "n6g4t1f", "author": "MichaelAischmann", "body": "1. More board members make the decision.\n2. Trump actively causes inflation."}
{"id": "n6k1j3x", "author": "Due-Inspection-5660", "body": "british person detected!!!"}
{"id": "n6k1dyj", "author": "Carbapenemayonaise", "body": "This guy puts shrimp on the barbie .\n."}
{"id": "n6jx53y", "author": "bizaroo933", "body": "Haha angry yanki because I tell the truth. Please dont shoot me with your legal gun, please take your diabetes medication and kalm down yanki"}
{"id": "n6gyov0", "author": "Ok_Golf_6467", "body": "Trash? We will see."}
{"id": "n6itr8c", "author": "Due-Inspection-5660", "body": "it isnt his decision and in light of the jobs revisions a cut in september is almost certain."}
{"id": "n6itfts", "author": "reversenotation", "body": "Have you kept your ETH?"}
{"id": "n6iyyze", "author": "DBRiMatt", "body": "And then ignoring the prices when the ETH/BTC ratio was so low.\n\nFantastic trading opportunity presented itself!"}
{"id": "n6k8mde", "author": "DryGeneral990", "body": "Would have been better off buying the S&P"}
{"id": "n6gi64a", "author": "Dzerikas", "body": "Bro is well done steak by now"}
{"id": "n6gytnu", "author": "Swerve99", "body": "doubt it"}
{"id": "n6knt5k", "author": "Maleficent_Sound_919", "body": "Because alts used to 10x"}
{"id": "n6m7egt", "author": "MikeysOnTheMoon", "body": "😂😂😂"}
{"id": "n6mfodt", "author": "MikeysOnTheMoon", "body": "Narrator: or was it"}
{"id": "n6mfpvp", "author": "MikeysOnTheMoon", "body": "Check it out, this guys got a crystal ball over here"}
{"id": "n6izgci", "author": "Due-Inspection-5660", "body": "did you panic sell again LMAO/??"}
{"id": "n6gw7zm", "author": "KalEl729", "body": "On it."}
{"id": "n6irl5o", "author": "ioWxss6_bot", "body": "Yeah, it's kind of been an issue since the inception of the thing. It's getting worse, I agree. Wonder if I should employ llms to do the counting..? But that's probably going to be costly..."}
{"id": "n6jqx4c", "author": "decomposition_", "body": "A good chunk just did, I hope that’ll help with the buying pressure now"}
{"id": "n6lddt5", "author": "VariatCA", "body": "It's also a nice, round number just above the May/June ATH of 111.6k, so it tends to attract a nice fat buy-wall to bounce up off from."}
{"id": "n6hoe7q", "author": null, "body": "[deleted]"}
{"id": "n6kccfm", "author": "bimbobandit2016", "body": "Yeah, but it could go up further than I think. I'm currently thinking 120 something k at best on the next leg up"}
{"id": "n6hx066", "author": "Striking_Conflict176", "body": "I think 4 billion is impossible."}
{"id": "n6ld2k6", "author": "davink91", "body": "Men lie women lie. But charts dont lie."}
{"id": "n6ltee5", "author": "Simke11", "body": "They never do. Otherwise they'd be making money instead of crying here."}
{"id": "n6km3ya", "author": "PMmeuroneweirdtrick", "body": "Looks like we're on our way down again"}
{"id": "n6hoabi", "author": "jwz9904", "body": "the chart moves to the right"}
{"id": "n6hyia1", "author": "xarips", "body": "still didnt come close to what coins were doing in 21"}
{"id": "n6h9hdt", "author": "Pat_McCrotch", "body": "2017 was even better.. good times, was so much simpler back then tbh"}
{"id": "n6hdoup", "author": "ElPeroTonteria", "body": "So back in the long-long-ago. BTC and the Alts were all on the same playing field. But BTC got called up to start on the big leagues, ETH might-could have just got a contract too.... So the money just doesnt spread as far."}
{"id": "n6h4gkv", "author": "ReadersAreRedditors", "body": "I did that in college, then I moved on to strong lifts, now I believe in myself and make huge gainz!"}
{"id": "n6kjcnq", "author": "Intelligent-Ad8242", "body": "That's an Xrp holder experience"}
{"id": "n6ko42c", "author": "KIKOMK", "body": "the new ath 🤣"}
{"id": "n6jqti0", "author": "Annual_Juggernaut_47", "body": "Look at the recent history. Although they do get revised in both directions, the overwhelming majority is downward. The modeling has been extremely poor for years. \n\nIt’s only weaker now to people that believed the poorly modeled jobs numbers. It was obvious to anyone paying attention to the conditions on the ground."}
{"id": "n6m956e", "author": "Annual_Juggernaut_47", "body": "The 0.01% stat is ridiculous because they are not recalculating every position every month. It’s mathematical trickery to makes it look like a small error when it isn’t. You are quantifying change on the margin. Make no mistake, the past couple months revisions were huge misses. \n\nI understand they are modeling and more data is coming in that results in corrections. Regardless of how ‘hard’ it is, if your modeling consistently overestimates jobs, you don’t just blindly stick with the model. You figure out why your modeling consistently overestimates and is performing poorly and update. Revisions would ideally be a normal distribution about zero if modeling was accurate. Obviously they have failed at this. \n\nIs your contention that we should we all just continue to accept bad numbers that have gigantic sway over major economic decisions, and those in charge shouldn’t be held accountable for continuously producing biased data?"}
{"id": "n6j2btf", "author": "MichaelAischmann", "body": "What they don't want is their own fiat."}
{"id": "n6gjp5t", "author": "DBRiMatt", "body": "Bloody oath, it's already Saturday afternoon!\n\nThe only green in sight is that of the grass xD"}
{"id": "n6lnzyq", "author": "piggleii", "body": "Or you could just put your entire capital in one entry and end up bagholding like the OP said."}
{"id": "n6hecbp", "author": "StraightStackin", "body": "So do or don't do anything 🤣"}
{"id": "n6ku144", "author": "piggleii", "body": "I just accept what the markets give me."}
{"id": "n6kp90n", "author": "Maleficent_Sound_919", "body": "Thats all been there for al ong time...\n\nWhats in your portfolio?"}
{"id": "n6m87ue", "author": "DryGeneral990", "body": "He will live forever."}
{"id": "n6kpv1d", "author": "VariatCA", "body": "Greed is why you're in alts / memes instead of BTC in the first place, and why tons of alts still have generational bagholders who refuse to give up or accept their situation enough to take a loss & put that money to better use."}
{"id": "n6idiyy", "author": "Every_Hunt_160", "body": "Username checks out"}
{"id": "n6jvlxw", "author": "CGI_OCD", "body": "Lmao...diaper simp."}
{"id": "n6jle0l", "author": null, "body": "[deleted]"}
{"id": "n6jdub2", "author": "decomposition_", "body": "What are you basing your conclusion on?"}
{"id": "n6lqcf0", "author": "VariatCA", "body": "If you want a sub where all they talk about are random alts, memes and shitcoins while completely ignoring Bitcoin, maybe try r/wallstreetbetscrypto or r/moonshotcrypto or some other degen gambling sub.\n\nOr just don't make up total B.S."}
{"id": "n6lo6lp", "author": "ChartMurky2588", "body": "Btc is a form of crypto"}
{"id": "n6lq10r", "author": "bizaroo933", "body": "Dont mind him. This guy is just a troll and repeats every day that shitcoins are wortless and brags how great his bitcoin purchases are, even though he is hanging 24/7 in the sub called CRYPTO currency instead of BITCOIN curreny. He enjoys when people lose money on altcoins. Miserable person"}
{"id": "n6jpkir", "author": "piggleii", "body": "Wow you’re really good at this."}
{"id": "n6kp4s9", "author": "Maleficent_Sound_919", "body": "At myself"}
{"id": "n6gp94y", "author": "devCheckingIn", "body": "They knew the job report beforehand.  That's why they changed their narrative this week to say that the labor market is \"in balance\" and as Powell said, from here on out they're only looking at the unemployment rate number on the labor side of things.  You'll keep hearing that language more and more as the Fed governors speak in the coming weeks to justify their inaction."}
{"id": "n6g5ps4", "author": "devCheckingIn", "body": "Were we ever able to figure out how much inflation was caused by the Fed's 100 bps rate cuts at the end of last year?\n\nApparently the argument is that rate cuts are inflationary."}
{"id": "n6k4ze9", "author": "reversenotation", "body": "I'm a European not a Yankee.  You certainly don't need to be Yankee to dump on your unhinged mouth breather low IQ idiocy, which you reliably display countless times every single day"}
{"id": "n6k0bs1", "author": "VariatCA", "body": "We're sorry your shitcoin plummeted and you can't afford to eat this month."}
{"id": "n6h5wyk", "author": "ReadersAreRedditors", "body": "Ghost chain"}
{"id": "n6jak5h", "author": "piggleii", "body": "Yes it is his decision. And he won't cut rates to spite Trump."}
{"id": "n6ix304", "author": "Due-Inspection-5660", "body": "yes"}
{"id": "n6kcywo", "author": "PMmeuroneweirdtrick", "body": "Absolutely unless you bought the dip."}
{"id": "n6hddn1", "author": "blastermckaster", "body": "Let's see how this plays out, I'm only a few hundred bucks up at the moment but hopefully that can become thousands. There's a lot going on, it could happen."}
{"id": "n6le89b", "author": "GhostEntropy", "body": "those days are long gone."}
{"id": "n6mghpq", "author": "DryGeneral990", "body": "Says the person calling bottom..."}
{"id": "n6izsp0", "author": "KalEl729", "body": "Yes i did. Please bookmark this comment so that you can bring it up again in a few days."}
{"id": "n6hpkml", "author": "jwz9904", "body": "An aggregator like defillama swap"}
{"id": "n6hq14c", "author": "PatMu5tard", "body": "Something like CoWSwap. When you swap, it looks at multiple liquidity pools at once to find the best price. And can split your swap across those pools, combining it into a single trade on your end"}
{"id": "n6krp96", "author": "whataboutbenson", "body": "I'm with you, honestly."}
{"id": "n6hx9sz", "author": "OderWieOderWatJunge", "body": "I meant \"down\""}
{"id": "n6lfhw4", "author": "ieatvegans", "body": "Charts show what already happened, not the future. Anything more than that is astrology."}
{"id": "n6lwuco", "author": "Annual_Juggernaut_47", "body": "That’s why I like to ask. All talk."}
{"id": "n6mflr1", "author": "HSuke", "body": "Do you even realize how hard it is to determine whether someone is employed?\n\nThere's probably 5% of the population that is making money but not even reporting employment to avoid taxes. A 0.01% difference is nothing in comparison."}
{"id": "n6jdsp7", "author": "Alfador8", "body": "Correct. They'd rather hold dollars that are depreciating more slowly than their local currency."}
{"id": "n6hjgjc", "author": "_Commando_", "body": "Flip a coin or use the \"Jump to conclusions\" matt."}
{"id": "n6kwpwr", "author": "KristianME", "body": "Only btc and eth, around 10% of portfolio. Rest is norwegian dividend stocks and ASTS, NBIS and RKLB."}
{"id": "n6krs7v", "author": "Maleficent_Sound_919", "body": "True I should have known better I used to have BTC but alts burned me many times"}
{"id": "n6mmzzb", "author": "xarips", "body": "cry harder"}
{"id": "n6jlnnt", "author": "shortsermons", "body": "It’s true though"}
{"id": "n6nix76", "author": "davink91", "body": "All you ever talk about is BTC. Then post on that sub"}
{"id": "n6lq3x5", "author": "VariatCA", "body": "Easily THE most important, trusted, heavily-networked and invested crypto and it's not even close. Seeing people shun it around here is *insane*."}
{"id": "n6juu1f", "author": "AprilsMostAmazing", "body": "No I just got really lucky with my buys and sells. I fully understand i'm in an online casino gambling. The only thing intelligent I am doing is not letting FOMO win"}
{"id": "n6kug1k", "author": "piggleii", "body": "Learning to love yourself, it is the greatest love of all."}
{"id": "n6gpxd4", "author": "Dzerikas", "body": "So if they knew it beforehand does that mean they wont cut in September maybe?"}
{"id": "n6k7ubr", "author": "reversenotation", "body": "Suspect any crypto portfolio will be of the imaginary type"}
{"id": "n6k11w7", "author": "bizaroo933", "body": "Are you 24/7 in this sub? Everytime I post you respond very fast doesnt matter which time. Go touch some grass its good for your health!"}
{"id": "n6llelc", "author": "Maleficent_Sound_919", "body": "Yup the insane amount of new coins each day fucked that up"}
{"id": "n6sgt7s", "author": "MikeysOnTheMoon", "body": "Huh"}
{"id": "n6hq8di", "author": "DryMyBottom", "body": "thanks for clarifying, I didn't know the existence of something like that!"}
{"id": "n6ltg20", "author": "Simke11", "body": "Ben Cowen told him"}
{"id": "n6lfugi", "author": "davink91", "body": "Charts show patterns of human behaviour. And in investing (and in life) patterns of human behaviour tend to repeat."}
{"id": "n6jmi9y", "author": "MichaelAischmann", "body": "Back to \"Who needs stablecoins anyway?!\"\n\nI don't want an asset that depreciates more slowly - I want one that appreciates."}
{"id": "n6lsylf", "author": "Simke11", "body": "They weren't happy with up to 8x returns (depending on average buy price), so they proceeded to lose 90% with alts. If that's not gambler's mentality I don't know what is."}
{"id": "n6kvgm8", "author": "Maleficent_Sound_919", "body": "You mean with your hand?"}
{"id": "n6ila4w", "author": "devCheckingIn", "body": "I'm not expecting any cuts this year."}
{"id": "n6k1jga", "author": "VariatCA", "body": "Says the guy shitposting doomer-takes 16 hours a day. I think your blood pressure from watching your shitcoins dump might be higher than the Burgers you try to make fun of."}
{"id": "n6mhnw9", "author": "DryGeneral990", "body": "Isn't it funny the same people who don't want fiat cause it prints with an unlimited supply... buy crappy alts that are minted with an unlimited supply"}
{"id": "n6hsadg", "author": "PatMu5tard", "body": "Added bonus with CoW Swap is that it makes a “Moooo” sound when you trade"}
{"id": "n6lgdf5", "author": "VariatCA", "body": "\"The last two days were red, which if my skills at connect-the-dots when i was 3 years old is any indication, the next day will be red too. Like and subscribe to my economics newsletter.\""}
{"id": "n6jsqyt", "author": "Alfador8", "body": "A lot of international stablecoin users value the relative stability of the dollar. Yes, they could hold bitcoin instead and it would perform better in the long run, but if they're living barely above the subsistence poverty line they can't afford the short term volatility."}
{"id": "n6hsgk9", "author": "DryMyBottom", "body": "lmao, is that true?\ngonna try that just in case 😅"}
{"id": "n6lglnn", "author": "davink91", "body": "Bro, you do realize there are people making millions from trading charts and technical analysis right? There are literally whole prop firms who trade charts. While you are here acting a child. Lol"}
{"id": "n6juzsm", "author": "MichaelAischmann", "body": "Absolutely right. It does make sense for a lot of people especially if you do need it as medium of exchange. But then again they do need to save differently if they want to rise above the poverty line."}
{"id": "n6lijm5", "author": "TroubleInMyMind", "body": "TA astrology folks crack me up wtf do they think quants do.\n\nAlso if they zoomed out and looked at the most basic indicators a lot of these movements would be less surprising and they wouldn't be begging for shit they don't remotely understand like the Fed to save their shitcoin ports."}
{"id": "n6lhgnk", "author": "VariatCA", "body": "Sorry Ben Cowen, carry on. Maybe you'll be right for once in 2025."}
{"id": "n6jw3mm", "author": "Alfador8", "body": "Everything is relative. If their local currency devalues significantly compared to the dollar, then they are relatively wealthier if they save in dollars. But you're right, if they take the excess 'wealth' and save it in bitcoin (or any asset that appreciates relative to the dollar) instead, they would be better off in the long run."}
{"id": "n6lhm3w", "author": "davink91", "body": "RemindMe! 30 days"}
{"id": "n6lhuml", "author": "VariatCA", "body": "Ah, Ben Cowen's favorite strategy! Kick the can down the road with predictions, and praise himself if they turn out right, and ignore them if they turn out wrong, claiming \"the timeline is a bit different, but let's see where we're at in another 30 days.\""}
