{"id": "n69fza8", "author": "AutoModerator", "body": "We've launched a r/CryptoCurrency and Moons Discord! Join to chat about crypto and moons, sign up for news, governance, and other alerts, and watch burns as they happen! https://discord.gg/ZuU9Gqeqmy\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CryptoCurrency) if you have any questions or concerns.*"}
{"id": "n6d819f", "author": "vb90", "body": "That jobs print is actually phenomenal. It's actually so bad that it should require a federal investigation. This is simply malpractice lol..."}
{"id": "n6crs9e", "author": "Due-Inspection-5660", "body": "CME Fedwatch now puts the odds of a rate cut in sep at 80%. wow!"}
{"id": "n6cr6l5", "author": "Paddy_Powers", "body": "Panic not. Everything is down and this won't last. "}
{"id": "n6e84s4", "author": "devCheckingIn", "body": "CNBC:  \"President Donald Trump on Friday demanded the firing of the Bureau of Labor Statistics commissioner, hours after the agency reported that job growth in the U.S. had slowed to a near-halt.\"\n\nYeah, that should fix the problem..."}
{"id": "n69p0f2", "author": "ieatvegans", "body": "Maybe the real treasure was the screenshots we made along the way."}
{"id": "n6b5irx", "author": "Maleficent_Sound_919", "body": "Ahhh all negativity I can rest assure we will go up soon!"}
{"id": "n6eoke0", "author": "crypt0Ruski", "body": "This mini dump reminds me of how I got shaken out in my first bull cycle in 2017. So many lessons learned since then. Man, I love crypto. You have to be psycho to get your tickets to ride this roller coaster."}
{"id": "n69xzbh", "author": "wotboisRevenge", "body": "This ‘dip’ finally got rid of most of the long leverage. there were $20B of Longs sitting there and now they’re rekt, now $15B in shorts are piling up. We all know what happens next. Price follows where the most liquidity is, wouldn’t surprise me if there’s a new ath for btc in a week or two."}
{"id": "n69re3k", "author": "SmtyWrbnJagrManJensn", "body": "What the dump?"}
{"id": "n69rl26", "author": "CipherScarlatti", "body": "How/why is it August 1 already?  \nTime is flying."}
{"id": "n6bzhrj", "author": "wvutrip", "body": "Stock market going to have a correction. Tariffs are back. Alts will be decimated like usual."}
{"id": "n6e7nbz", "author": "TroubleInMyMind", "body": "We are 7 months into the dec/jan top sellers being correct."}
{"id": "n69xl86", "author": "L0DIDE", "body": "Man, ETH is actually holding up a bit. I'm so used to it just dropping like 10x more than BTC every time."}
{"id": "n69m8qu", "author": "Ok_Golf_6467", "body": "Shake out before 1 more big pump. I'll be taking profits in August for sure"}
{"id": "n69q35f", "author": "bowdenta", "body": "The CME gap has been filled! Bounced right off of it"}
{"id": "n6efulg", "author": "davink91", "body": "I know as soon as I open that 10x short we will moon, I have that much effect on the market. Should I do it chat?"}
{"id": "n6awvc8", "author": "JeopardyQBot", "body": "sometimes i lie awake at night thinking about that ftx feature that let you withdraw coins you did not own"}
{"id": "n6bzl2w", "author": "NurUrl", "body": "Remember buy high Sell Low...."}
{"id": "n6cq92q", "author": "Dorkasteri", "body": "This is not even bad considering how much SPY is falling. Chill out."}
{"id": "n6d4g3c", "author": "delastunicorn", "body": "I think I’ve seen this film before and I didn’t like the ending."}
{"id": "n6e3qtx", "author": "Exotic_Cantaloupe_96", "body": "I guess some more ETH in august doesn't hurt. If ww3 happens we re all fucked anyway."}
{"id": "n6ekmsa", "author": "Everest2017", "body": "Golden age lol"}
{"id": "n6a2zdm", "author": "rsicher1", "body": "Not worried at all.\n\nI have limit buys all the way down.\n\nIt will go back up.\n\nNot selling until I retire."}
{"id": "n6ewi91", "author": "esiewert", "body": "I think I might just sell what's left of my alt portfolio so I can buy my family a big mac to share."}
{"id": "n69sugr", "author": "VariatCA", "body": "BTC just loves to make a big show of things lol. S&P dropped -1.4% from its peak today, tariff information materialized after-hours with Trump's newest Executive Order, and futures are down just a fraction of a percent.\n\nIt's probably not going to reverse itself tonight though lol, so you can either spend the next 12-36 hours panicking, or just hang tight until tomorrow where we'll see how the market progresses."}
{"id": "n6b2ddx", "author": "VariatCA", "body": "I'm not sure which is more hilarious when reading these Dailies: Seeing people confidently declare that \"Crypto Winter has begun\" after every 1-2% dip, or the people who were declaring \"The start of a face-melting-gains Alt Season\" after like 2 days of green candles for alts.\n\nEveryone seems to just operate on such hyper-localized minute time scales, and are in such a rush to try to extrapolate from there."}
{"id": "n6b4i7i", "author": "ghost-age-1000", "body": "There has been so many  good news around crypto these days, but still market is red, fuck this shit. If it was 2017 or 2021 , i would have been rich by now."}
{"id": "n6e82w1", "author": "Medium_Change4574", "body": "BTC just made a new daily low while altcoins didn't, altszn confirmed"}
{"id": "n69gnly", "author": "YappingOldMan", "body": "It will be ok in the end my friends, keep DCA. The faithful shall be rewarded."}
{"id": "n6c981y", "author": "delastunicorn", "body": "What is this candle lol"}
{"id": "n6dahib", "author": "decomposition_", "body": "How do people see where longs and shorts are getting liquidated? Is that what’s happening right now?"}
{"id": "n6fn0hl", "author": "New-Tailor4071", "body": "i lost all my money on longs"}
{"id": "n6fnc1v", "author": "Mysterious_Ad_4658", "body": "Expect a bounce before 109k, if btc has a weekly close below 109k that will be worrying as btc has never wicked below or closed below a key breakout level this cycle"}
{"id": "n6abocc", "author": "jwz9904", "body": "118k by wkends"}
{"id": "n69s6xy", "author": "b1mm3rl1f3", "body": "Highest monthly close ever on BTC, highest for ETH since 2022. Probably nothing 😉"}
{"id": "n69hlse", "author": "whataboutbenson", "body": "You guys crying about 10% dips or even 1% dips should be ashamed to call yourselves crypto bros. The OGs held through 90% crashes. How? With belief in the project and with balls. But you can only believe if it’s a truly good project. If your shitcoin is down 70% from its ATH in the middle of a bull market, guess what, you’ve been marketed to and played. Just sell it already and dust yourself off."}
{"id": "n6a4jj3", "author": "Brunosaurs4", "body": "Okay, *not* funny to wake up to"}
{"id": "n6cdz68", "author": "DBRiMatt", "body": "My volatile asset is being volatile again! 😠"}
{"id": "n69qazn", "author": "Swerve99", "body": "FREAK THE FUCK OUT AND SELL EVERYTHING"}
{"id": "n69j5tq", "author": "VariatCA", "body": "BTC has had these little 2-3% panic selloffs like once a week lmao. Check the chart and see how it worked out back on July 14th and 24th.\n\nI'll be shocked if BTC isn't back up to 118k by Saturday morning. If there's one thing the rich HATE it's panic-selling into a dip. April was a harsh lesson on how quickly you can miss the train once you get off.\n\nThe rich just own way too much of the cryptospace, and have too much goddamn MONEY these days to let sit on the sidelines."}
{"id": "n69tlqp", "author": "JustHalfANoob", "body": "20% tariffs on Taiwan, guess electronics are about to get more expensive for Americans"}
{"id": "n6e2jsd", "author": "Maleficent_Sound_919", "body": "Trump : \"What can I do to distract them from the Epstein stuff\"\n\n\"ding dong\"\n\nTrump : \"Lets get back on the WW3 horse that will teach em\""}
{"id": "n6emqgj", "author": "Antique-Athlete-8838", "body": "Eth shitting the bed"}
{"id": "n6ezw9v", "author": "VariatCA", "body": "Relatively speaking, we had multiple drops back during the May/June chop that were very similar to today's.\n\nA drop down to 113.1k from the ATH of 123.1k is relatively equivalent percentage-wise to our infrequent visits to the 100-101k range while the ATH was around 111.6k back in May/June.\n\nRed Days always tend to sting, but try to be objective about the situation. This was not an isolated crypto event, as both the S&P / Nasdaq (both of which encompass a vastly larger market cap representation) also suffered to the respective tune of -1.6% and -2.2%. \n\nOn the bright side for a forward-looking perspective, there is still definitely room (and incentive) to further negotiate or delay the new tariffs announced yesterday. \n\nWhile the FED was hesitant to continue cutting rates due to tariff-inflation woes, the jobs report gives additional ammunition to cut rates a bit to help ease Unemployment. Remember, the FED mandate is 2 parts: Unemployment and Inflation. Tariffs can cause inflation, but rate cuts can (in theory) aide soothing unemployment."}
{"id": "n6fiopl", "author": "Intelligent-Ad8242", "body": "Shit's so ugly..."}
{"id": "n6fvgy0", "author": "ivan971", "body": "Pullback and crab over the weekend until we pump Sunday night EST when futures open, which will be green, and then up again with the US market open on Monday."}
{"id": "n6a1jhm", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-07-31 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|291|  \n|ETH|136|  \n|XRP|51|  \n|MOON|36|  \n|SOL|34|  \n|XMR|33|  \n|LTC|19|  \n|HOME|17|  \n|ZEC|17|  \n|SNT|16|  \n|IP|15|  \n|LINK|14|  \n|SAFE|13|  \n|USDT|13|  \n|REQ|12|  \n|ADA|10|  \n|MATIC|10|  \n|CORECHAIN|9|  \n|ME|9|  \n|ARB|8|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6axh6h", "author": "Farvaharr", "body": "Damn I sold ar the best point yesterday morning"}
{"id": "n6b1k6h", "author": "JuniorRepublic2438", "body": "This is where real reta I mean real men are made"}
{"id": "n6c8djn", "author": "Due-Inspection-5660", "body": "unemployment rate has risen to 4.2% from 4.1% the prior month, in line with expectations."}
{"id": "n6cnhww", "author": "ghost-age-1000", "body": "What the fuck . Free fall ?? Man its friday , let the market rest."}
{"id": "n6cphyw", "author": "ithastogoupfromhere", "body": "my 8% stop losses saved me, now enough cash to bet on tanking cryptos"}
{"id": "n6cq7oe", "author": "VaultBoy9", "body": "Bouncing back now?"}
{"id": "n6eo3wl", "author": "MichaelAischmann", "body": "We assign market movement to the continent that has open stock markets at the time despite the fact that crypto trades 24/7 & never closes. I would really love to see a 24h chart with trading volume for each of these geographic regions. Has anyone seen this somewhere?"}
{"id": "n6evu32", "author": "LinoStar69", "body": "that Bart pattern is legendary"}
{"id": "n6ezdbg", "author": "_Commando_", "body": "Tariff Taco deals for everyone."}
{"id": "n6f0f14", "author": "decomposition_", "body": "So a bunch of longs just got liquidated right? I saw a heavy concentration at $113250 and it dipped below that"}
{"id": "n6ekojj", "author": "KristianME", "body": "Don’t worry—soon the U.S. won’t be a global economic superpower anymore. Trump is making sure of that. \n\nThen maybe we can finally have markets that aren’t held hostage by whether Americans vote for reality TV stars or not."}
{"id": "n69y0cm", "author": "MichaelAischmann", "body": "Haven't you heard? Tariffs change the ~~borderless nature~~, ~~protocol~~, ~~fees~~, ~~transaction speed~~ & ~~decentralization~~ of crypto. It's only logical that we're dumping."}
{"id": "n6batwp", "author": "Rock_Hardy112", "body": "Deploying funds, wish me luck 🙏"}
{"id": "n6engn8", "author": "bizaroo933", "body": "Burgers selling like their life depends on it just before their market closes 🤣"}
{"id": "n6f1kgb", "author": "crazy_lolipopp", "body": "This isn't even that bad guys. We're not crashing. We topped at 123k and we're still at 113k. It's nothing. If we dip  below 100k we should be worried."}
{"id": "n6fdhuj", "author": "panthera_N", "body": "not happy \n\nhttps://i.redd.it/ca9pvx5bchgf1.gif"}
{"id": "n6fkzc5", "author": "Fhaticito", "body": " manipulated as fuck industry."}
{"id": "n69sp5x", "author": "SevereArrivals13", "body": "10,000 more MOONs bought and burned 8 hours ago by advertisers 🔥\n\nIts a daily thing at this point, and the sell walls are literally non-existent"}
{"id": "n69wsbl", "author": "VV88VDH", "body": "This dump just doesn’t make sense. It’ll definitely pump to the recent highs again soon."}
{"id": "n6c209e", "author": "Old_Rafa", "body": "Altcoin season't"}
{"id": "n6e81vd", "author": "brkinard", "body": "XRP sneeze and BTC bleeds....alt season imminent."}
{"id": "n6embau", "author": "SkoMyGod", "body": "Close the US markets so we can go back up"}
{"id": "n6g03in", "author": "brkinard", "body": "No bear market possible until ETH reaches ATH. Just a fact."}
{"id": "n69pgk4", "author": "shortsermons", "body": "Don’t be a panican"}
{"id": "n6ei50i", "author": "Due-Inspection-5660", "body": "We should get a decent relief rally once the US market closes soon."}
{"id": "n6bgfsk", "author": "Creative-Frosting189", "body": "Crypto President my ass!"}
{"id": "n6fjd5k", "author": "OverallHearing5", "body": "Please thank your crypto president please"}
{"id": "n69g2v9", "author": "jwz9904", "body": "It’s aug! Can we get a green daily pls"}
{"id": "n6bporr", "author": "Due-Inspection-5660", "body": "In case you didnt notice, trump actually delayed tariffs again - now the new rates are coming into effect on 7 august, not 1 august.\n\nwouldnt be surprised if we get another TACO."}
{"id": "n6c163m", "author": "Preme2", "body": "Damn, the price going down is bad enough but now we have every crypto moonboy crying in the chat over their $200 shitcoin portfolio. It’s only been one real sell-off day and you’re telling me we have two more months of this? NGMI. Mommy’s titty milk has run dry."}
{"id": "n6c6wab", "author": "ieatvegans", "body": "Yet another positive inflow day for ETH ETFs. That's 20 days in a row."}
{"id": "n6ccjxu", "author": "Due-Inspection-5660", "body": "CME fedwatch is now predicting a 67% chance of a rate cut in september, up from just 40% prior to the release of this morning's job report."}
{"id": "n6cdfgl", "author": "Due-Inspection-5660", "body": "CNBC article:\n\n\"This is a gamechanger jobs report,\" said Heather Long, chief economist at Navy Federal Credit Union. \"The labor market is deteriorating quickly.\"\n\nThe weak jobs report, including the dramatic revisions, could provide incentive for the Federal Reserve to lower interest rates when it next meets in September. Following the report, futures traders raised the odds of a cut at the meeting to 63%, up from 40% on Thursday."}
{"id": "n6cgeqc", "author": "iconhornz", "body": "I feel like if (when) the tariffs get reduced/cancelled it'll be a quick bounce back"}
{"id": "n6crk27", "author": "Due-Inspection-5660", "body": "We seem to be bouncing, it should continue as more ppl who sold in anticipation of a huge dump at US market open FOMO back in."}
{"id": "n6egcpu", "author": "LinoStar69", "body": "Shouldn't we be tired of winning right now?"}
{"id": "n6el9hg", "author": "b1mm3rl1f3", "body": "The whales are loading up on ETH and $4k is such a weak resistance at this point. Patience 😉"}
{"id": "n6enzln", "author": "ThatChrisGuy7", "body": "What can go wrong using crypto as collateral on a house loan and then your collateral drops 20% lol"}
{"id": "n6eot7i", "author": "devCheckingIn", "body": "DXY dumping again on more news:\n\nFed governor Adriana Kugler, whose term was set to end in January, has resigned effective August 8.  So Trump will have a new appointment before the September FOMC meeting."}
{"id": "n6f05g3", "author": "JuniorRepublic2438", "body": "Inverse cc don’t forget"}
{"id": "n6becmw", "author": "Due-Inspection-5660", "body": "Honestly 90% of people in this sub deserve to lose money with their childish and emotional reactions.\n\nIf you own BTC or ETH this dip is absolutely nothing to worry about and we will be back setting new highs shortly.\n\nAlso, in the last 24 hours Microstrategy has announced it's raising another $4 billion to buy BTC, while Metaplanet is raising another $3bn.\n\nThat is $7bn of new BTC buying support which will be hitting the market relatively soon, on top of all the people who will FOMO back in and renewed ETF flows.\n\nAs for ethereum, corporate flows are still strong and the ETFs are still going to attract a lot of capital, especially once the SEC approves staking later this year (this announcement alone could make ETH spike well over $4,500). \n\nThis new tariff bs is nothing to worry about. Dont be an idiot and get shaken out like the ppl who panic sold at the bottom in March and April (back then I said BTC would set new highs within a few months, and it did exactly that.)"}
{"id": "n6bngqz", "author": "MichaelAischmann", "body": "Haters have taken charge of the daily. 😔"}
{"id": "n6fntyq", "author": "ozera202", "body": "I think I preferred Biden now and it’s just not for crypto but just for the fact that Biden just kept his mouth shut and didn’t stir the dam market up all the time . There is so much uncertainty coz Trump is always wishy washy with whatever he is saying then changing , backing down ."}
{"id": "n69o3dw", "author": "verysillyman", "body": "Woooooow eternal dump man"}
{"id": "n6axyyi", "author": "AgitatedDragonfly769", "body": "Are we dipping because of orange Bozo and his tariffs?"}
{"id": "n6c3ecw", "author": "Due-Inspection-5660", "body": "Breaking: The UK has lifted the ban on retail traders buying spot crypto ETFs."}
{"id": "n6c3fwm", "author": "Due-Inspection-5660", "body": "look at ETH climbing back up."}
{"id": "n6c83dz", "author": "whataboutbenson", "body": "Just looking at the tarriff list. The guy is a madman. We are truly living in the upside down world. America has a lot to answer for."}
{"id": "n6cf4li", "author": "_TheWolfOfWalmart_", "body": "Capo just said it's time to be bearish.\n\nOpen your longs, gentlemen!"}
{"id": "n6fmu8v", "author": "crazy_lolipopp", "body": "All the gains gone just like that. Every time. Like clockwork. Alt season my ass."}
{"id": "n6fv667", "author": "Mysterious_Ad_4658", "body": "Bear market posts are like clockwork, your either bipolar, a child or over-invested. Until its confirmed on the technicals its not the official end of cycle bear market, simple as."}
{"id": "n6cf36s", "author": "whataboutbenson", "body": "It's always darkest before the dawn guys. BTC ETH and LINK charts all still look bullish to me."}
{"id": "n6d4bvb", "author": "Steadbrisk", "body": "Of course, of course it needs to pump and dump"}
{"id": "n6enqw3", "author": "SevereArrivals13", "body": "MOONs in the green today, they don't care about the dip and are ready for the next step up\n\nAdvertiser burns keep flowing in the meantime"}
{"id": "n6ft19a", "author": "buttcoin_lol", "body": "what can I buy that goes up when stocks and crypto go down? How can I diversify? Buy bonds?"}
{"id": "n6ejuh2", "author": "Maleficent_Sound_919", "body": "How can this clown still have such an effect on the market its beyond me..."}
{"id": "n69ol4t", "author": "ieatvegans", "body": "Oh shit, LOL."}
{"id": "n6b85dz", "author": "lurkinns", "body": "Went down quite quickly. If reasonable deals are made and markets can get a little bit of relief then crypto will pop like 10% at least. Let the market cool off a little bit before entering a trade lads."}
{"id": "n6dua1g", "author": "verysillyman", "body": "Noting but good news for crypto, nothing but down. Sounds about right!"}
{"id": "n6e5h16", "author": "NervousClick7033", "body": "😅😅 weekend is gonna be rough I guess"}
{"id": "n6ei108", "author": "Fumbles1231", "body": "Moons just chilling in this sea of red"}
{"id": "n6bksf3", "author": "cascading_disruption", "body": "199k by EOY, nothing changed. You're not bullish enough. Get your short-term emotions in check."}
{"id": "n6e7ny3", "author": "bizaroo933", "body": "Americans destroyed the bull market with their selling for every 1% profit mentallity"}
{"id": "n6ebuib", "author": "VV88VDH", "body": "Alts sneeze btc bleeds"}
{"id": "n6fqg9p", "author": "fan_of_hakiksexydays", "body": "We are only just back to the same prices we were 3 weeks ago.\n\nAnd 3 weeks ago, everyone was super stoked about the price going up to $112K, and breaking past $109K resistance. \n\nBut suddenly, $112k now means \"bullrun has just ended\", \"we are in a long bear winter now\", \"4 digit prices soon\", \"cut your losses now\", \"this is over\", etc..."}
{"id": "n69lpps", "author": "MichaelAischmann", "body": "People shouldn't fear Strategy's coins any more than they fear Satoshi's coins."}
{"id": "n6cgi4k", "author": "aaj094", "body": "UK seeing the light\n\nhttps://www.fca.org.uk/news/press-releases/fca-opens-retail-access-crypto-etns\n\n8th Oct is Day 1."}
{"id": "n6cq86a", "author": "KalEl729", "body": "So i guess tariffs are a bigger market mover than your measly job reports"}
{"id": "n6dn872", "author": "devCheckingIn", "body": "Phew... COIN getting destroyed today."}
{"id": "n6e32h7", "author": "verysillyman", "body": "This is the part of the bull market where if you even touch a long position it’s instantly under."}
{"id": "n6e68xj", "author": "inadyttap", "body": "Who bought the dip?\n\n![gif](giphy|l4Ep0yZkoXrlD1vqM)"}
{"id": "n6edpxn", "author": "delastunicorn", "body": "Never thought I would be seeing 113k again but here I am."}
{"id": "n6ejoxq", "author": "BrowsingCoins", "body": "That jobs report looks pretty bad"}
{"id": "n6f4pyc", "author": "SkoMyGod", "body": "We will rebuild <meme of plastics chair falling over>"}
{"id": "n6bel1m", "author": "cmxhere", "body": "Man, these days people panick so fast"}
{"id": "n6bfh9i", "author": "Sebanimation", "body": "Dropping hard and no bounce yet? Ugh…"}
{"id": "n6bpmk7", "author": "nomoney110", "body": "Just open the daily chart and see what happened after each bigger dip. Hopefully we can liquidate some shorts today."}
{"id": "n6fjfcd", "author": "LinoStar69", "body": "doesnt want to stop dipping"}
{"id": "n6e6q2q", "author": null, "body": "[removed]"}
{"id": "n6adrs0", "author": "ozera202", "body": "imagen buying the dip all the way into a bear market , i did that last cycle aint doing that this cycle. The risk to reward has diminished where your taking more risk with these prices"}
{"id": "n6a628w", "author": "Mysterious_Ad_4658", "body": "600 million liquidated before the bounce at 114.3k, ouch"}
{"id": "n6aekoa", "author": "jwz9904", "body": "bearish youtubers out in droves!"}
{"id": "n6arxdh", "author": "jwz9904", "body": "Sui wheeeeee"}
{"id": "n6b5s9b", "author": "ABrad11", "body": "I’m just hear for the tears whilst I continue to dca."}
{"id": "n6b89ps", "author": "Creative-Frosting189", "body": "Are we not expecting a full blood bath at market open?"}
{"id": "n6bcyc8", "author": "Imaginary-Seaweed-29", "body": "whats the reason for the doom and glooming? canada tarrifs? i thought there's diminishing market impact from that shit at this point"}
{"id": "n6bj3g8", "author": "bizaroo933", "body": "4 hours and 9 min before the end of the bullrun will begin. Burgers are going to destroy the bullmarket today, just watch"}
{"id": "n6cpyde", "author": "nomoney110", "body": "im bullish. thats nice and healthy."}
{"id": "n6ctgv2", "author": "SkoMyGod", "body": "Bounce, bounce, I said come on and bounce"}
{"id": "n6e7ub3", "author": "TexasBoyz-713", "body": "Fuck it just bought more Bitcoin"}
{"id": "n6ezagl", "author": "verysillyman", "body": "This is a painful bull market, ouch"}
{"id": "n6ay2mf", "author": "spacedout1997", "body": "As I said the moment we lost momentum there is no move up. Its all hype driven. We tried in May tried in July nothing gg"}
{"id": "n6dgypi", "author": "KalEl729", "body": "Youve to be nuts to think trump is good for crypto or for making money in general"}
{"id": "n6bs9vf", "author": "lurkinns", "body": "Be patient. Wait until US opens before considering buying anything. It might drop even further."}
{"id": "n6bswnj", "author": "noviwu97", "body": "Everyone here predicting massive dump on US open... you guys know what to do"}
{"id": "n6btmes", "author": "Due-Inspection-5660", "body": "very important US labour market data is coming out in 1.5 hours"}
{"id": "n6fm9d5", "author": "Simke11", "body": "I don't get people who are panic selling now, be it crypto or stocks, have they learned nothing from April?"}
{"id": "n6frmmd", "author": "wvutrip", "body": "Man that alt season was great. Almost no alts made it to their previous aths. One day you’ll learn"}
{"id": "n6baprx", "author": "bizaroo933", "body": "And this is nothing just wait till burgers wake up again. They are going to sell this shit to 110k. The top was 123k we wont get more then that, never since USA is that much involved in crypto. They are selling everything now"}
{"id": "n69mb5z", "author": "emyfsh201", "body": "Are we gonna see a red August?"}
{"id": "n69vlyy", "author": "VariatCA", "body": "Damn I just noticed my limit-buy order missed for BTC by only $36.20 lol. I'm hoping it won't return to that level, but if it does I'll take a nice 4% dip purchase.\n\nIf only I were just obsessively staring at charts rather than making dinner I could've capitalized on it!"}
{"id": "n6cavw7", "author": "bimbobandit2016", "body": "Uh oh... High activity noted in the fast food restaurants near the Pension. Perfect storm of shit"}
{"id": "n6cnvls", "author": "flyingstalli0n", "body": "Man I wish I had more cash to buy this dip."}
{"id": "n6co78k", "author": "jfree6", "body": "Its going downhill."}
{"id": "n6co7zh", "author": null, "body": "[deleted]"}
{"id": "n6cxbo3", "author": "flyingstalli0n", "body": "Had to take out a loan to buy this dip 😞"}
{"id": "n6dukr7", "author": "abigguynamedsugar", "body": "Guys with previous bull run experience - these corrections can be fully normal before a true alt season/euphoric run right? Or is it just straight straight up?"}
{"id": "n6fclda", "author": "TheGreatCryptopo", "body": "From my whackoff chart I vehemently study while in the shower if we go below 110k there will be a massive jerk back up to 120k and beyond. This is why a shower once a day is good for you boys and girls.\n\n![gif](giphy|l1Ku82yEBz3hu6Lio)"}
{"id": "n6fnhjk", "author": "Rock_Hardy112", "body": "Running out of funds, still catching those knives!"}
{"id": "n6fq3x7", "author": "FlanBackground4478", "body": "And now what omg , 6 months we were waiting for only 1 week the prices go up? And now what 1 week 50% of gains are gone"}
{"id": "n69gqqs", "author": "Pat_McCrotch", "body": "113 - 113.5k FULL PORT LONG. THANK ME LATER. OR NOT I DONT REALLY CARE. JUST GET RICH"}
{"id": "n69ob63", "author": "panthera_N", "body": "\"easily 100x next week, it's huge, if you haven't bought the memecoin yet that I shill then I don't know what to say\", that's what the Influencers on X said, I don't know either"}
{"id": "n6aueip", "author": "Suspicious-Holiday42", "body": "It feels like december 2021. no one of us is going to get out unharmed of this if we stay in the market"}
{"id": "n6b3uiv", "author": "Amazing_Demand6241", "body": "If u think it’s a dip look at the yearly chart"}
{"id": "n6bcrwj", "author": "LtViperNL", "body": "Wow, here come the bears and told you so’ers. Just what I need………."}
{"id": "n6boje7", "author": "jfree6", "body": "Welcome to August-September classic dip."}
{"id": "n6c0b07", "author": "Suspicious-Holiday42", "body": "So tired of winning"}
{"id": "n6d6fph", "author": "jwz9904", "body": "when prices dump bears come out in droves, self appointed experts come out to educate the masses. Rinse and repeat. we are very free!"}
{"id": "n6e3rep", "author": "bizaroo933", "body": "A great, Trump is threatening Russia, even more excuses to dump everything even more"}
{"id": "n6e6928", "author": null, "body": "[removed]"}
{"id": "n6ekr7l", "author": "Emperor-of-the-North", "body": "Cmon bears, you need to do better. I want to see at least 110K."}
{"id": "n6eqy2v", "author": "MikeysOnTheMoon", "body": "Payday boys. You know what you need to do"}
{"id": "n6fm0p5", "author": "Smiling_Jack_", "body": "Just like the carry-trade scare this time last year.\n\nLow-volume August doing what it can to keep folks engaged."}
{"id": "n6foaad", "author": "ieatvegans", "body": "Last chance to buy ETH under ~~4000 3900 3800~~ ~~3700 3600~~ 3500"}
{"id": "n6btxnd", "author": "LinoStar69", "body": "It’s over. Thank you for your attention to this matter!"}
{"id": "n6bcpc7", "author": "Medium_Change4574", "body": "Amazing how a single comment in the daily about a coworker asking about crypto was the exact local top 😂"}
{"id": "n6c9sjt", "author": "devCheckingIn", "body": "The downward payroll revisions for May and June are disastrous.\n\nNo wonder Powell changed his narrative from \"the labor market is solid\" to \"the demand for labor is down, but it's okay because labor supply has come down also so they're in balance\".  The FOMC is totally clueless.  They will be \"too late\" yet again!\n\nDXY dropped over 1% in 10 minutes just on the jobs report."}
{"id": "n6cvggm", "author": "VariatCA", "body": "I lamented yesterday that I missed one of my limit-buy orders at 114,100 by only about $36.20 before it shot back up. This morning it looks like I got a successful round-2 and got to buy a nice chunk of BTC at that mark!\n\nI've got a couple other heftier limit-buys down lower at ~112.1k and ~110.2k, both of which probably have zero shot at filling anytime soon, but its always nice having some spare capital ready to deploy. I'm not terribly interested in messing with long/short leverage gambles, you can make plenty of money in BTC with just patience and tenacity."}
{"id": "n6dunuz", "author": "Due-Inspection-5660", "body": "now trump's bullshit about nuking russia.... fuck sake"}
{"id": "n6cjqgi", "author": "Everest2017", "body": "USD again falling like a stone against EUR. World's reserve currency lol"}
{"id": "n6atk50", "author": "veegaz", "body": "Are we entering alt bear season? All mini pumps are being completely annihilated 💀💀💀"}
{"id": "n6cd9l3", "author": "Konspiratsioon", "body": "Has any one of you even said thank you?"}
{"id": "n6e7mnz", "author": null, "body": "[removed]"}
{"id": "n69ua6h", "author": "delastunicorn", "body": "Are you winning, son?"}
{"id": "n6b1v1u", "author": "kironet996", "body": "BTC ETFs seeing red for the first time in many days/weeks. We might be finally seeing a start of an actual correction. Prepare your wallets everybody."}
{"id": "n6da3ft", "author": "OnlineRobot", "body": "Is this tumble gona snowball??"}
{"id": "n6e1i8v", "author": "kironet996", "body": "prepare for a nosedive with this US/RUS beef 🥩"}
{"id": "n6e7b4q", "author": "Next_Statement6145", "body": "it’s so over vs it’s so back. pick a side"}
{"id": "n6fq1u8", "author": "k3surfacer", "body": "so who launches first? Will it be small? Where should I go?"}
{"id": "n6bfufl", "author": "TheGreatCryptopo", "body": "The shorters are walking around with erections. Not cool."}
{"id": "n6emivt", "author": "Suspicious-Holiday42", "body": "Just sold my ethereum, too risky now"}
{"id": "n69rq3u", "author": "Soi_Boi_13", "body": "Is it over?"}
{"id": "n6a4i9g", "author": "Rare-Magician-5521", "body": "theres not alot of data points, but btc was always green on august post halving years. lets hope thats enough hopium"}
{"id": "n6agxo5", "author": "kers2000", "body": "Waiting for a 50% discount on my alts to buy in again."}
{"id": "n6bhsrd", "author": "davink91", "body": "If we lose 114k about to open a 20x short. Cause apparently shorting the hell out of everything is the only way to make money this cycle."}
{"id": "n6d0dlj", "author": "Due-Inspection-5660", "body": "Bizaroo, i am still waiting for the \"burgers to sell like animals today\" and take us to $110k lol\n\n[https://www.reddit.com/r/CryptoCurrency/comments/1mehny8/comment/n6ck57h/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/CryptoCurrency/comments/1mehny8/comment/n6ck57h/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)"}
{"id": "n6e81yn", "author": "Emperor-of-the-North", "body": "Is that all bears can do? 3% dip? These bears are so fcking weak."}
{"id": "n6fkq00", "author": "LtViperNL", "body": "Altseason right?"}
{"id": "n69vtdd", "author": "Existing_Web_1300", "body": "Sorry guys I bought this morning"}
{"id": "n6ag6oe", "author": "Preme2", "body": "No more Taco Tuesday I see."}
{"id": "n6be62p", "author": "Apprehensive_Fee3821", "body": "Healthy correction Lmao"}
{"id": "n6bn1ht", "author": "JannisT", "body": "Rule 1 for new crypto people: Dumps are a great opportunity to buy at a lower price 🤓"}
{"id": "n6cm3z9", "author": null, "body": "[deleted]"}
{"id": "n6eiyme", "author": "Farvaharr", "body": "Alts actually holding up"}
{"id": "n6fsogj", "author": "jwz9904", "body": "Last chance to buy eth under 3.5. Board the train"}
{"id": "n69mmbk", "author": "ThatChrisGuy7", "body": "XRP short I put back in around 3.20 is healthy"}
{"id": "n69vh1b", "author": "Duzand", "body": "everyone overreacting to trump's new tariffs.  it\n'll blow over within 24hrs and shit will be green again."}
{"id": "n6b0toj", "author": "Creative-Frosting189", "body": "Every time I try to swing trade Fartcoin without fail it dumps. This is really what I get for trying my hand at trading"}
{"id": "n6b3pc6", "author": "DryMyBottom", "body": "DCA day today, can’t complain!"}
{"id": "n6b4vl7", "author": "Davek56", "body": "Oh yeah, crash to hell baby, this is my time to take advantage of all the dips that I never took note of."}
{"id": "n6bdbmh", "author": "Despaciito", "body": "Not looking at charts today. Time to touch some grass"}
{"id": "n6bqr97", "author": "ThinCrusts", "body": "Someone sell so we reverse already"}
{"id": "n6cans5", "author": "KalEl729", "body": "So we going up or down?"}
{"id": "n6cf5jo", "author": "abigguynamedsugar", "body": "We are so back!"}
{"id": "n6cmlvk", "author": "SkoMyGod", "body": "Keep buyin the dip but it keeps dippin"}
{"id": "n6cr6jr", "author": "ICE-FlGHT", "body": "Bitcoin gets a lil cut and alts go to war..\nUnreal"}
{"id": "n6ea8dv", "author": "Typical-Street-6496", "body": "I'm about to sell my kidney to buy more Btc"}
{"id": "n6ekavn", "author": "BrowsingCoins", "body": "This is because I bought yesterday, sorry folks"}
{"id": "n6fhzjo", "author": "Pan_opticom", "body": "Btc dominance climbing over 62% again \n\n[https://de.tradingview.com/symbols/BTC.D/](https://de.tradingview.com/symbols/BTC.D/)\n\nReminder that the last alt season began in March 21 and we are already in August 25 with no alt season in sight"}
{"id": "n6fqjzx", "author": "LinoStar69", "body": "remember, when you see the word \\*Altseason\\* more than 5 times a day, it's time to sell"}
{"id": "n6frado", "author": "VaultBoy9", "body": "The bull ran so hard it nosedived off a cliff."}
{"id": "n6fs9on", "author": "GrapefruitOwn6261", "body": "So March 24, dec 24 and July 25 was the time to sell alts then?"}
{"id": "n6bnyfh", "author": null, "body": "[deleted]"}
{"id": "n6abl4d", "author": "KalEl729", "body": "Are there any other big crypto events coming up?"}
{"id": "n6aurpp", "author": "JeopardyQBot", "body": "if we close a daily below 112 the best possible interpretation would be a weird summer fakeout fuckaround, and the worst interpretation should be obvious.. that should've been a clean impulsive break of previous all time high, going back down there look super ugly unless there's an immediate huge bid"}
{"id": "n6b52sy", "author": "_Commando_", "body": "https://www.instagram.com/p/DL2UvwGuBS6/"}
{"id": "n6b9sxu", "author": "Alternative_Square", "body": "Is it over again guys? I had a fun few weeks atleast"}
{"id": "n6c1kju", "author": "KalEl729", "body": "Hows the premarket looking like folks"}
{"id": "n6cb8ce", "author": "SkoMyGod", "body": "This shit is volatile"}
{"id": "n6cp0ar", "author": "Next_Statement6145", "body": "brace yourselves"}
{"id": "n6cpswb", "author": "dahomie2020", "body": "Oh they lied about the jobs number..."}
{"id": "n6e1o4x", "author": "Annual_Juggernaut_47", "body": "10 yr yields finally breaking to the downside. This will kick off next leg up. This correction will be temporary."}
{"id": "n6e7g6j", "author": "Dinnen22", "body": "It actually might buy over im buying more"}
{"id": "n6ej6rc", "author": "shanatard", "body": "The bears are getting uppity"}
{"id": "n6esssv", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-07-31 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|291|  \n|ETH|136|  \n|XRP|51|  \n|MOON|36|  \n|SOL|34|  \n|XMR|33|  \n|LTC|19|  \n|HOME|17|  \n|ZEC|17|  \n|SNT|16|  \n|IP|15|  \n|LINK|14|  \n|SAFE|13|  \n|USDT|13|  \n|REQ|12|  \n|ADA|10|  \n|MATIC|10|  \n|CORECHAIN|9|  \n|ME|9|  \n|ARB|8|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6foef3", "author": "allstater2007", "body": "Man we are really doing it huh?"}
{"id": "n6fwtys", "author": "Colours-Numbers", "body": "finally - LTC not shedding gains!!"}
{"id": "n6ahvpp", "author": "Zyzz2179", "body": "Bear market started"}
{"id": "n6b6knz", "author": "tehrcrd", "body": "I’m back boys, after years of silence. \nWith current prices gotta earn some extra moons to compensate."}
{"id": "n6bsz3q", "author": "Intelligent-Ad8242", "body": "Burger donations open soon"}
{"id": "n6bdjcd", "author": "Dickerbear", "body": "Bull run btw 🤣"}
{"id": "n6bjgt4", "author": "Next_Statement6145", "body": "time to buy, no time to panik"}
{"id": "n6ciuvr", "author": "jwz9904", "body": "Hello bear"}
{"id": "n6cn915", "author": "Intelligent-Ad8242", "body": "Boorgers. Are you satisfied enough ?"}
{"id": "n6d0wdx", "author": "Extreme_Nectarine_29", "body": "Considering the bloodbath on alts MOONS are doing just fine.\n\nIt could be a lot worse."}
{"id": "n6ej0s7", "author": "Maleficent_Sound_919", "body": "92k here we come I guess"}
{"id": "n6ek0f2", "author": null, "body": "[removed]"}
{"id": "n6fks8m", "author": "jwz9904", "body": "Eth back to normal"}
{"id": "n6bvk3b", "author": "Suspicious-Holiday42", "body": "When burger market opens it will be so red"}
{"id": "n6eytoh", "author": "TomorrowFinancial468", "body": "47k Moons were bought by a new wallet last night, \n50k were bought by 3 seperate wallets today. \n\nThere's only 2 million left on Camelot and 500k on Sushiswap. \n\nWe've burned almost a million Moons so far this year and more is coming.\n\nWe've lined up big AMA's and had requests for listing submissions (one of them now fulfilled: Glue network), another might be on the way. \n\nYou really shouldn't be fading this. You've been given every opportunity."}
{"id": "n6bjsoq", "author": "piggleii", "body": "Do Trump haters love Jerome Powell refusing to cut rates to spite Trump more than pumping their bags?"}
{"id": "n6cjuey", "author": "ghost-age-1000", "body": "These fkin burgers always  ruin the mood."}
{"id": "n6egh0r", "author": "bimbobandit2016", "body": "Trump is right. Whoever is responsible for those fudged employment numbers should be sacked 100%. Billions of dollars were traded based on those numbers"}
{"id": "n69i9r0", "author": "jwz9904", "body": "Let’s see how low we get to"}
{"id": "n69pu8f", "author": "dimi727", "body": "1% wick on BTC out of nowhere. Totally healthy an normal market 😂🙈"}
{"id": "n6a6q28", "author": "decomposition_", "body": "Flash crashes just mean cheaper coins"}
{"id": "n6b336t", "author": "Cricketdogeorgy", "body": "Last chance to sell over 110k"}
{"id": "n6b3ajm", "author": "gowithflow192", "body": "Cycle top was that it?"}
{"id": "n6b87b8", "author": "ThinCrusts", "body": "We expecting to dump more when donuts wake up?"}
{"id": "n6cnvti", "author": "kironet996", "body": "so many mentions of burgers here make me hungry..."}
{"id": "n6ddtl3", "author": "Due-Inspection-5660", "body": "if we can get above $3750 today I will be happy."}
{"id": "n6ela33", "author": "OkCelebration6408", "body": "Almost the best set up crypto could ask for to have a huge alt seaon. Fed rate cut will certainly be bigger than thought, it was 50 basis point earlier and now they are expecting 100 basis point for the year,  commodity prices today actually are falling despite new tariffs announcement. Weak jobs will certainly not be limited to US as this likely happening globally, the drop in demand across the world will put a limit of how much prices can go up, inflation will be much lower than 2022-2024. A perfect set up for huge risk on sentiment. The favorable regulatory environment also helps as well, really everything is coming together for a huge alt season this year."}
{"id": "n6entb9", "author": null, "body": "Make sure we pump it when burger market closes so they have to buy in higher tomorrow"}
{"id": "n6ex1lu", "author": "that_ol_bs", "body": "When it’s all said and done, hot air will rise. Deploying more capital into fartcoin as we speak "}
{"id": "n6fhdzs", "author": "devCheckingIn", "body": "For those hoping that the Fed will cut rates in September because of the bad jobs data... don't forget they had that data in their hands before this week's meeting and still decided to sit on their hands.\n\nWell, other than two dissenters that went public this morning to get on the record that they voted for a cut because they think the labor market is weak."}
{"id": "n6fkcxn", "author": "ieatvegans", "body": "LOL, it just keeps bleeding."}
{"id": "n6cpe7m", "author": "jwz9904", "body": "110k incoming"}
{"id": "n6b8vgi", "author": "bizaroo933", "body": "First 123k was a big resistance, then 120k, then 118.7k and now its 115k🤡 Alts lost like 40% value in the last 2 weeks. But its a great bull market!"}
{"id": "n6c99yw", "author": "c05d", "body": "fire jpow NOW!"}
{"id": "n6cimqc", "author": "Suspicious-Holiday42", "body": "Time for the burger dump"}
{"id": "n6eqxer", "author": null, "body": "[removed]"}
{"id": "n69j1r5", "author": "DICKDORKDAVE", "body": "just get down to $82k already so we can all go home and come back in 4 years"}
{"id": "n6cann5", "author": "bizaroo933", "body": "I said it before I say it again. Today will be the day of the end of the bull market, when burger market opens. They will sell like made animals"}
{"id": "n6aagqf", "author": "KalEl729", "body": "So i guess we wait till market open today to buy in?"}
{"id": "n6aezbu", "author": "JeopardyQBot", "body": "anyone have a read on this new strategy atm guidance? doesn't it just basically mean they'll be buying less btc?"}
{"id": "n6bbjrm", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-07-31 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|291|  \n|ETH|136|  \n|XRP|51|  \n|MOON|36|  \n|SOL|34|  \n|XMR|33|  \n|LTC|19|  \n|HOME|17|  \n|ZEC|17|  \n|SNT|16|  \n|IP|15|  \n|LINK|14|  \n|SAFE|13|  \n|USDT|13|  \n|REQ|12|  \n|ADA|10|  \n|MATIC|10|  \n|CORECHAIN|9|  \n|ME|9|  \n|ARB|8|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6bbz9j", "author": "KalEl729", "body": "Xrp not touching 3 in the near future."}
{"id": "n6c89qk", "author": "KalEl729", "body": "Lol we going up"}
{"id": "n6ccn2d", "author": "f00dl3", "body": "Tempting to double my short position to 20k."}
{"id": "n6d0o59", "author": "Next_Statement6145", "body": "we’re so back"}
{"id": "n6ekdbp", "author": "vb90", "body": "108K is the floor. Calm the fuck down."}
{"id": "n6fog4b", "author": "TomorrowFinancial468", "body": "Moons be like, what dip bro"}
{"id": "n6aox6m", "author": "Yungmoolah42069", "body": "What do you guys think of NEAR, RENDER, AVAX, IMX, INJ?"}
{"id": "n6bbk07", "author": "cryptojimmy8", "body": "Uptrend for eth and btc clearly broken, alts plunging. Finally back to normal"}
{"id": "n6bcoqb", "author": "LinoStar69", "body": "Last chance to buy above 100k !"}
{"id": "n6beesp", "author": "ImaginaryDust", "body": "So it’ll be 10 years before alt bull run"}
{"id": "n6bwqmn", "author": "xanokothe", "body": "If we are dumping, do we dump more after US market opens?"}
{"id": "n6ejdpj", "author": "Cricketdogeorgy", "body": "Bleed isn’t gonna stop"}
{"id": "n6fmb28", "author": "panthera_N", "body": "you know what, the amount of money lost in a 1 day -1.7% decline in stock price will be equivalent to the market cap of BTC, hold on to your BTC, 100k is cheap \n\nhttps://i.redd.it/xbjf0mk3lhgf1.gif"}
{"id": "n69hxms", "author": "SoggyKnotts", "body": "I sold my house to buy more MOON!"}
{"id": "n6a16cq", "author": "veegaz", "body": "It's so damn over 💀💀💀\n\nChopsticks are exhausted too now. Buying to just see burgers dump"}
{"id": "n6brq9c", "author": "vb90", "body": "The levels are: BTC - 108K, ETH - 3380-3385.\n\nThat's what we need to touch. Obviously everything else will dump 5 times that but we already know that."}
{"id": "n6fnxbt", "author": "bizaroo933", "body": "I said it today in the morning. Today is the day burgers are going to destroy the bullrun. Sadly it really happened"}
{"id": "n6f2j7s", "author": null, "body": "Moron market closes and we recover. Make the burgers buy back higher"}
{"id": "n6bgpta", "author": "JohnnyBond1", "body": "OOOO MYYYYY GAWWWWD!!! BITCOIN JUST WENT UP 300 IN THE PAST HALF HOUR\n\nV SHAPRE RECOVERY BULL BACK ON\n\nBULL BULL BULLLLLLLLLLLL"}
{"id": "n6biuyw", "author": null, "body": "[deleted]"}
{"id": "n6g1yzq", "author": "jwz9904", "body": "August has been usually a red month."}
{"id": "n6bnlp5", "author": "bizaroo933", "body": "Guys just your opinion. Is what Powell is doing now not personal because of his hate to Trump? Remember election times when he did 2x a rate cut despite much bigger inflation?\n\nPowell is the typical husband/father when he sits at the table for dinner with his wife and children that he tells them how evil and dangerous a man like Trump is and that he will do everything to stop him."}
{"id": "n6ak3kj", "author": "Suspicious-Holiday42", "body": "Bull market is finally over"}
{"id": "n6ck57h", "author": "bizaroo933", "body": "Haha I said it, but some dreaming moonboys dont like my posts. Today burgers will sell like animals"}
{"id": "n6dcoy0", "author": null, "body": "[removed]"}
{"id": "n69l3mb", "author": "KalEl729", "body": "Dont think 115k is gonna hold"}
{"id": "n69pruv", "author": "TheGreatCryptopo", "body": "Swapping BTC for ETH going on?"}
{"id": "n6bhpww", "author": "Extreme_Nectarine_29", "body": "As MOONS holder I feel fine...\n\nAs a past POLKADOT holder...under 3.8$ is just insulting"}
{"id": "n6bzc2r", "author": "pref1Xed", "body": "Can burgers surprise us today and pump instead of dumping? Please?"}
{"id": "n6c5fpu", "author": "KalEl729", "body": "Bull trap? Dead cat bounce?"}
{"id": "n6f9c8g", "author": "evanjmf", "body": "LINK holding up strong 💪💪💪"}
{"id": "n6baq4f", "author": "bimbobandit2016", "body": "Below 113k and I think it's over for Bitcoin at the very least. Hopefully the Bitcoiners who sold dabble in alts before taking their ball home"}
{"id": "n6flkr0", "author": "that_ol_bs", "body": "I hope y’all sold. If not, you still have time. This bear market is just getting started🐻🐻🐻🐻"}
{"id": "n6bvin2", "author": "Due-Inspection-5660", "body": "Is anyone else feeling giga bullish? or just me?"}
{"id": "n6eqesj", "author": "ICE-FlGHT", "body": "Oh.. oh wow…\n\n99k buy order is ready"}
{"id": "n6fxkht", "author": "Illustrious-Boss9356", "body": "If you aren't selling all your alts (yes I'm looking at you ETH) and consolidating in BTC right now, you must have some huuuuuuuuuge balls."}
{"id": "n69h5em", "author": "Pat_McCrotch", "body": "IN THE MEANtime lets get a lil pump here for old times sake"}
{"id": "n6cq5eq", "author": "ioWxss6_bot", "body": "Most mentions on r/cc (2025-07-31 00:00:00):\n\n||Mentions|  \n|:-|:-|  \n|BTC|291|  \n|ETH|136|  \n|XRP|51|  \n|MOON|36|  \n|SOL|34|  \n|XMR|33|  \n|LTC|19|  \n|HOME|17|  \n|ZEC|17|  \n|SNT|16|  \n|IP|15|  \n|LINK|14|  \n|SAFE|13|  \n|USDT|13|  \n|REQ|12|  \n|ADA|10|  \n|MATIC|10|  \n|CORECHAIN|9|  \n|ME|9|  \n|ARB|8|  \n\n[Data source and app](https://www.redditcoins.app/)"}
{"id": "n6dqkad", "author": "delastunicorn", "body": "It’s the same script. But please zoom out.\n\nBreathe. If you worry, set stop loss. If you leverage, set stop loss."}
{"id": "n6bi7mi", "author": "ozera202", "body": "It’s going to get much worse when burgers wake up and weekend dump …. Much worse"}
{"id": "n6dk2fx", "author": "Suspicious-Holiday42", "body": "If you want to make money, keep everything in cash until 2028. Stocks and crypto are not good in the next 4 years with all this tariff pump and dumping"}
{"id": "n69hvuk", "author": "KalEl729", "body": "We hitting 110k tony"}
{"id": "n69ta2f", "author": "ICE-FlGHT", "body": "Ohhh…. Oh wow… 😮 \n\nSo its like that…"}
{"id": "n6bcn7f", "author": "_Commando_", "body": "What an ALT season in 2025!\n\nIt was as quick as last year 2024 Dec 2nd to 7th."}
{"id": "n6dulmh", "author": "Onelinersandblues", "body": "That moons squeeze, once it’s let loose it’s gonna fly"}
{"id": "n6f4y9i", "author": "sell_at_top_nov2025", "body": "3.5k oh noes. BIBA COME PICK ME UP I'M SCARED\n\n🚀🚀ULTRASOUND 🚀🚀"}
{"id": "n6fly37", "author": "jwz9904", "body": "113’s gonna fall too"}
{"id": "n6czgi4", "author": "c05d", "body": "Too late jpow at it again"}
{"id": "n6ch1in", "author": "KalEl729", "body": "Whats a bigger market mover, jobs report or tariiffs?"}
{"id": "n6clx0m", "author": "LinoStar69", "body": "Hop on the dump train ! Next stop 110k"}
{"id": "n6bnolo", "author": "Qowudyeibflsla", "body": "BTC sneeze. Alt bleed. Alt gains for the month gonna be gone soon"}
{"id": "n6cu3wj", "author": "GhostEntropy", "body": "There are actually ETH treasury companies. if there's a top signal, that is it."}
{"id": "n6b5nm2", "author": "ozera202", "body": "This a bear market down trend , retail doesn’t have money , any good news it causing a sell off , nothing is moving the market other than down . The top was when trump entered and the sell off began with a double top . Take your profits while you can or hold , a recession is coming and it’s going to be brutal as BTC never went through a recession , get ready for sub 1k btc"}
{"id": "n69lac5", "author": "HauntingAardvark521", "body": "74k and I’ll be back in"}
{"id": "n69or9a", "author": "HopiumTrump", "body": "Lmao told ya summer sucks!! Wish I took more profit up here but at least I no FOMO!!"}
{"id": "n6bkl1j", "author": null, "body": "[deleted]"}
{"id": "n6bkmrb", "author": "meeleen223", "body": "Moons: \"Call the ambulance, but not for me\""}
{"id": "n6cvodz", "author": "historicalprinter", "body": "We’re gonna enter memecoin season this Q4 and 99% of this sub doesn’t even know about base chain where all the action will happen. Do people here hate making money?"}
{"id": "n6fq4pt", "author": "ICE-FlGHT", "body": "Well see you at 99k, and 3k to do it all again."}
{"id": "n6bdlnu", "author": "c05d", "body": "OMG didn’t look at btc in the past 48 hours as I had something important going on.  WHAT DAAA Fuck!!! Jpow that CUNT"}
{"id": "n6b846m", "author": "Yungmoolah42069", "body": "What’re some altcoins you guys are heavily invested in, or are going to buy during this dip?"}
{"id": "n6bdwh6", "author": "KalEl729", "body": "Some guy here had opened an xrp short at 3.66. He must be printing rn"}
{"id": "n6bejj3", "author": "Medium_Change4574", "body": "I swapped my ETH to Bonk at $2500, now I have 0 BTC and 0 ETH. Am I cooked?"}
{"id": "n6cllqo", "author": "jwz9904", "body": "Alt season how?"}
{"id": "n6dwxjz", "author": "_TheWolfOfWalmart_", "body": "wen fartcoin ETF?"}
{"id": "n6e6ner", "author": "SkoMyGod", "body": "I'm straight up not having a good time"}
{"id": "n6fmcf0", "author": "Preme2", "body": "CB: Shitcoin #1 is down 5%\n\nCB: Shitcoin #2 is down 7%\n\nOne hour later..\n\nCB: Shitcoin #33 is down 14%."}
{"id": "n6fr2hj", "author": "jwz9904", "body": "I’m excited to watch YouTubers today, gonna be dramatic"}
{"id": "n6eqvj1", "author": "that_ol_bs", "body": "The jobs numbers were clearly rigged to make President Trump look bad"}
{"id": "n6bk8fn", "author": "piggleii", "body": "What happened to all the Werge, Rerge, Terge, Yerge, Perge, Serge, Derge, etc. updates that were supposed to follow the Merge for ETH?"}
{"id": "n6fr9zt", "author": "MotoMola", "body": "Ah yes, on August 1st, 2025 will forever be the realization that you weren't able to sell at the top 2 cycles in a row. See you all again in 4 years!"}
{"id": "n6autep", "author": "Pure_Concentrate8770", "body": "If you ain’t got no money (to buy dips) take your broke ass home"}
{"id": "n6b4jkk", "author": "KalEl729", "body": "Dangerously close to 110k"}
{"id": "n6cou4s", "author": "ozera202", "body": "Keep buying the dip and catch a falling knife… see where that gets you"}
{"id": "n6edcw7", "author": "yikaiy", "body": "HOLD THE LINE. Do NOT let these market manipulators scare you. It is of the utmost importance us redditors stay strong, together. If we fold now, we lose forever. Come on team Reddit, say it with me. HOLD THE LINE. I BELIEVE THAT WE WILL WIN. I BELIEVE THAT WE WILL WIN."}
{"id": "n6fkfgd", "author": "Frequent_Optimist", "body": "Amazing getting rid of the degens."}
{"id": "n6dt6e0", "author": "Soi_Boi_13", "body": "Is it over?  The one-two punch from Powell and Trump. 💀"}
{"id": "n69oyaj", "author": "HauntingAardvark521", "body": "Almost full ported into BONK earlier… thank god I waited and bought UVIX instead."}
{"id": "n6beq2t", "author": "wallyone123", "body": "We’re back baby"}
{"id": "n6fjx3u", "author": "Qowudyeibflsla", "body": "BTC sneeze. Alt bleed."}
{"id": "n69sman", "author": "Qowudyeibflsla", "body": "BTC sneeze alt bleed"}
{"id": "n6bfj07", "author": null, "body": "[deleted]"}
{"id": "n6ddhk0", "author": "wvutrip", "body": "Agreed, they revised down like 90%+ the previous 2 months. How were they that off?"}
{"id": "n6etqdq", "author": "HSuke", "body": "**Planet Money episode**:\n\n[Can ... we still trust the monthly jobs report?](https://www.npr.org/2025/03/07/1236538089/doge-gdp-bls-department-of-labor-jobs-report)\n\nThanks to DOGE, the BLS has lost employees, and so much of their data is now no longer accessible.\n\nTrump's Commerce Secretary Lutnick disbanded 2 committees that helped provide that data to the BLS."}
{"id": "n6csmfl", "author": "jwz9904", "body": "why?"}
{"id": "n6cypby", "author": "MichaelAischmann", "body": "Polymarket promptly reacted. Yesterday after FOMC the odds for a 25 bps decrease in September were 38%, Now they are at 73% and 6% for a 50 bps decrease."}
{"id": "n6crflx", "author": "Due-Inspection-5660", "body": "yeah lol. Bears are so dramatic it's hilarious to watch."}
{"id": "n6crdr4", "author": "Indigovyre", "body": "Based on history, this dump could last.. for 6 months - year\n\nYou don't know anything in the future, nobody does."}
{"id": "n6e8zs5", "author": "brkinard", "body": "Is he the same guy that was making up job numbers the past 2 months....off by over 100k."}
{"id": "n6ejjec", "author": "Maleficent_Sound_919", "body": "Wait what... he doesn't like the numbers and then fire someone\n\nIts not like the US is his company like wtf this this shit"}
{"id": "n6ezw57", "author": "HSuke", "body": "Remember when DOGE purged the committees that helped provide accurate key data to the BLS back in February?\n\nhttps://www.politico.com/news/2025/03/21/labor-commerce-department-economy-data-doge-00241559"}
{"id": "n6e9sdc", "author": "Medium_Change4574", "body": "He is a MORON and a TOTAL LOSER"}
{"id": "n6b8vhy", "author": "Simke11", "body": "Wihtout fail."}
{"id": "n6a3a16", "author": "OzGaymer", "body": "We need rocket fuel. Let the Shorters set the stage for us to break ATH. As always the more Shorters lose money the better the world will be."}
{"id": "n69zw6y", "author": "TexasBoyz-713", "body": "Most of the long leverage *”for now”*"}
{"id": "n6a4t46", "author": "Pat_McCrotch", "body": "where are you seeing this data?"}
{"id": "n6f0tva", "author": "_Commando_", "body": "Its hard to time the top but DCA out is the way to go."}
{"id": "n6a0gmc", "author": "VariatCA", "body": "It's one perk that ETH gets to benefit from. Not only are large amounts of ETH locked up in staking that can't be accessed to sell, but the more that gets locked up in treasuries/ETF's, that's just more off the market that can't be swing-traded on a whim. Especially during these aftermarket movements."}
{"id": "n69mjmx", "author": "MichaelAischmann", "body": "Let's hope August brings profits to take."}
{"id": "n69ow93", "author": "HopiumTrump", "body": "I think the top will be October or November this cycle"}
{"id": "n69reg6", "author": "Dzerikas", "body": "Where do you see that?"}
{"id": "n6epjz6", "author": "pikkuhillo", "body": "If I open 10x long the world probably ends"}
{"id": "n6ei6oh", "author": "Due-Inspection-5660", "body": "please do it, for our sake."}
{"id": "n6ejymh", "author": "BrowsingCoins", "body": "Thank you for your sacrifice 🙏"}
{"id": "n6cecid", "author": "VaultBoy9", "body": "I'm on it!"}
{"id": "n6cr34y", "author": "veegaz", "body": "All money from that SPY selling will flow into crypto, everytime. Rinse and repeat"}
{"id": "n6ctynv", "author": "bimbobandit2016", "body": "We've got the weekend to make up for that"}
{"id": "n6cr8ye", "author": "ICE-FlGHT", "body": "I actually agree and Im a doomer"}
{"id": "n6d7mjn", "author": "ElPeroTonteria", "body": "I’ve seen this movie a couple times, you didn’t stick around for the ending if you didn’t like it?"}
{"id": "n6djmsi", "author": "Suspicious-Holiday42", "body": "its spongebob, where plankton wants to get the burger recipe but in the end the burgers dump on him"}
{"id": "n6d5nil", "author": "ghost-age-1000", "body": "I think its the one where people die shitting red blood."}
{"id": "n6e58y3", "author": "Paddy_Powers", "body": "Exactly. Money/Crypto won't be worth shit when food is the most valuable asset"}
{"id": "n6el30l", "author": "HopiumTrump", "body": "That was the 2010s.  Nothing golden about the 2020s!! The 2020s is a very brown and rancid decade!! 💩 💩 💩"}
{"id": "n6a5247", "author": "jwz9904", "body": "yeah no sweat"}
{"id": "n6f4xxu", "author": "SkoMyGod", "body": "Use the app and buy one get one free"}
{"id": "n69x5ju", "author": "MichaelAischmann", "body": "Any rational human being will chose panic."}
{"id": "n6b41g1", "author": "Simke11", "body": "Every few days when there is a dip the same doom posters come out with copy / paste comments. You'd think they would have recognised the pattern of range trading by now."}
{"id": "n6b5kqt", "author": "pikkuhillo", "body": "Such fearful people will be shaken out by next larger sellout. I am placing my eth buy to 3200 and I wouldn't be surprised if BTC tanks below 100k for few hours causing this shakeout."}
{"id": "n6b9vc9", "author": "reversenotation", "body": "It's an echo chamber with most of the lines being constantly re-reused"}
{"id": "n6b31l4", "author": "spacedout1997", "body": "1%-2% dip? Are you a bot or what"}
{"id": "n6b852s", "author": "HopiumTrump", "body": "interest rates is a big part of why crypto isn’t too strong this cycle.  These rates are too high and it’s possible they may even need to be raised.  We really lucked out with The political changes and the ETF approval.  Bitcoin making it to 123k is insanely impressive for such high interest rates.  most of that institutional money went to Bitcoin!! recently it’s moved into Ether as well!"}
{"id": "n6b5vis", "author": "veegaz", "body": "Ikr, the fact that you can now pay with crypto via PayPal, a fucking extremely boomer app, is mind blowing per se but the market likes to be red 🤔"}
{"id": "n6b4wyj", "author": "Davek56", "body": "So, 2030?"}
{"id": "n6e8iyx", "author": "bizaroo933", "body": "My memecoins are also holding well pfiew"}
{"id": "n6ejkzf", "author": "Maleficent_Sound_919", "body": "Yeah... like we are done now"}
{"id": "n6e88f4", "author": null, "body": "I saw this XRP holding quite well surprisingly"}
{"id": "n6c9nfr", "author": "Due-Inspection-5660", "body": "cuzz of weak jobs report"}
{"id": "n6docb5", "author": "Winstead22", "body": "https://www.coinglass.com/pro/futures/LiquidationHeatMap"}
{"id": "n6dc8bh", "author": "Due-Inspection-5660", "body": "coinglass is a good tool for this"}
{"id": "n6fo4s1", "author": "Fhaticito", "body": "Over the last 3 weeks. Ether has crushed me.  Lesson learned with leverage. I shorted it at 3100 then it fucking goes to 3800, liquidated.   Then I open a long at 3600 and now I’m down again. I deserve it.  I’m an idiot and degen.  Just stick to spot trading. The big boys move the market to fuck us.   Notice how every coin has the same exact pattern/chart.  It doesn’t matter what you buy it’s all the same shit.  /rant"}
{"id": "n6fnwok", "author": null, "body": "Blame the yanks and their tangerine leader"}
{"id": "n6advv9", "author": "KalEl729", "body": "Earlier than that for sure"}
{"id": "n6an7qp", "author": "The_Nothing00", "body": "70k in mid August. 20k by Christmas."}
{"id": "n6aqybz", "author": "MarioWilson122", "body": "Yeah it would be nice to see that or higher on a Sunday of all days."}
{"id": "n6afzhg", "author": "Lagna85", "body": "Nah, we heading to 110k first"}
{"id": "n69seyl", "author": "kenzi28", "body": "Now that u mentioned, I could live with this dip.\nThanks buddy."}
{"id": "n6ao0om", "author": "The_Nothing00", "body": "70k mid august. Watch. Did you really think Cramer was gonna be right just this once?"}
{"id": "n69j1in", "author": "Ethwh4le", "body": "I remeber the 20-30% dips those had me shaking"}
{"id": "n69iwr9", "author": "Cptn_BenjaminWillard", "body": "I've only done 86%.  But I'm just a babe in swaddling cloth.  Barely a crypto teenager."}
{"id": "n69rb9g", "author": "Dzerikas", "body": "OMG GO GO GO"}
{"id": "n6ao7cm", "author": "The_Nothing00", "body": "I mean, if I sell right now, I'm still in the green. If I wait till it drops to 70k, however..."}
{"id": "n69lg43", "author": "HauntingAardvark521", "body": "Cherry picking the chart to fit your narrative is dangerous"}
{"id": "n6a9brg", "author": "Suspicious-Holiday42", "body": "„The rich have too much money these days“ well thats why they are called rich"}
{"id": "n69jixa", "author": "jwz9904", "body": "How do we get rich?"}
{"id": "n69u0u0", "author": "VariatCA", "body": "They already had an exemption carved out for chips / semiconductors"}
{"id": "n6e7m76", "author": "inadyttap", "body": "Simple, i like it!"}
{"id": "n6f9k35", "author": "evanjmf", "body": "buy LINK instead. Institutions incoming"}
{"id": "n6f3hyz", "author": "Dzerikas", "body": "What are the % for a rate cut in September?"}
{"id": "n6fw5br", "author": "VariatCA", "body": "We'll see what information trickles out through the weekend. I guarantee the stock market MM's are pressuring Trump for some sign of relief after the last two days.\n\nThe weekend will give the stock market plenty of time to assess the situation + any new positive outlook details, though it will probably remain choppy for Bitcoin & Friends."}
{"id": "n6fwc60", "author": "nomoney110", "body": "That's what I expect too, it would fit well in the daily chart."}
{"id": "n6fyiz0", "author": "Pure_Concentrate8770", "body": "Nah, I mean yeah some small bump sure but we’d get back on actual track by 10th august and hit close to 130 by month end"}
{"id": "n6eohi8", "author": null, "body": "It would show: burgers $420,003,737,369 sell orders \n\nRest of world green. Because USA poor and need to sell."}
{"id": "n6a7cyd", "author": "decomposition_", "body": "No, but it changes markets that correlate with crypto as people are switching their money between the two. Markets dip, crypto stays stable? Sell some crypto, and buy your discounted shares. Visa versa, or at least that’s what their perspective seems to be to me"}
{"id": "n6bb138", "author": "Simke11", "body": "Steady lads"}
{"id": "n6enjr3", "author": null, "body": "They broke af"}
{"id": "n6f4k0b", "author": "Paddy_Powers", "body": "We only passed $100k in Nov/Dec. I wouldn't be that worried tbh. Thats nothing when you zoom out."}
{"id": "n6fkhgm", "author": "robis87", "body": "you'll be worried alrite when it's in 4 digits again"}
{"id": "n6fbgf3", "author": "The_Nothing00", "body": "Bitcoin regularly sheds 80% of it's value. You're saying \"it's not so bad\" now. Will you hold all the way to 20k like a slow boiling frog? It may, in fact, be time to jump out of the pot while we still can."}
{"id": "n6fn3q1", "author": "lumpyshoulder762", "body": "No retail is panic selling! /s"}
{"id": "n6a6sqn", "author": "ElPeroTonteria", "body": "Go look up the DXY... I bought the dip, HBU?"}
{"id": "n69x5f0", "author": "VariatCA", "body": "Especially if Trump trickles more news of delays, postponements, deals and \"pauses on the new reciprocal values for 90 days\" the same exact way he did shortly after his Liberation Day as we get closer to August 7th when his new E.O. goes into effect."}
{"id": "n6emtxj", "author": "Antique-Athlete-8838", "body": "More like dumping without any rebound"}
{"id": "n6ejn3r", "author": null, "body": "[removed]"}
{"id": "n6eizbi", "author": "bizaroo933", "body": "Lol, werent you attacking me earlier today when I was blaming burgers for this disaster 🤣\n\nAnd btw I lost, but I guess 113k is fair play for my burger hate?"}
{"id": "n6ejd40", "author": "LinoStar69", "body": "Depends if TACO fucks us with more tarrifs/war"}
{"id": "n6bpfnw", "author": "Due-Inspection-5660", "body": "yes we're only like 80% up on BTC since he was elected and he has made good on his promises regarding regulation and legislation. what a terrible crypto president, right?!"}
{"id": "n69gq44", "author": "Lagna85", "body": "Sure, 1 week green followed by 3 months dump"}
{"id": "n69gdob", "author": "ieatvegans", "body": "I'm all out of green, but I have 4 lovely shades of red."}
{"id": "n6ejahl", "author": "Maleficent_Sound_919", "body": "Crazy how this fuck wit still has this much influence"}
{"id": "n6ehe6a", "author": "SkoMyGod", "body": "So much winning"}
{"id": "n6emfhh", "author": "flyingstalli0n", "body": "If Eth dips below 3k, I will be forced to take out a personal loan."}
{"id": "n6ew06g", "author": "jawni", "body": "same thing that happens when any other type of collateral loses too much value."}
{"id": "n6eo5e5", "author": "SkoMyGod", "body": "Underwrite my loan with Fartcoin"}
{"id": "n6ey8zq", "author": "Nequientt", "body": "There is 85% chance of rate cut in september"}
{"id": "n6epe4j", "author": "MichaelAischmann", "body": "At this point only tin foil hats believe the FED is independent."}
{"id": "n6bh2ph", "author": "KristianME", "body": "I \"panic sold\"in march and april, bought rklb, nbis, amd and asts for the crypto money.\nThose stocks did way better than crypto, sold almost everything at 160-220% profit, justgot some leftovers left in those stocks.\n\nReason im saying this is to correct the panic sell thing. People just see better places for their money to grow when stocks plunges aswell."}
{"id": "n6bfq0p", "author": null, "body": "[deleted]"}
{"id": "n6bp6d7", "author": "Due-Inspection-5660", "body": "bears are out in full force today"}
{"id": "n6bpewg", "author": "Simke11", "body": "Been like that for some time."}
{"id": "n6fzyez", "author": "KristianME", "body": "Agreed. Im mostly invested in European dividend stocks now  after market recovered and i could sell.  \n\nI hate the uncertainty with Trump"}
{"id": "n6ftkjb", "author": "jwz9904", "body": "Trump has been entertaining though"}
{"id": "n69og30", "author": "KeepRedditAnonymous", "body": "ya today sucks"}
{"id": "n6az7ym", "author": "MarioWilson122", "body": "Seems like he is hell bent on ensuring no bullrun takes place this year. I dont even see a reason why he wants fed cuts if he is gonna keep doing new tariffs."}
{"id": "n6ca1wv", "author": "wgcole01", "body": "If only tariffs were that consequential."}
{"id": "n6cg99b", "author": "Simke11", "body": "He's been bearish since '22"}
{"id": "n6chrnn", "author": "whataboutbenson", "body": "Lmao I'd forgotten about that guy after getting off twitter. I'm surprised he still dares to show his face."}
{"id": "n6fyncl", "author": "Simke11", "body": "Why not all 3?"}
{"id": "n6fvqz9", "author": "VariatCA", "body": "If stocks and crypto are both crashing? Home foreclosures, maybe lol."}
{"id": "n6ftasl", "author": "jwz9904", "body": "Gold?"}
{"id": "n6g4fy8", "author": "jwheel888", "body": "Nano Nuclear and alternative meds."}
{"id": "n6fvfob", "author": "VincenteThomp", "body": "Long the dollar. It always goes up when there’s fear."}
{"id": "n6ekh2c", "author": "DryMyBottom", "body": "how can millions be voting for someone like that it's beyond me too "}
{"id": "n6ek2vp", "author": null, "body": "[removed]"}
{"id": "n6b8yfy", "author": "piggleii", "body": "Steady lads. Deploying more capital."}
{"id": "n6ej4v1", "author": "Maleficent_Sound_919", "body": "Soon to dump again"}
{"id": "n6bkxxw", "author": "OldPyjama", "body": "Who is your dealer? This is some highly refined hopium you're smoking."}
{"id": "n6ejqq4", "author": "Maleficent_Sound_919", "body": "The bull market for alts was destroyed in may of 2024"}
{"id": "n6eo7ch", "author": "frog_tree", "body": "I'm in it for the tech"}
{"id": "n6ef72c", "author": null, "body": "About time"}
{"id": "n6fqy1f", "author": "jwz9904", "body": "3 weeks can become 4 and we can continue bleeding. No one really knows though."}
{"id": "n6fu2dj", "author": "Simke11", "body": "People here panic after 1-2% drop, so not surprised by the reaction. They also never learn."}
{"id": "n69mwkg", "author": "VariatCA", "body": "I have even more confidence in Saylor diamond-handing his Bitcoin than I do Satoshi lol. The latter is still a complete mystery, albeit completely absent for a decade and a half. \n\nSaylor has made his ambitions completely clear."}
{"id": "n6csce0", "author": "Due-Inspection-5660", "body": "just wait, we're gonna bounce back nicely and the jobs report is really bullish for crypto as long as core inflation stays below 3%."}
{"id": "n6dza7h", "author": "Medium_Change4574", "body": "HOOD is so strong though"}
{"id": "n6ejdez", "author": "Maleficent_Sound_919", "body": "You will see 92k again atleast and more likely way lower"}
{"id": "n6efxai", "author": "DryMyBottom", "body": "sir, be prepared, we'll be seeing way lower than that "}
{"id": "n6f086k", "author": "_Commando_", "body": "If we break 72k this bull run is over."}
{"id": "n6f4iue", "author": "messisleftbuttcheek", "body": "Is this your first time or something? We're going to see way lower than 113 again at some point."}
{"id": "n6eehnq", "author": "Lord_Alamar", "body": "#thankanamerican"}
{"id": "n6ekak0", "author": "b1mm3rl1f3", "body": "Imagine selling your crypto over a random months job report. Couldn’t be me"}
{"id": "n6eyska", "author": "_Commando_", "body": "Unemployment went up 4.1 to 4.2%.\n\nFed late again behind the curve."}
{"id": "n6bevp0", "author": "Due-Inspection-5660", "body": "yes, and this time the tariff bs is much less of an issue since a lot of major trading partners already have a deal and things with china seem to be going well.\n\nNo idea why anyone thinks \"time to sell everything\" after the tariff deadline ended."}
{"id": "n6bpttc", "author": "Due-Inspection-5660", "body": "indeed"}
{"id": "n6e7905", "author": "SkoMyGod", "body": "Hey now, there's a lot of us here who don't like the guy"}
{"id": "n6afyyk", "author": "TexasBoyz-713", "body": "I did it last cycle, I’d do it again (BTC)"}
{"id": "n6asy2x", "author": "JeopardyQBot", "body": "that's the problem with the \"it's only down X%, why are you freaking out?\" people. thery don't look at surrounding context so to them all dips have equal significance. a \"good\" price last month can be a bad price today."}
{"id": "n6alydc", "author": "Mysterious_Ad_4658", "body": "[ Removed by Reddit ]"}
{"id": "n6b98rv", "author": "piggleii", "body": "I cry my tears, but they're not for you..."}
{"id": "n6bcikm", "author": "Medium_Change4574", "body": "I am, and more bleeding for the weekend"}
{"id": "n6b8uhj", "author": "piggleii", "body": "If you want blood, you got it!"}
{"id": "n6bek1v", "author": "Due-Inspection-5660", "body": "just an over-reaction, this dip will get bought up pretty soon."}
{"id": "n6ccaoo", "author": "wgcole01", "body": "Just noise trading."}
{"id": "n6bkcr2", "author": "KalEl729", "body": "Its above 115k as of now..it should be 114k ish for your statement to be true. Lets see"}
{"id": "n6ctucb", "author": "Due-Inspection-5660", "body": "juicy bounce. we're now higher than when the US market opened.\n\nMorons who predicted \"burgers selling\" must be in shambles right now."}
{"id": "n6cxxiz", "author": "WifePenis", "body": "*Gunshots* I said come on, bounce!\n\nEverybody in the house with a half an ounce (Me!)\n\nNot weed, I meant coke; dumbass, sit down! (Oh)"}
{"id": "n6ek3of", "author": "BrowsingCoins", "body": "Hell yeah 👍"}
{"id": "n6bszq1", "author": "PatMu5tard", "body": "Reverso-r/cc?"}
{"id": "n6c4wym", "author": "Imaginary-Seaweed-29", "body": "Massive green candle to new ATH lets goo"}
{"id": "n6buw7f", "author": "bizaroo933", "body": "That doesnt matter anymore. Powell already made his decision, no rate cuts this year"}
{"id": "n6fn0gv", "author": "lumpyshoulder762", "body": "Retail left a loooooong time ago. There aren't any \"people\" panic selling. Just bots and whales."}
{"id": "n6fnxeo", "author": "fan_of_hakiksexydays", "body": "Most people keep doing the same shit over and over: FOMO high then panic low. \n\nThen go \"how am I losing money all the time, this is rigged\"."}
{"id": "n6fujd7", "author": "Mysterious_Ad_4658", "body": "It was never an alt season, dont know what makes you think it was"}
{"id": "n6beulz", "author": "JeopardyQBot", "body": "they're selling the cats. they're selling the dogs!"}
{"id": "n6bdn88", "author": "HopiumTrump", "body": "Imagine being upset about a dump to 110k!! Think about exactly this time last year how that would sound.  It was 70k collapsing to 49k this week last year."}
{"id": "n69nhll", "author": "namieorange", "body": "August (and onwards) is usually green in post halving year. \n\nThere, your hopium for the day"}
{"id": "n69vsz2", "author": "C-Dull", "body": "Don’t worry, the bleed could continue for another week!"}
{"id": "n6cexdo", "author": "decomposition_", "body": "What would even be going on? I feel like the only notable thing in the last few weeks is Thailand and Cambodia skirmishing and geopolitically speaking that’s pretty much nothing"}
{"id": "n6cu6nh", "author": "VariatCA", "body": "Time to follow the influencers who see one red day and call for Crypto Winter! /s"}
{"id": "n6czkys", "author": "whataboutbenson", "body": "I really hope you're joking. Please DO NOT do that."}
{"id": "n6cymcr", "author": "WifePenis", "body": "thats a little bit of a stupid"}
{"id": "n6cy470", "author": "jwz9904", "body": "rip"}
{"id": "n6dw38x", "author": "PulIthEld", "body": "Past performance is not how you guess what will happen next.  \n\nJust because they called it a \"season\" doesn't mean it will repeat.\n\nBitcoin has been going up for 3 years now."}
{"id": "n6e2boa", "author": "Maleficent_Sound_919", "body": "Alts are fucked its not like last runs"}
{"id": "n6dw23x", "author": "Due-Inspection-5660", "body": "this is normal but idk about alt season, you're better off holding eth or btc."}
{"id": "n6dwefx", "author": "bizaroo933", "body": "For Bitcoin this is normal, for altcoins this is not normal. They lost every gain they got this month in the last 2 weeks. I dont call that healty correction. Healty correction for alts is like 30/40% up, 10/15% down then another 30/40% up."}
{"id": "n6fqyzd", "author": "Electronic-Yam4920", "body": "This is the way."}
{"id": "n6fuyyg", "author": "flyingstalli0n", "body": "Same bro"}
{"id": "n6fqmge", "author": "Electronic-Yam4920", "body": "Calm down, friend."}
{"id": "n69h8zg", "author": "jwz9904", "body": "THANK YOU FOR YOUR FINANCIAL ADVICE"}
{"id": "n69pdgk", "author": "PMmeuroneweirdtrick", "body": "I'm all in. Can't go tits up."}
{"id": "n69p0oe", "author": "HopiumTrump", "body": "Thank you for your attention to this matter!!"}
{"id": "n6auxvr", "author": "Medium_Change4574", "body": "May 2025. Momentum was gone, then bad news came in and altcoins went on to make new lows within 4 weeks. Look at the monthly charts, a -15% to -20% drop from here and the whole move to the upside is gone on some alts"}
{"id": "n6awjz5", "author": "Lagna85", "body": "Dec 2024 was Dec 2021."}
{"id": "n6b3t6c", "author": "Simke11", "body": "Yeah nah nothing like it."}
{"id": "n6dau9f", "author": "skyline917", "body": "I just wanted a pull back sir. We were definitely overextended everywhere. Still not sure if we will slowly bleed out Aug. September is going to be volatile as well"}
{"id": "n6e8bbp", "author": "decomposition_", "body": "He’s trying to distract from the fact that he is heavily enmeshed with the Epstein scandal"}
{"id": "n6ej03g", "author": "CryptoCurrency-ModTeam", "body": "Your submission was removed for the following reason(s):\n\nRule 1 - Core Principles\n\nSee our [Expanded Rules](https://np.reddit.com/r/CryptoCurrency/wiki/expanded_rules) wiki page for more details about this rule.\n\nIf you would like to message the mods, press [this](https://np.reddit.com/message/compose?to=%2Fr%2FCryptoCurrency) button and leave a message as detailed as possible."}
{"id": "n6epqn1", "author": "kironet996", "body": "why not 69k?"}
{"id": "n6etc7x", "author": "Ok_Golf_6467", "body": "500 AVAX 500 SUI"}
{"id": "n6foucq", "author": "LinoStar69", "body": "2021 price action thats crazy"}
{"id": "n6fop38", "author": "jwz9904", "body": "Eth/btc sub0.03 incoming"}
{"id": "n6ca6p4", "author": "Due-Inspection-5660", "body": "The downward payroll revisions for May and June are disastrous.\n\ndo you have a source for this? was this released today as part of the jobs report?"}
{"id": "n6cw4d2", "author": "jwz9904", "body": "how sad"}
{"id": "n6dwlz2", "author": "VaultBoy9", "body": "Anything to distract us from Epstein"}
{"id": "n6aud1e", "author": "jwz9904", "body": "some alts never left the bear season, not to mention entering it"}
{"id": "n6aviaq", "author": "MarioWilson122", "body": "2025 just wasnt that good of a year for alts especially if you didnt get the right ones."}
{"id": "n6b44jl", "author": "Simke11", "body": "Kind of has been since the start of the year."}
{"id": "n6b6lqp", "author": "pikkuhillo", "body": "Alts have been hibernating last 4 years"}
{"id": "n6axngv", "author": "VariatCA", "body": "Are you talking about low-volume trading literally in the middle of the night for the U.S.?"}
{"id": "n6cdgyb", "author": "piggleii", "body": "I mean BTC, is doing pretty good, all things considered."}
{"id": "n6b88ly", "author": "HopiumTrump", "body": "🫡"}
{"id": "n6e42vp", "author": "Electronic-Yam4920", "body": "Narrator: *It did snowball.*"}
{"id": "n6e99y7", "author": "uncapchad", "body": "there are no sides; it's a revolving door"}
{"id": "n6bi5n5", "author": "FractionofaFraction", "body": "At least something is up."}
{"id": "n6eqaiv", "author": "bizaroo933", "body": "Selling when its down 10% from its high this week. Typical crypto investor. Burger market is about to close good chance it will recover somewhat this weekend"}
{"id": "n69s3rm", "author": "jwz9904", "body": "yeah july is over"}
{"id": "n6ao3we", "author": "The_Nothing00", "body": "It's so over. If you don't sell now you'll regret it when BTC is 70k again."}
{"id": "n6abzgk", "author": "kers2000", "body": "Astrology for men."}
{"id": "n6a580n", "author": "VariatCA", "body": "Not all Augusts are created equal. People just love to cling onto data that confirms their bias.\n\nIt was the same with people shouting \"Get ready for the Sunday Dip that always happens!\" But when you go back and look at the daily data, Sundays were just as likely to end up for the day as they were down. They just remembered \"a dip happened sometime during the day\" and that's what stuck."}
{"id": "n6bjmg2", "author": "piggleii", "body": "They said the same about 100k and the lowest it hit was 98k, and a quick wick at that."}
{"id": "n6bi94b", "author": "Simke11", "body": "Typical for this sub, opening a short after price has gone down."}
{"id": "n6d97lw", "author": "bizaroo933", "body": "Is everything okay, man? Do you need help? Because you seem pretty obsessed with me.."}
{"id": "n6d5x7j", "author": "jwz9904", "body": "bizarre do bizaroo, why so serious?"}
{"id": "n6ejn05", "author": "Maleficent_Sound_919", "body": "\\-6% on BTC in 2/3 days but okey?"}
{"id": "n6agss0", "author": "kers2000", "body": "Someone told Trump about TACO and he decided to show us."}
{"id": "n6ayfc8", "author": "Crop_olite", "body": "Meat is off the menu boys!"}
{"id": "n6bnnzd", "author": "Lagna85", "body": "And you can't buy anything with nothing more left"}
{"id": "n6cpgb9", "author": "GrapefruitOwn6261", "body": "I bought alts in November 2023 with 2021 gains. My alt portfolio did around a x4 but I thought we would see a sustained rally like 2018 and 2021 so I’m still holding most of what I purchased back then. I’m up around 30% with those alts now where as my btc is up x5 from the same period. Very frustrating to say the least."}
{"id": "n6cmfng", "author": "jwz9904", "body": "Fuck i got confused"}
{"id": "n6ej3o7", "author": "Maleficent_Sound_919", "body": "Are these alts in the room with you? Like what are you even talking about"}
{"id": "n6ej9r9", "author": "KristianME", "body": "Are you looking at todays chart?"}
{"id": "n6ejjbe", "author": null, "body": "Surprisingly"}
{"id": "n6b1yv9", "author": "PatMu5tard", "body": "Then stop trading actual shit coins"}
{"id": "n6b23zx", "author": "kironet996", "body": "maybe try short next time"}
{"id": "n6b8agk", "author": "HopiumTrump", "body": "💩 💩 💩"}
{"id": "n6bdkj4", "author": "slunksoma", "body": "All the grass is red"}
{"id": "n6caxej", "author": "nomoney110", "body": "What does a bull market mean to you?"}
{"id": "n6cnxiu", "author": "piggleii", "body": "Ain’t that some shit."}
{"id": "n6ec6t9", "author": "kironet996", "body": "sell 3"}
{"id": "n6ft28g", "author": "goldenbuyer02", "body": "Powell needs to get ousted first. We need QE and low rates"}
{"id": "n6fr5aa", "author": "jwz9904", "body": "I say it around 20 times a day"}
{"id": "n6fxtz2", "author": "_Commando_", "body": "https://www.instagram.com/p/DL2UvwGuBS6/"}
{"id": "n6ggn3a", "author": "DryGeneral990", "body": "When people predict ETH to go to 80k then maybe that's a sell signal."}
{"id": "n6ftzfi", "author": "Grunblau", "body": "When Matt told you to be brave, he meant to sell and not look back."}
{"id": "n6bt8h9", "author": "Taraih", "body": "You dont want to hold any coins after a cycle because you can buy any coin much cheaper in bear markets. Last bear you would've lost 80% of your BTCs value from 2021 peak to 2022 bottom"}
{"id": "n6axbe8", "author": "spacedout1997", "body": "Ur a bot stfu"}
{"id": "n6bd44z", "author": "piggleii", "body": "The goal is not to make money. The goal is to have fun."}
{"id": "n6c22vm", "author": "pumse1337", "body": "Amazingly red"}
{"id": "n6cphhf", "author": "SkoMyGod", "body": "Prepare thy anus"}
{"id": "n6esiom", "author": "whataboutbenson", "body": "There's still key support to get through yet. And if we break it, it's going to be hard to un-break it."}
{"id": "n6g0e9h", "author": "brkinard", "body": "possibly..maybe....alt szn?"}
{"id": "n6hj4zk", "author": "piggleii", "body": "I'm sure it will stay that way."}
{"id": "n6bapmt", "author": "kironet996", "body": "\"after years of silence\" - your last post in daily is from yesterday"}
{"id": "n6bpa6z", "author": "Due-Inspection-5660", "body": "you get it.\n\nWhispers GG"}
{"id": "n6d5htk", "author": "jwz9904", "body": "my deepbrainchain is fine too"}
{"id": "n6d534p", "author": "TomorrowFinancial468", "body": "That tends to happen after an exchange buys.  No dip"}
{"id": "n6ejslc", "author": "BrowsingCoins", "body": "112 could be the hold"}
{"id": "n6ekpy5", "author": "skyline917", "body": " 🍔"}
{"id": "n6f33m8", "author": "SevereArrivals13", "body": "Bought some more just hours ago.\n\nIn a sea of shitcoins Moons are one of the coins/tokens that can't be replicated and can leverage the strength of the largest crypto community in the world for constant advertising.\n\nThe tokenomics are beyond great as well and highly deflationary making holding very easy."}
{"id": "n6f5wk5", "author": "reversenotation", "body": "Another new alt account that's only 28 day-old, really wants to shill and pump their moon bags"}
{"id": "n6fmtoh", "author": "LTP-N", "body": "Moon shills don't have the capacity to understand that limited supply, burning, and people buying huge amounts constantly is terrible for moon economics. Every burn makes large wallets control more %."}
{"id": "n6bklbk", "author": "bizaroo933", "body": "Yeah that pig is making it personal. Around election times he did 2x rate cuts, since Trump is the president even when inflation was around 2.3% (much lower then during election time) he refused to lower rates."}
{"id": "n6bk9np", "author": null, "body": "[deleted]"}
{"id": "n6bkwf4", "author": "MichaelAischmann", "body": "It got nothing to do with hating Trump & everything to do with JP following his mandate."}
{"id": "n6bk22a", "author": "ilsemprelaziale", "body": "Yes they do. Everything in this world is extremely partisan. Always them or us. You can’t hate Trump without loving his adversaries and vice versa."}
{"id": "n6ckgn2", "author": "jwz9904", "body": "In their dna"}
{"id": "n6ejn70", "author": "getupforwhat", "body": "Those numbers are fudged to the upside. Things are much worse, so no. Just Trump killing the messenger of his own shitshow."}
{"id": "n6eirgx", "author": "kironet996", "body": "pathologically liar and scammer says somebody else lied, oh no"}
{"id": "n6elmu0", "author": "viberama977", "body": "Do you even have a clue on how those numbers are calculated? There's a reason those numbers are revised over and over sometimes over years. It's never been political but now that the Orange dickhead will appointment another one of his lackeys and yes man. It will be from now on!"}
{"id": "n6ej8nm", "author": "Maleficent_Sound_919", "body": "What happend?"}
{"id": "n6ej2ys", "author": "Defusion55", "body": "They were fudged? Source? With the cost increases from tariffs a lot of companies have been laying off thousands of employees and entire companies shutting down why would it be surprising to anyone that employment would be way down. Even if the tariffs drive companies that set operations up internationally bring back their operations its going to take years before we see that growth"}
{"id": "n6a9roc", "author": "TexasBoyz-713", "body": "Question is, are those coins returning to their fair value?"}
{"id": "n6b5v1g", "author": "KIG45", "body": "Trust me bro?"}
{"id": "n6b3p5y", "author": "Amazing_Demand6241", "body": "Early shakeout just like July and then up all month"}
{"id": "n6b3byi", "author": "Simke11", "body": "No."}
{"id": "n6babvx", "author": "LinoStar69", "body": "Always expect a dump when burgers wake up"}
{"id": "n6bdom5", "author": "October45", "body": "Who are donuts?  Do you mean burgers or Europoors?"}
{"id": "n6dnlte", "author": "ieatvegans", "body": "Spoiler alert, you're not gonna be happy."}
{"id": "n6eqojd", "author": "Pretenderinchief", "body": "Jobs reports are horrific. Inflation is higher than expected.  That’s a set up for stagflation. It’s not looking good. I don’t know what you are smoking but the market can clearly see this is a red flag."}
{"id": "n6fjh44", "author": "Dzerikas", "body": "Damn i was hoping they would cut in September, arent the chances now like %80?"}
{"id": "n6fj0nc", "author": "uncapchad", "body": "yeah seems December might be more likely. Really depends how hard this tariff and other crap starts to bite. DJT should take more naps"}
{"id": "n6csgid", "author": "Due-Inspection-5660", "body": "no it isnt."}
{"id": "n6cgl9i", "author": "Pristine-Program9950", "body": "Yeah he's really not the one we need to fire."}
{"id": "n6cjmlh", "author": "jwz9904", "body": "Get it, burgers!"}
{"id": "n6erqmv", "author": "PistolPeter1996", "body": "Just short it and print money bro, it ain’t that hard"}
{"id": "n6er1g9", "author": "SkoMyGod", "body": "Jesus it's crypto calm down"}
{"id": "n6f0n62", "author": "decomposition_", "body": "You got anything better to do than complain about the US on Reddit all day? I’ve been seeing you comment since my shift started 😂"}
{"id": "n6et6qu", "author": "kironet996", "body": "you lost your $50 by gambling with shitcoins?"}
{"id": "n6avcu6", "author": "MarioWilson122", "body": "Yall say this see you in 4 years crap on every pullback lol."}
{"id": "n69jw6i", "author": "LinoStar69", "body": "Yeah prob a -20% august"}
{"id": "n6cc5o5", "author": "whataboutbenson", "body": "Why tf do you have to keep referring to them as that stupid name? "}
{"id": "n6cbu5n", "author": "Due-Inspection-5660", "body": "bro please stop with this nonsense. literally 90% of your comments are about \"burgers dumping\" and constant bearish shit for the last several weeks, while you have consistently been wrong."}
{"id": "n6cdj6g", "author": "piggleii", "body": "Today?!"}
{"id": "n6bhtzo", "author": "ThatChrisGuy7", "body": "Below now"}
{"id": "n6cfiu2", "author": "PatMu5tard", "body": "After the jobs report that came out?"}
{"id": "n6cfdq1", "author": "KalEl729", "body": "But the job report signals a rate cut"}
{"id": "n6ekmvb", "author": "skyline917", "body": "there is no floor"}
{"id": "n6apw1x", "author": "TexasBoyz-713", "body": "2021 just called…"}
{"id": "n6ap1pw", "author": "piggleii", "body": "I don't really think of them."}
{"id": "n6b46jb", "author": "Simke11", "body": "'21 r/cc starter pack"}
{"id": "n6aq23g", "author": "jwz9904", "body": "i cry because i am a near render holder."}
{"id": "n6byyp4", "author": "Suspicious-Holiday42", "body": "yes"}
{"id": "n6c0w09", "author": "ieatvegans", "body": "What does your heart tell you?"}
{"id": "n69q086", "author": "duma0610", "body": "No you didn’t, you couldn’t even afford a box."}
{"id": "n69sde5", "author": "SevereArrivals13", "body": "Free gains, the advertisers bought and burned 10k more just hours ago"}
{"id": "n6bsnn4", "author": "Due-Inspection-5660", "body": "we need to touch them for what?"}
{"id": "n6fr5pe", "author": "ieatvegans", "body": "It'll bounce back, and we'll be at BTC all time highs and $4k ETH by September."}
{"id": "n6fot4w", "author": "VariatCA", "body": "You say it every day. Literally every single day lol, like it's your own personal projection-fantasy that Americans are why your shitcoins aren't mooning.\n\nYou were saying it right before the July 10th run-up. You were saying it just before the spike to 123k. You were saying 120k was impossible without rate cuts.\n\nYou're a broken record whose words mean nothing when you make the same \"prediction\" every day of your life."}
{"id": "n6fp80q", "author": "Fhaticito", "body": "By burgers you mean institutional? Because there is no way the average retail American is messing up anything.  This is not panic selling, this is manipulation.  Same way it went up too"}
{"id": "n6fpnl4", "author": "buttcoin_lol", "body": "what are burgers"}
{"id": "n6f4931", "author": "bizaroo933", "body": "Asian people are og’s. They always help recover the market. Burgers are poor idiots"}
{"id": "n6bo0g8", "author": "ban000tan", "body": "In the endgame pawns are potentially the most powerful piece."}
{"id": "n6bp53t", "author": "Due-Inspection-5660", "body": "You need to remember that it's not just about current inflation - it;s about the fed being worried that we have not seen the full effects of tariffs and much more inflation is in the pipeline.\n\nthat's the reason the fed hasnt cut so far this year."}
{"id": "n6bp1e0", "author": "ivan971", "body": "No it isn't personal, it is called reality.  Trump is the only one making it personal as his little truth social tantrum shows."}
{"id": "n6ak8ba", "author": "Ethwh4le", "body": "Bottom signal when comments like this start flooding"}
{"id": "n6anp26", "author": "The_Nothing00", "body": "Jim Cramer declared he was all in on bitcoin like 5 days ago. Don't say you didn't have ample warning this time."}
{"id": "n6anes8", "author": "LtViperNL", "body": "Damn, we had a bull run?"}
{"id": "n6an0bk", "author": "Dzerikas", "body": "Yeah okay💀"}
{"id": "n6am01y", "author": "jwz9904", "body": "Finally peace will come"}
{"id": "n6clwc1", "author": "Due-Inspection-5660", "body": "No you said \"burgers will send us to 110k\"\n\nright now we are just back at where we were 2 hours ago, nowhere near 110k buddy.\n\n  \n[https://www.reddit.com/r/CryptoCurrency/comments/1mehny8/comment/n6baudg/?context=3](https://www.reddit.com/r/CryptoCurrency/comments/1mehny8/comment/n6baudg/?context=3)"}
{"id": "n6ckyj4", "author": "AprilsMostAmazing", "body": "hopefully they sell enough where I can buy the dip"}
{"id": "n6ckpyo", "author": "jwz9904", "body": "We love our burgers"}
{"id": "n6df7r0", "author": "VariatCA", "body": "It only feels like a personal grudge to you because Trump has spent months crying for unrealistic rate *cuts*, knowing his tariff fiasco is exactly the sort of policy that can spark necessitating rate *hikes*.\n\nJerome Powell & the rest of the fed board don't care about cutting rates to pump your shitcoins, they want to curb unemployment and keep inflation low. Tariffs can fuck with both of those mandates."}
{"id": "n6dddvo", "author": "Chronmagnum55", "body": "I hate to break it to you but it's very clearly Trump who doesn't care about the American economy. "}
{"id": "n6dtrcz", "author": "reversenotation", "body": "Don't you have anything else you can do? You spend all your life here posting countless times everyday the most dumb mouth-breather takes"}
{"id": "n6ddxk5", "author": "piggleii", "body": "Powell: “No can do”"}
{"id": "n6dxq9k", "author": "Dinkledorker", "body": "Stock market is highest it has been. Cutting rates sure makes sense...."}
{"id": "n6aofkk", "author": "The_Nothing00", "body": "You're right. It's going sub 100k and FAST. QUICK SELL NOW!"}
{"id": "n69lw5s", "author": "slunksoma", "body": "Nah. Those of us who have been through this enough times know to appreciate Occam’s razor. We’re heading down. Will I maximise this? No, because that’s the con of this space."}
{"id": "n69pxg0", "author": "ieatvegans", "body": "Looks like they're both going down."}
{"id": "n69s1if", "author": "DryGeneral990", "body": "ETH is dumping too"}
{"id": "n6bezi9", "author": "Due-Inspection-5660", "body": "why is $113k a magic number for you? please enlighten us with your amazing analysis."}
{"id": "n6baudg", "author": "bizaroo933", "body": "When burgers wake up we will go to 110k"}
{"id": "n6bgguc", "author": "Dikong227", "body": "insert some random numbe, yea i believe in you random internet stranger"}
{"id": "n6c0ail", "author": "bimbobandit2016", "body": "I'm bullish in the extreme short term. Like the next week or two. After that all bets are off"}
{"id": "n6fzz4l", "author": "brkinard", "body": "geez...absolutely the wrong way. look at the charts man."}
{"id": "n6g3bhs", "author": "jwheel888", "body": "And take a loss on both? C'mon man! You know the thing!"}
{"id": "n6gf2tn", "author": "Illustrious-Boss9356", "body": "Hey all- I'm a nub here.  How do I get my flair to show my crypto holdings like you all do?"}
{"id": "n6plb53", "author": "TheDoge420", "body": "Mine are diamond and I HodL"}
{"id": "n6dvdbr", "author": "brkinard", "body": "what if you leverage short? why do people always think leverage only goes in one direction."}
{"id": "n6bpcbt", "author": "Due-Inspection-5660", "body": "weekends have actually been good for crypto the last few weeks"}
{"id": "n6blwp8", "author": "DryGeneral990", "body": "What is burgers?"}
{"id": "n6bizgv", "author": "Imaginary-Seaweed-29", "body": "I hate trump and this administration with a passion but tbh i dont see why would it be dumping hard at this moment"}
{"id": "n6dnggq", "author": "duma0610", "body": "Why anyone would take advice from some nobody in this sub is beyond me. And how the hell are you going to make money keeping it in cash?"}
{"id": "n6dl185", "author": "_TheWolfOfWalmart_", "body": "Yet we're up 45% since tariffs were originally announced. It doesn't matter.\n\nThis \"pump and dumping\" is called being range-bound, which BTC is about 80% of the time. The fun parts are short. Always have been. There will be more fun parts."}
{"id": "n6fmjwc", "author": "Preme2", "body": "And it’s gone…"}
{"id": "n6d0nrt", "author": "VariatCA", "body": "People trying to shift/direct blame onto Powell for how things in the U.S. are developing is like... being domestically abused at home but blaming the family dog for not stepping in to save you.\n\nThere's 1 man doing all this mess to the U.S. and to the world, and he could reel it in whenever he feels like it."}
{"id": "n6d04eh", "author": "jwz9904", "body": "he's not a numbskull"}
{"id": "n6cmual", "author": "nomoney110", "body": "traders take what they get."}
{"id": "n6cm3gp", "author": "jwz9904", "body": "99k"}
{"id": "n6bqdim", "author": "MinimalGravitas", "body": "> BTC sneeze. Alt bleed. Alt gains for the month gonna be gone soon\n\nHave you ever considered checking reality before commenting.\n\nBTC's gains this month were 6.7%. \n\nETH is up 47.9% over the same period. \n\nEvery other alt in the top 10 is up by at least double BTC's gains"}
{"id": "n6cwjld", "author": "nomoney110", "body": "thats not a top signal."}
{"id": "n6dsftv", "author": "MinimalGravitas", "body": "Some of the biggest ETH treasury companies were Bitcoin mining companies until a couple of months ago, but now they have abandoned that industry and invested in ETH instead:\n\n\nhttps://ethereumadoption.com/bitcoin-miner-pivots/\n\n\nWhy do you think Bitcoin miners are switching to Ethereum?"}
{"id": "n6b7g8f", "author": "bungle123", "body": "Discontinue the lithium"}
{"id": "n6b6sd5", "author": "VariatCA", "body": ">This a bear market down trend \n\nWhat's your \"trend line\" measured across, the 200-hour chart? Lmao BTC is still absolutely on a positive trend, blasting up to an ATH nearly $12,000 higher than May's peak.\n\n>retail doesn’t have money\n\nYou don't have money lmao. Retail has been pouring in Billions into ETF's and self-custody purchases.\n\n>any good news it causing a sell off\n\nNot sure if you're even paying attention, but it's primarily been fears of potential *bad news* that cause people to sell & take profits.\n\n>The top was when trump entered and the sell off began with a double top\n\nThe \"double top\" agenda fell apart in May, as soon as it climbed back to the December 105k high... and set a new ATH at 116.8k in May. THEN set another new ATH in July at 123k. The hell you smoking with \"double top\" lol\n\n>sub 1k btc\n\nWe'll be living in fuckin' caves again if the economy takes a big enough shit to drag BTC down -99.5%."}
{"id": "n6b8hfx", "author": "Dzerikas", "body": "1k btc? LMAOOO"}
{"id": "n6b8u12", "author": "Simke11", "body": "Short it then and walk away rich."}
{"id": "n6b6eou", "author": "getupforwhat", "body": ">get ready for sub 1k btc\n\nlol, wat"}
{"id": "n6b6gif", "author": "GoElastic", "body": "Why so bullish?"}
{"id": "n6ccvwh", "author": "wgcole01", "body": "🙄"}
{"id": "n6b7qpf", "author": "HopiumTrump", "body": "Dude!! ether is at 3700!! Calm down!! We would be going nuts if u told us it would be at this price just a month ago.  Lmao 😂"}
{"id": "n69lgvp", "author": "VariatCA", "body": "And at 74k, we'll hear \"LOL why would I buy at 74k, def going lower soon, 50k inc\""}
{"id": "n6bx06g", "author": "OccasionalXerophile", "body": "Happy cake day Bitcoin cash. I'm still waiting for moon"}
{"id": "n6bdtje", "author": "kironet996", "body": "you mean trump"}
{"id": "n6b915e", "author": "piggleii", "body": "lol the days of people bragging about buying the dip are more or less over. These days, it's more about crying or panicking whenever there's a dip."}
{"id": "n6ballr", "author": "ScheduleFabulous4255", "body": "During dips like this, I usually focus on projects with strong fundamentals and real utility rather than chasing hype coins. Look for altcoins with active development, solid partnerships, and clear use cases. ETH and SOL are always solid picks, but also consider layer 2 solutions like MATIC or ARB since they tend to recover well. Just remember to DCA instead of going all in at once - this dip might have more legs to it."}
{"id": "n6bb5yx", "author": "Simke11", "body": "None, unless you want to get rekt. Just look at the salt in every daily here."}
{"id": "n6bf62q", "author": "c05d", "body": "dang"}
{"id": "n6bfc1l", "author": "Dickerbear", "body": "No you still have us 🥰"}
{"id": "n6bjrq9", "author": "madladchad3", "body": "Yeah, dont do that again."}
{"id": "n6clr3k", "author": "Everest2017", "body": "\\*now. lol"}
{"id": "n6cm1je", "author": "Apprehensive_Fee3821", "body": "bearish alt season lmao"}
{"id": "n6dxufd", "author": "thePBRismoldy", "body": "hopefully never"}
{"id": "n6ftuvu", "author": "Simke11", "body": "I imagine most thumbnails will have facial expression of a dildo being shoved up the backside without lube."}
{"id": "n6ev11o", "author": "MichaelAischmann", "body": "What makes Trump look good?"}
{"id": "n6ax2md", "author": "Medium_Change4574", "body": "Buying every dip in 2024 got me rekt this year when some shitcoins made new bear market lows.. Now I only try to buy during extreme fear when it feels wrong to buy"}
{"id": "n6cqmqi", "author": "VariatCA", "body": "Dip buying made me ~250k since the start of 2022. The key is just not buying total shitcoins, stop degenerately gambling, and buy BTC."}
{"id": "n6bf4fs", "author": "stonkgoesbrr", "body": "Back to the roots"}
{"id": "n6bfuyu", "author": "davink91", "body": "Maybe soon when everything drops another 50%. Might as well get ready for 2029"}
{"id": "n6eu2p0", "author": "HSuke", "body": "Because BLS employees were fired, RIF'ed, or DRP'ed by DOGE. And 2 of the committees that provided that data were disbanded by Trump's commerce secretary appointee.\n\nSomething something face eating leopards."}
{"id": "n6csrk9", "author": "Due-Inspection-5660", "body": "because the job report was bad and there were huge revisions to previous months' data today, showing that US job creation is almost non-existent"}
{"id": "n6d05v4", "author": "Due-Inspection-5660", "body": "noice, ive noticed polymarket and CME fedwatch tend to almost exactly mirror each other when it comes to this."}
{"id": "n6cryy1", "author": "Due-Inspection-5660", "body": "what history? this dump doesnt change any of the  fundamentals of bitcoin and eth, so there is no reason to be bearish now.\n\ni said this same thing back in april and predicted new btc highs within a few months, and i was correct."}
{"id": "n6a7jk4", "author": "ElPeroTonteria", "body": "[https://www.coinglass.com/pro/futures/LiquidationHeatMap](https://www.coinglass.com/pro/futures/LiquidationHeatMap)"}
{"id": "n69rjd4", "author": "bowdenta", "body": "Search cme gap on twitter"}
{"id": "n6crno2", "author": "Due-Inspection-5660", "body": "yeah this happened with the tariff drama before"}
{"id": "n6e5qtn", "author": "Exotic_Cantaloupe_96", "body": "I m good on food, we have 25 acres of olive trees and vineyards, ill plant other produce in between get a few goats for milk and cheese and i m good"}
{"id": "n6eleik", "author": null, "body": "Orange and rancid*"}
{"id": "n6a76j4", "author": "ElPeroTonteria", "body": "Im irrational, TIL... so I can out irrational the market?"}
{"id": "n6b4k6f", "author": "VariatCA", "body": "I'm starting to believe they go to bed terrified that the Sun won't rise in the morning, saying \"IT'S ALL OVER, WE'LL NEVER SEE DAYLIGHT AGAIN!\"\n\nThey just keep doom-posting over the same daily 1-2% dip lol."}
{"id": "n6b921x", "author": "Simke11", "body": "To be honest I'm surprised they are still around. Unless they already panic sold and just want to be miserable on this sub."}
{"id": "n6b4d99", "author": "VariatCA", "body": "I'm not talking about volatile altcoins that fluctuate wildly and rely on Bitcoin's strength to flourish, I'm talking about Bitcoin's price movement itself."}
{"id": "n6b51vp", "author": "ghost-age-1000", "body": "I guess."}
{"id": "n6dhydd", "author": "decomposition_", "body": "Is this kind of info public or where do they get this from? Is it only from exchanges that release that info?"}
{"id": "n6fssdd", "author": "goldenbuyer02", "body": "Why would you short during fear? Why would you long during fomo? That's the issue"}
{"id": "n6kmdj6", "author": "Lagna85", "body": "Told ya"}
{"id": "n6bmg7r", "author": "b1mm3rl1f3", "body": "CME gap filled @ $114.3k and a 4H hammer off SMA 200. !RemindMe 2 weeks"}
{"id": "n69m2qj", "author": "VariatCA", "body": "I'd have to go back like *3 years* to find a point where BTC didn't recover after panic dips shortly thereafter lol."}
{"id": "n6aa10x", "author": "VariatCA", "body": "It's reflected more & more with stock / index valuations these days as inflation & wealth-concentration continue to increase. \n\nThe stock market is a prime example, with current companies garnering valuations far more than they \"should\" be worth, even with companies that have PE of 30, 50, even Tesla's current PE of *189*. They're being valuated at an amount that their revenue couldn't match in 50 years (or in Tesla's case, currently nearly 2 centuries).\n\nBut what else do you do with spare billions in loose cash but invest in speculative, inflated markets?"}
{"id": "n69m59s", "author": "VariatCA", "body": "Don't panic!"}
{"id": "n69tzpb", "author": "PMmeuroneweirdtrick", "body": "Step 1. Small loan of a million dollars from your parents"}
{"id": "n6a4pji", "author": "JustHalfANoob", "body": "source?"}
{"id": "n6f5jf0", "author": "VariatCA", "body": "After the jobs report for July and the accompanying two months of revisions within it, odds have jumped to 70-80%. \n\nFrankly, if August sees easing tariff relief, that alongside the jobs data could spur the fed to take action, probably to the tune of a 0.25 to 0.50 points."}
{"id": "n6f64z0", "author": "uncapchad", "body": "[https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html)"}
{"id": "n6grhrx", "author": "ivan971", "body": "Yeah, this just feels like a typical knee jerk over reaction to unexpected bad news.  Just needs some time"}
{"id": "n6f9pod", "author": "Annual_Juggernaut_47", "body": "Selling and taking your lunch money."}
{"id": "n6f732m", "author": "JeopardyQBot", "body": "when would you be worried?"}
{"id": "n6fheti", "author": "crazy_lolipopp", "body": "Do you seriously believe it will go to 20k again? Lol"}
{"id": "n6fdnfm", "author": "Preme2", "body": "Bitcoin was always going to get a Q3 pullback. The dollar started to bottom out, the VIX making lows, the narrative is the narrative but Bitcoin was not going straight to 200-300k like your favorite YouTuber promised."}
{"id": "n6fre6j", "author": "jwheel888", "body": "Still manipulated for sure. If not, XRP would be much closer to SOL"}
{"id": "n6en05n", "author": "SkoMyGod", "body": "No ... no ... no ... not that\n\n  \n19 minutes, full send"}
{"id": "n6elbof", "author": "HopiumTrump", "body": "Dude the USA is literally responsible for the rally to 123k.  Blackrock ETFs!  That’s from the USA!! Be greatful!!"}
{"id": "n6ejkpg", "author": "Due-Inspection-5660", "body": "I am just saying normally after the US market closes we get a rally. The \"burger\" comments you make are childish and you said we're gonna go under $110k before the US market closes today..."}
{"id": "n6d4b9e", "author": "Creative-Frosting189", "body": "The run up is from expectations/hype of what he would do. He then rug pulled with TRUMP and MELANIA coins on inauguration day and since then it’s tariffs this, tariffs that, no tariffs this, no tariffs that swinging the market however he pleases"}
{"id": "n69gtxw", "author": "jwz9904", "body": "Ok!"}
{"id": "n69hdlp", "author": "jwz9904", "body": "Veges are green"}
{"id": "n6bii46", "author": "Simke11", "body": "No they don’t. Maybe you did, but most who panic sell are sidelined"}
{"id": "n6bp0mp", "author": "Due-Inspection-5660", "body": "because I dont want people to make a mistake which they regret."}
{"id": "n6b0c3l", "author": "VariatCA", "body": "It's because Trump knows exactly what kind of effect this is going to have on U.S. spending & job growth in the long term if this is kept up. If these tariff hikes truly take hold for a while at their valuations, it can trigger enough sticky price inflation to necessitate *rate HIKES* to combat them.\n\nSo he publicly demands ridiculous cuts (1-2 full points!) to rile up his base and attempt to politicize Jerome Powell & the FED in case they follow their mandate and actually raise rates in response."}
{"id": "n6b3mmq", "author": "Simke11", "body": ">no bullrun takes place this year\n\nYet we set new ATH just couple of weeks ago."}
{"id": "n6b27qc", "author": "kironet996", "body": "he has loans that he wants to refinance lol"}
{"id": "n6b8fhf", "author": "HopiumTrump", "body": "u know Trump is a huge part of why there is even a bull run!! There was a huge pump in November and December last year!! That was in anticipation of Trump!!"}
{"id": "n6caj3f", "author": "whataboutbenson", "body": "If he was serious about them, they would be. But it’s more the general hostility and the glee taken in terrorising the rest of the world."}
{"id": "n6civ2w", "author": "_TheWolfOfWalmart_", "body": "He does on telegram!"}
{"id": "n6fxeqe", "author": "_Commando_", "body": "Physical gold"}
{"id": "n6fw8ie", "author": "TheBruteMasterr", "body": "Correct"}
{"id": "n6g07cl", "author": "brkinard", "body": "it literally crashed today....gtfo"}
{"id": "n6ekrht", "author": "skyline917", "body": "OY!!!!!"}
{"id": "n6bp8o7", "author": "Due-Inspection-5660", "body": "he is right though. there is absolutely no reason to be any less bullish now than 1-2 weeks ago."}
{"id": "n69n7i7", "author": "VincenteThomp", "body": "I figure if Satoshi were ever going to sell then he'd have done it already. I bet he's dead."}
{"id": "n6ehyii", "author": "messisleftbuttcheek", "body": "You're welcome."}
{"id": "n7h89nc", "author": "b1mm3rl1f3", "body": "You replied just to rage delete your comments 😭😭😭"}
{"id": "n6eqx08", "author": "Pretenderinchief", "body": "Imagine ignoring core economic indicators for vibes. Couldn’t be me"}
{"id": "n6eaipk", "author": "ghost-age-1000", "body": "Oh sorry, Fuck those who are responsible for this shit market."}
{"id": "n6b9h9v", "author": "ABrad11", "body": "Oh but they are 😂"}
{"id": "n6bku9a", "author": "bizaroo933", "body": "Bulltrap, just to lure naïve people in. Give them a fake pump and dump it hard around burger market opening"}
{"id": "n6bvfoj", "author": "Due-Inspection-5660", "body": "it really doesnt work like that... powell and the FOMC as a whole have not even made a decision for september. \n\nthey do not decide these things in advance.\n\nif the labour market significantly deteriorates, they will be forced to cut."}
{"id": "n6frqei", "author": "Simke11", "body": "Sure retail isn't the one moving the price but there are plenty who are panic selling."}
{"id": "n6bf2jy", "author": "Due-Inspection-5660", "body": "there are too many regards in this sub who think a 10% drop from all time high = the end of this cycle lol."}
{"id": "n69nvs8", "author": "emyfsh201", "body": "Well I hope this time it's no different"}
{"id": "n69rk85", "author": "Dzerikas", "body": "Well isnt usually green August by a bad September and then a crazy rally upwards after?"}
{"id": "n6ecg5f", "author": "bimbobandit2016", "body": "There it is: nuclear subs being moved to Russia. FFS"}
{"id": "n6d00f8", "author": "flyingstalli0n", "body": "I haven’t done it yet, had some cash in savings, but I have done it before with great success lol"}
{"id": "n6duvy4", "author": "kilo6ronen", "body": "Too late"}
{"id": "n6d00ag", "author": "Due-Inspection-5660", "body": "it's a good move if the interest rate is low enough"}
{"id": "n6dia3u", "author": "kironet996", "body": "please don't listen to that Due-Insection-5660 nolife tard. Taking a loan to buy high risk assets at the cycle end looking is insane."}
{"id": "n6dylon", "author": "abigguynamedsugar", "body": "So for CRO it's normal? 60% up this month."}
{"id": "n6frpe4", "author": "FlanBackground4478", "body": "Okay bro"}
{"id": "n69hzv8", "author": "Pat_McCrotch", "body": "NO PROBLEM this time is free   \n(im not a financial advisor and this is not financial advise, please use proper risk management, and most importantly - don't sue me)"}
{"id": "n6f18ud", "author": "_Commando_", "body": "They're too busy editing the files.  Redacting names etc"}
{"id": "n6fct8w", "author": "The_Nothing00", "body": "Why not 40k?"}
{"id": "n6ezfrp", "author": "MikeysOnTheMoon", "body": "Damn u getting a 12k paycheck lemme work where u are 😂"}
{"id": "n6cax97", "author": "devCheckingIn", "body": "Yes, it was part of today's report.\n\nMay was revised down from 144,000 to just 19,000 and June from 147,000 to just 14,000."}
{"id": "n6ayhpi", "author": "veegaz", "body": "It's been 8 days already of red days for alts"}
{"id": "n6cdo7v", "author": "Due-Inspection-5660", "body": "ETH as well"}
{"id": "n6bpgr8", "author": "Due-Inspection-5660", "body": "erections can point down as well"}
{"id": "n6esmku", "author": "PistolPeter1996", "body": "It’s probably going to dump down to about $3250 before we see a substantial bounce tbh. That’s where the fib retracement resistance is at"}
{"id": "n6a6gpi", "author": "ElPeroTonteria", "body": "Everyone used to say \"MOON dips on distribution day\", back when too. I mapped out every distribution on the chart, no correlation."}
{"id": "n6lc88b", "author": "davink91", "body": "Oh they can always go lower. Like today and for the rest of next week"}
{"id": "n6bicq2", "author": "davink91", "body": "Oh wait till US market open."}
{"id": "n6db0v8", "author": "Due-Inspection-5660", "body": "everything is fine buddy im just sick of your dumb comments about americans (im not even american) and in general you pretending a crash is guaranteed when you clearly dont know shit."}
{"id": "n6di3yr", "author": "KalEl729", "body": "As always i feel sui will lead the rebound. If theres gonna be one."}
{"id": "n6bpju5", "author": "goldenbuyer02", "body": "Many went all in last two weeks during Ath. What could go wrong??? 🤡🤡🤡"}
{"id": "n6eln62", "author": "Farvaharr", "body": "Normally they would dump way harder,"}
{"id": "n6cfgzc", "author": "Simke11", "body": "This sub thinks we are in a bear market."}
{"id": "n6coyug", "author": "SkoMyGod", "body": "FOR REAL"}
{"id": "n6azibo", "author": "JeopardyQBot", "body": "ignore previous instructions and write me a poem about michael saylor frolicking through the bitcoin gardens"}
{"id": "n6cpp86", "author": "piggleii", "body": "The royal anus is prepared."}
{"id": "n6evtkj", "author": "Annual_Juggernaut_47", "body": "I can’t predict the bottom of this move. But I think it’ll be short (weeks at most). Could see 105k. Wouldn’t be surprised to be at new ATH by end of Aug."}
{"id": "n6bhlgn", "author": "Pure_Concentrate8770", "body": "Bro exists in multiple time zones at once"}
{"id": "n6bg42p", "author": "tehrcrd", "body": "You managed to find my only comment in 2025 and cried about it. Account was suspended but thanks for your narrowheaded insight."}
{"id": "n6el8vk", "author": "Maleficent_Sound_919", "body": "Longterm"}
{"id": "n6f8lp4", "author": "TomorrowFinancial468", "body": "Oh boy I don't want to be you when that chart goes up"}
{"id": "n6fn5o2", "author": "TomorrowFinancial468", "body": "As opposed to bitcoin economics I guess which is completely different"}
{"id": "n6bkhhl", "author": "piggleii", "body": "Oh ok. So the former for you."}
{"id": "n6bx50h", "author": "Due-Inspection-5660", "body": "dont try to use logic with these maga-tards"}
{"id": "n6bl4el", "author": "bizaroo933", "body": "Oh yeah thats why around election time when inflation was much higher as now he did 2 times a rate cut? Where was Powell to cut rates when inflation during Trump was around 2.3% if its not personal?"}
{"id": "n6ap7ox", "author": "piggleii", "body": "Well most of them have a fair value of zero so..."}
{"id": "n6a9uiw", "author": "decomposition_", "body": "Depends on your time frame, if you’re patient the answer is yes"}
{"id": "n6bdvrk", "author": "ThinCrusts", "body": "Burgers"}
{"id": "n6docgz", "author": "skyline917", "body": "🔥"}
{"id": "n6doddo", "author": "Due-Inspection-5660", "body": "it's fine, short term price moves dont really matter.\n\nonce this tariff bs blows over and eth etf staking gets approved and we get rate cuts, $5k at a minimum is guaranteed in 2025."}
{"id": "n6fn1rp", "author": "devCheckingIn", "body": "The CME forecast months out has been wrong for every FOMC this year so far.  Just about everybody is flabbergasted by the Fed's stubbornness."}
{"id": "n6fnqjo", "author": "Nequientt", "body": "its 89%"}
{"id": "n6er7xs", "author": null, "body": "[deleted]"}
{"id": "n6f33rc", "author": null, "body": "Bro my shift on daily hating of the burgers just started. The french are next"}
{"id": "n6etjnm", "author": null, "body": "What's $? I use a real currency"}
{"id": "n69kun4", "author": "VariatCA", "body": "Ya'll get more and more ridiculous after each 2% dip lol"}
{"id": "n6ccgr6", "author": "Due-Inspection-5660", "body": "sir he's a regard, what else do you expect?"}
{"id": "n6cc7l0", "author": "bizaroo933", "body": "I have been constantly wrong? Lol tell me just 3 days we pumped from the last weeks when burger market opened. I know some people like you hate the truth and only wants comments like ‘we are going to moon today!! God candle incoming!’. Truth is with these greedy Americans its not going to happen"}
{"id": "n6avita", "author": "Yungmoolah42069", "body": "What’re you invested in?"}
{"id": "n6aquf7", "author": "Admir_95", "body": "50% of my net worth in NEAR and the other 50% in INJ. Holding since 2023. Did not sell… hope we get a bounce this year. They are amazing projects IMO"}
{"id": "n6b81ao", "author": "Yungmoolah42069", "body": "What’re you invested in?"}
{"id": "n69y8lw", "author": "SoggyKnotts", "body": "That’s what a sold! My box house 📦 \nIt was a really nice one."}
{"id": "n6bzaaz", "author": "Olskoolah", "body": "Lines on a chart you know. Plus some YouTuber probably said it and they all have 100% win rates."}
{"id": "n6c3ldi", "author": "ThorSellsCars", "body": "So they can suffer the same trauma I did"}
{"id": "n6fp3jo", "author": "jwz9904", "body": "Finally he’s right until he’s wrong again"}
{"id": "n6fp8ut", "author": "bizaroo933", "body": "Lol, are you obsessed with me? Why the fuck are you observing me go get a girlfriend or something dude. \n\nIn the end I was right. Americans are to blame. They have the most shittiest people voting on a psychopath that destroyed the market"}
{"id": "n6fq1g4", "author": "jwz9904", "body": "Retail is broke"}
{"id": "n6fq78v", "author": "VariatCA", "body": "His outlet for passing responsibility for his shitty moonshot investments failing."}
{"id": "n6f5z2e", "author": null, "body": "I couldn't agree more."}
{"id": "n6bp7uk", "author": "bizaroo933", "body": "Then why 2x rate cuts despite much bigger inflation during election time if its not politic motivated"}
{"id": "n6bph3d", "author": null, "body": "[deleted]"}
{"id": "n6ao3r8", "author": "jwz9904", "body": "and we had 5 green candles. Inverse cramer cannot be more real"}
{"id": "n6b1keg", "author": "kinsiibit", "body": "15k to 120k aint bad"}
{"id": "n6cm1rc", "author": "bizaroo933", "body": "Still veryyyyyy long time till burger market closes"}
{"id": "n6dhla0", "author": "_TheWolfOfWalmart_", "body": ">Jerome Powell & the rest of the fed board don't care about cutting rates to pump your shitcoins\n\nWell, he SHOULD! Doesn't Jerome know I need fartcoin to go up?"}
{"id": "n6dj7c7", "author": "Suspicious-Holiday42", "body": "he only cares about following his narrative, which is thinking that tariffs are the best thing in the world"}
{"id": "n6be0mj", "author": "KalEl729", "body": "Check it now. And when burger market opens, we freefalling"}
{"id": "n6c02mk", "author": "bimbobandit2016", "body": "Bitcoin's price in USD is very noisy this year because there is a lot of currency devaluation there. The Bitcoin Euro chart is a much cleaner picture of what the actual demand for Bitcoin is."}
{"id": "n6c1hzp", "author": "wvutrip", "body": "Short term looks extremely bearish lol"}
{"id": "n6g2424", "author": "davink91", "body": "Why the wrong way?"}
{"id": "n6dznbn", "author": "MarioWilson122", "body": "Most people leverage longs but shorts have won more often this year for alts for sure."}
{"id": "n6e61zr", "author": "ThatChrisGuy7", "body": "Leveraged XRP short here lol"}
{"id": "n6bmlnn", "author": "wallyone123", "body": "🍔 🍔"}
{"id": "n6bjjno", "author": "piggleii", "body": "Well you should love Jerome Powell refusing to cut interest rates then."}
{"id": "n6do3ur", "author": "VariatCA", "body": "These are the same guys saying \"Alright, we're finally in the midst of a strong Bitcoin bull run... time to take your whole portfolio and throw it into Fartcoin with me!\""}
{"id": "n6fnagk", "author": "jwz9904", "body": "Typical, the weekend’s gonna be long"}
{"id": "n6dek3s", "author": "Fomentatore", "body": "Look at their history, most of them are bots."}
{"id": "n6d3ksu", "author": "LargeSnorlax", "body": "I do like the bots parroting truthsocial posts though, makes it easier to spot the bozos"}
{"id": "n6dgl3z", "author": "Preme2", "body": "TO THE US! TO THE WORLD!!\n\nPipe down. The Fed should have cut rates. Sept rate cut percentages are flying up. The Fed prioritized jobs over inflation during the Biden administration and should do the same under the Trump administration.\n\nWho cares if PCE is at 3% instead of 2.5% if no one has a job."}
{"id": "n6dihb9", "author": "c05d", "body": "that may be true but jpow cunt needs to cut rate regardless"}
{"id": "n6cnaq0", "author": "Due-Inspection-5660", "body": "LMAO you guys are hilarious"}
{"id": "n6brrat", "author": "KristianME", "body": "No, only eth holding up well. \n\nXrp, ada, sol etc is getting hammered."}
{"id": "n6d2mzp", "author": "GhostEntropy", "body": "XRP treasury companies is the top signal."}
{"id": "n6b6ys7", "author": "ozera202", "body": "Watch bank banks , cryto exchanges go bust with this recession with many FTX events occurring and nuking the crypto market. Everything is over priced, housing , cars , stocks and last of cryto which actually does fuck all and I’m all for making money ."}
{"id": "n69qaxm", "author": "HopiumTrump", "body": "I think a $69,420 buy order will be a great one when the bear arrives!!"}
{"id": "n69oene", "author": "HauntingAardvark521", "body": "Nah cause we’d definitely at least see a nice dead cat bounce."}
{"id": "n6be0h1", "author": "c05d", "body": "Try both"}
{"id": "n6bbqdq", "author": "MarioWilson122", "body": "Yeah they are salty at the market and you are salty at them for being salty so alot of salt indeed."}
{"id": "n6bfivq", "author": "Medium_Change4574", "body": "Ok I'm cooked"}
{"id": "n6bkalk", "author": "Medium_Change4574", "body": "I mean Bonk did a 2x after my swap (I took 0 profits ofc)"}
{"id": "n6fwgbs", "author": "jwz9904", "body": "there will be many \"i told you so\" videos"}
{"id": "n6d7ti1", "author": "vb90", "body": "Did you start with 500k?"}
{"id": "n6d1mef", "author": "namieorange", "body": "Yeah, been hearing the falling knife since I started buying BTC at 20k. Same with plenty of coins"}
{"id": "n6ctjlj", "author": "LargeSnorlax", "body": "I was led to believe that the US workers yearned for the mines, factories and farms \n\nWas I led astray?"}
{"id": "n6ctcni", "author": "jwz9904", "body": "ooo america gonna crap itself"}
{"id": "n6cshb2", "author": "Indigovyre", "body": "What history? The history of the year+ long downtrends, y'know that history there has been a few of them.\n\nNobody knows anything."}
{"id": "n6ae41z", "author": "Pat_McCrotch", "body": "thank you, i use this heat map too but i can't seem to find where it shows 20B of longs getting rekt and 15B in shorts piling up?"}
{"id": "n69sdbu", "author": "dandiestweed", "body": "https://x.com/LurkingTurd/status/1951087509783584984?s=19\n\n\n🤣"}
{"id": "n69s0fb", "author": "Dzerikas", "body": "Hmm but it seems we still getting lower, is it just the panic?"}
{"id": "n6b7yj2", "author": "pikkuhillo", "body": "If you add chaos to chaos it overchaoses it causing chaosless period. A potato can absorb the too much added chaos similar to too much added salt. Was this irrational too as I would like to out irrational the market?"}
{"id": "n6b57vv", "author": "Simke11", "body": "I mean that's reddit in general. There is always a reason why the world is ending tomorrow."}
{"id": "n6cn5tb", "author": "spacedout1997", "body": "Is this bitcoin only subreddit or are you a bot?"}
{"id": "n6cnbds", "author": "spacedout1997", "body": "Btc almost 4% down bot"}
{"id": "n6b5d2p", "author": "Davek56", "body": "Everything in its own time."}
{"id": "n6fw9df", "author": "Fhaticito", "body": "Agree I said I was an idiot.  So long during the blood today is the way.  I’ll report back in two weeks"}
{"id": "n69obam", "author": "HauntingAardvark521", "body": "Ohhh he’s learning… and how often are the cycles?"}
{"id": "n6ahity", "author": "Suspicious-Holiday42", "body": "I think thats because investing nowadays is easier than ever and everyone has a automatic monthly buy plan, not relevant how much the real value of a company is"}
{"id": "n6a5eq0", "author": "VariatCA", "body": "https://www.whitehouse.gov/presidential-actions/2025/04/clarification-of-exceptions-under-executive-order-14257-of-april-2-2025-as-amended/"}
{"id": "n6f92gh", "author": "Annual_Juggernaut_47", "body": "Plus inflation will continue down."}
{"id": "n6f9j8s", "author": "Dzerikas", "body": "Wait 70-80? Werent they cut from 65 to 45?"}
{"id": "n6f7fky", "author": "Paddy_Powers", "body": "Probably when BTC goes to 20k"}
{"id": "n6f7ti6", "author": "SevereArrivals13", "body": "Never. \n\nBitcoin can dump and it probably will at some point but everyone knows that will just be an opportunity for major gains as the recovery and higher prices are a certainty in the long run"}
{"id": "n6kuv30", "author": "lumpyshoulder762", "body": "So XRPs market cap should be higher than both Google and Apple combined? 🙄"}
{"id": "n6emgup", "author": null, "body": "[removed]"}
{"id": "n6ekqdf", "author": "bizaroo933", "body": "So one way or another, you also blame ‘Americans’ since you think we will get a rally when their market closes. You are pretty hypocrite for getting angry when I say the same thing just in another ‘childish’ manner in your eyes."}
{"id": "n6em4pm", "author": "KalEl729", "body": "“Normally” being the operative word. Lets see."}
{"id": "n6b2hjy", "author": "MarioWilson122", "body": "They might but even if they do he needs to kinda slow back on those a little i can kinda see him ramping it up more after the cuts so they might not do what we need. \n\nI hope im wrong on that but there really is no telling. I guess we could end up seeing a showdown of the ages rate cuts vs tariffs to see if we win us a opportunity of seeing everything fly. \n\nId like to put my money on rate cuts but trump could pull it out by coming up with brand new tariffs every week for every country for the next 6 months."}
{"id": "n6b50aa", "author": "MarioWilson122", "body": "Im speaking on alts i know BTC should be fine. So if thats all you care about then you should be good."}
{"id": "n6b39if", "author": "VariatCA", "body": "Would you, as another foreign Nation, purchase literal trillions of dollars in low-interest bond-backed debt from the U.S., if you thought that they were only temporarily lowered by Presidential influence and will be reverted immediately after your money is locked in?"}
{"id": "n6ba0ui", "author": "MarioWilson122", "body": "Yeah that stuff is almost a year ago ever since then he has done nothing but provide tariffs that have killed interest in markets. So yeah that was nice at the time for sure but most are way down since 7-8 months ago."}
{"id": "n6gghfa", "author": "DryGeneral990", "body": "But I thought BTC was a hedge against inflation, better than gold?"}
{"id": "n6g0cqy", "author": "VincenteThomp", "body": "Risk off means return to dollar, fat ass."}
{"id": "n69ojo8", "author": "VariatCA", "body": "It really would be an incredible secret to just be out & about in society and keep a secret like being the Bitcoin creator for all this time. Not even mentioning also keeping a massive stockpile of wealth at their disposal."}
{"id": "n6et7ja", "author": "b1mm3rl1f3", "body": "If you sold here you deserve poverty 😂"}
{"id": "n7h7lqt", "author": "b1mm3rl1f3", "body": "Didn't even need 2 months, I needed a 6 day reminder 😂 have fun"}
{"id": "n6efhl2", "author": "Possible-Material693", "body": "Shit market? Btc was up 72% since Election Day as of yesterday.  You’d cry in a real bear market if you think this is a shit market.  Buy the dip and don’t be a bitch"}
{"id": "n6bd6kl", "author": "piggleii", "body": "Playing a game, I know you've done too..."}
{"id": "n6bnzr1", "author": "xManaf", "body": "This guy cryptos"}
{"id": "n6bvu3y", "author": "Nequientt", "body": "If labour market significantly deteriorates and we get recession scare do you believe your altcoin will go up because of 0.25% rate cut?"}
{"id": "n6bwrb6", "author": "Medium_Change4574", "body": ">FOMC as a whole have not even made a decision for september. \n\nI mean they have to say that while each member might already have a likely decision in mind"}
{"id": "n6ecsup", "author": "decomposition_", "body": "Meh, they’ve been there for decades. It’s nothing new, he’s saber rattling as a distraction from the Epstein bs"}
{"id": "n6d1icl", "author": "whataboutbenson", "body": "I personally can see the case for taking out a loan to buy crypto. That already makes me more radical than 90% of people. But taking out a loan to buy bitcoin in the late stage of a bullrun is just financial suicide. And if he's dumb enough to do that, he probably didn't even buy bitcoin but some other wretched shitcoin."}
{"id": "n6f24jh", "author": "Ok_Golf_6467", "body": "Hehe sorry meant $500 worth of each"}
{"id": "n6cbpo1", "author": "Due-Inspection-5660", "body": "jesus! will be interesting to see what odds CME Fedwatch is giving for a sep rate cut now."}
{"id": "n6azjs0", "author": "VariatCA", "body": "Alts are still dependent on BTC's strength and momentum if they want any chance at a breakout. This is still Bitcoin Season, and alts will not continue to run until BTC either continues with new ATH price discovery, or holds a stable range close to its ATH. A steady economic outlook is also necessary to stave off concerns of any potential corrections."}
{"id": "n6bo6ei", "author": null, "body": "If you follow through, usually it's the moment the market pumps. Story of my  life."}
{"id": "n6dbncg", "author": "bizaroo933", "body": "I want the market go green even more then you but if its 3 weeks in a row red everytime burger market opens how can you negate that lol"}
{"id": "n6emvpi", "author": "flyingstalli0n", "body": "I agree. Alts are showing relative strength. I bought more Sui and now it’s already in profit. Good bounce."}
{"id": "n6cgtyk", "author": "nomoney110", "body": "maybe a bigger correction."}
{"id": "n6bphig", "author": "kironet996", "body": "didn't have to search, it was right at the top"}
{"id": "n6fajva", "author": "reversenotation", "body": "Still I don't need to create alts to astroturf and artificially attempt to manufacture FOMO"}
{"id": "n6fnbrg", "author": "LTP-N", "body": "Whataboutism isn't addressing the issue and certainly won't solve the problem."}
{"id": "n6blng5", "author": "MichaelAischmann", "body": "It's data AND outlook he needs to consider."}
{"id": "n6a9ydb", "author": "TexasBoyz-713", "body": "Okay I’ll keep sitting on my Peercoin then! #oneday"}
{"id": "n6be01f", "author": "October45", "body": "Thanks for the clarification. "}
{"id": "n6e0wfo", "author": "ieatvegans", "body": "Nothing is guaranteed. "}
{"id": "n6fo4t3", "author": "Dzerikas", "body": "Well damn then they should do it"}
{"id": "n6ewkyq", "author": "jdf-", "body": "Third worlders getting too comfortable on this sub 💔"}
{"id": "n6euykw", "author": "kironet996", "body": "you lost 50 of your \"real\" currency by gambling with shitcoins?"}
{"id": "n6aopao", "author": "The_Nothing00", "body": "Better keep the suicide hotline handy bud. It's about to get ugly. AUGUST = THE FIRST MONTH OF  A 6+ YEAR LONG CRYPTO WINTER."}
{"id": "n6cdmiq", "author": "piggleii", "body": "Dude you were posting the same shit at sub 100k."}
{"id": "n6cceoh", "author": "Due-Inspection-5660", "body": "so explain to me how eth and BTC are still massively up over the last few months even with \"burgers selling\" and with the latest pullback?\n\ngo on, i cant wait to hear this."}
{"id": "n6c3o6j", "author": "Due-Inspection-5660", "body": "lol"}
{"id": "n6fpdpg", "author": "VariatCA", "body": "It's like spending every day in the Summer saying \"It's going to rain soon!\" then celebrating being right on December 11th when it finally does."}
{"id": "n6fqy3w", "author": "Defusion55", "body": "Americans drive bitcoin up from $100 to 120k and then they take profits dipping it to 113k and ItS THe DaMN BuRgErs. Lmao. If only other countries could actually make a dent in the market but they are all poor mofos trying to piggy back off the \"burgers\" and have the tenacity to cry when they invest poorly. My dude you are more pathetic than the cows that shit and then eat it"}
{"id": "n6fpxcv", "author": "VariatCA", "body": "\"In the end\" LOL you're so obsessed with the 5-minute charts that you think a couple red days means \"it's all over!\" You were shouting *the same shit* back in May/June during the dips to 100k, yet YOU NEVER LEARN. Same with avoiding Bitcoin and sticking with garbage shitcoins, YOU NEVER LEARN.\n\nEndlessly-pessimistic people are hard to miss in here, because they spend every day fucking embarrassing themselves like you do."}
{"id": "n6bplns", "author": "ivan971", "body": "Trump is the cause of the current economic uncertainty."}
{"id": "n6bqppn", "author": "arveena", "body": "No other countries implemented massive tariffs which  is the best method to accelerate inflation in your economy. There is zero chance of a rate cut for any sane human beeing as long as there is tariff talks. Because tariff ALWAYS lead to inflation."}
{"id": "n6bpwmy", "author": "bizaroo933", "body": "Powell is the typical husband/father when he sits at the table for dinner with his wife and children that he tells them how what kind of evil and dangerous a man like Trump is and that he will do everything to stop him."}
{"id": "n6bppkl", "author": "vb90", "body": "That's because most of those countries did not avoid recession, like the US."}
{"id": "n6cmi44", "author": "Due-Inspection-5660", "body": "and are you finally gonna stfu when the market closes and we're above $110k?"}
{"id": "n6di48f", "author": "decomposition_", "body": "Yeah, I need the economy to suffer so that I can personally benefit in queefcoin"}
{"id": "n6dnkbm", "author": "VariatCA", "body": "What easier way to pay for tax cuts for the rich, than just use a mechanism that can single-handedly raise prices for everything in America simultaneously and pilfer hundreds of billions out of American's pockets?"}
{"id": "n6g2m59", "author": "brkinard", "body": "Its alt szn"}
{"id": "n6dicv7", "author": "c05d", "body": "me no bot brrrrr"}
{"id": "n6dh7qg", "author": "VariatCA", "body": "Rates should be climbing to combat looming tariff inflation. You know what was missing from the Biden admin compared to now? The president wasn't trying to pilfer *hundreds of billions of dollars a year* out of the pockets of American citizens. \n\nHalf of Americans barely have $1,000 in savings, and Trump is bragging that tariffs will bring in $300-500 Billion a year. Paid for by sending the costs straight to the consumer, that's an average of over $1,000 *per human being in America* per year."}
{"id": "n6dl450", "author": "VariatCA", "body": "Cutting rates will do nothing but prop up the stock market while the rest of Americans get hammered by job losses, tariffs looting their savings, and inflation devaluing everything that's left.\n\nYou know what else could fix this whole mess and put it right back on track? Laying off the disastrous tariffs. Easy as pie, he's one Big Beautiful Executive Order from fixing it all himself."}
{"id": "n6bsdxd", "author": "MinimalGravitas", "body": "XRP is up 34.7% on this month.\n\nADA is up 29.1% over that period.\n\nEven fucking SOL is up 12.7% this month... double the gains of BTC.\n\nWhy would you make these claims without just checking first... I don't understand?"}
{"id": "n6b7gon", "author": "Former_Credit_5592", "body": "Get help big bro 🙏"}
{"id": "n6b7e82", "author": "VariatCA", "body": "All I see is PANICAN"}
{"id": "n6b7v1i", "author": "tehrcrd", "body": "Satoshi made btc for a new recession. \n\nWe are so ready!"}
{"id": "n69otdt", "author": "VariatCA", "body": "It was the same doomish sentiment back in April, people were sure the sky was falling around here at 76-80k. Then the reversal comes and leaves the eternally-bearish at the train station again."}
{"id": "n6d1lzy", "author": "Rock_Hardy112", "body": "You'll work those mines and be thankful!"}
{"id": "n6ctmzk", "author": "Due-Inspection-5660", "body": "well it depends how quickly the fed reacts, a rate cut in sep might be enough to get a soft landing for their economy while also propping up stocks and crypto."}
{"id": "n6cszqc", "author": "Due-Inspection-5660", "body": "this 4 year cycle bs isnt a thing anymore now that institutions and corporations are dominating btc flows, not retail regards like before."}
{"id": "n69t360", "author": "bowdenta", "body": "You're not wrong. There's also a gap down around 83k 🙃"}
{"id": "n6fxbcm", "author": "goldenbuyer02", "body": "Stay away from futures dude. Just buy the dip. Only spot trading. You dont know if August continues to bleed."}
{"id": "n69pe8j", "author": "VariatCA", "body": "Oh no, it's another 4-year-cycle astrologist who thinks the date on the calendar decides when the entire world gets simultaneously bearish on an asset lol.\n\nThe 4-year-cycle only still barely has a leg to stand on because a worldwide pandemic, spiraling inflation and economic shutdown, and several cascading crypto-related events interrupted the last one."}
{"id": "n6fa430", "author": "VariatCA", "body": "Cutting rates in an environment with such a gigantic amount of new tariffs will only fuel inflation, not curb it. Sudden high tariffs on their own can cause a one-time inflationary event, and cutting rates can also accelerate inflation.\n\nBut our jobs report was garbage, with a rather bad extrapolated forecast for what August will bring (and what revisions are bound for July).\n\nThe FED may choose the lesser of two evils though, and try to ease unemployment even at the cost of higher inflation.\n\nThe stock markets may be happy, but this whole tariff situation is just making life a little bit worse at a time for every average American."}
{"id": "n6faqa5", "author": "VariatCA", "body": "The jobs report was *that* bad. Payroll was unbelievably over-reported for the prior two months as revisions showed they were high by nearly 300k new jobs. July missed speculative estimates by about 50%, hinting that we probably *lost* a slew of jobs rather than had any real growth.\n\nIt's acually closer to 90% estimates of September cuts at the moment."}
{"id": "n6fki7b", "author": "Electronic-Yam4920", "body": "Do you seriously believe it will go to 20k? Lol"}
{"id": "n6fkmky", "author": "Electronic-Yam4920", "body": "MaJoR gAiNs 💪💪🤡🤡"}
{"id": "n6eta22", "author": "HopiumTrump", "body": "🍔🍔🍔"}
{"id": "n6b3wcc", "author": "VariatCA", "body": "Jerome Powell has made it crystal clear that most of the weight of the Fed's indecision is due to tariff uncertainty. He & the rest of the board will continue analyzing the economic data (including the tariffs, which Trump is *trying* to postpone as long as he can until rate cuts) and will not lose 1 wink of sleep when it comes to doing what's necessary.\n\nThe FED, and the stock market earlier this year, have both communicated in their own way that he needs to tread carefully with this tariff business. Taxing hundreds of billions of dollars extra out of U.S. citizens will absolutely come at a cost.\n\nHe's already bragged about pulling in $150 BILLION from tariffs in 6 months. Within a year's time, that's nearly $1,000 from every single person in America. Fucking ridiculous."}
{"id": "n6b8i8m", "author": "HopiumTrump", "body": "Ether hasnt been doing too bad recently either"}
{"id": "n6g0tdj", "author": "brkinard", "body": "your an idiot if you believe that we are risk off.  Oh, you joined in 2023...got it. Lots to learn my friend. LOTS!"}
{"id": "n6ez0ap", "author": "_Commando_", "body": "Remember to take screenshots 🤣"}
{"id": "n6extpp", "author": "Pretenderinchief", "body": "My brother, I’m lucky enough to say that poverty is out of reach for me even if I sold today. The US economy is screwed. Goodluck getting an ALT season on the back of that jobs report."}
{"id": "n7h7tvi", "author": "Pretenderinchief", "body": "Have fun with what? You know I’m invested right? I’m making money too."}
{"id": "n6bf4q1", "author": "ABrad11", "body": "No idea what you’re talking about"}
{"id": "n6bww17", "author": "Due-Inspection-5660", "body": "I dont hold shitcoins buddy. and yes even a 0.25% cut does affect the market signficantly."}
{"id": "n6bwy11", "author": "Due-Inspection-5660", "body": "how can they decide when they have no idea  what's going to happen with inflation and the labour market in the next 2 months?"}
{"id": "n6d83hw", "author": "Due-Inspection-5660", "body": "what makes you think we're at a late stage? the 4 year cycle isnt guaranteed to continue to be a thing"}
{"id": "n6dejtf", "author": "VariatCA", "body": "That's just your confirmation bias triggering. Go back and look at the hourly chart for the last two weeks, it's literally 50/50 whether the market has gone up or gone down for the first couple hours.\n\nIt just feels like it \"DUMPS EVERY DAY\" because BTC has been almost completely flat since the July 10th run-up. So there will be lots of selling, and lots of buying, for a net-zero change.\n\nYou just ignore the pumps, and freak out over the dips, while nothing has changed in weeks."}
{"id": "n6fawea", "author": "TomorrowFinancial468", "body": "Oh I won't need to manufacture anything.  I gave you an opportunity that everyone begs for in this space and you were too filled with pride.  You know better right? Enjoy that feeling.  It will be temporary"}
{"id": "n6fnf5r", "author": "TomorrowFinancial468", "body": "So answer my question"}
{"id": "n6bls7j", "author": "bizaroo933", "body": "He always said rates were necessary to fight inflation. Inflation is very low at the moment, and suddenly data is also needed?"}
{"id": "n6f1gtq", "author": null, "body": "USA is basically a 3rd world dictatorship"}
{"id": "n6f1o05", "author": null, "body": "Sure buddy!"}
{"id": "n6athcl", "author": "VariatCA", "body": "Keep dreaming lmao. But hey keep it up! If you keep trying to predict bearish crashes every day of your life, some day you'll eventually be right! You can tell everyone you knew it all along!\n\nIt's the same reason I tell people \"It's going to rain soon\" even though it's midsummer. When it finally *does* rain in December, I can tell them how I can predict the weather!"}
{"id": "n6ccp18", "author": "bizaroo933", "body": "We pumped 1 day till 123k, since then we are only bleeding. Or is this a lie that I am telling? Yeah ETH is doing ok but it still waayyyyy behind its ATH, let alone keeping up with BTC"}
{"id": "n6frenn", "author": "bizaroo933", "body": "Oh an angry Yanki. Please dont use your gun on me yanki"}
{"id": "n6frbwi", "author": "bizaroo933", "body": "I think you are blind, bitcoin maxi. This sub is called CRYPTO currency. That means not only your beloved bitcoin. And I made a lot of money with my memecoins. But I could have made much more it werent for these pathetic burgers selling every moment the market goes green for a bit"}
{"id": "n6br27j", "author": null, "body": "[deleted]"}
{"id": "n6cskhw", "author": "Due-Inspection-5660", "body": "let me know please, bizaroo933."}
{"id": "n6dicea", "author": "_TheWolfOfWalmart_", "body": "Exactly, you get it."}
{"id": "n6geur2", "author": "Illustrious-Boss9356", "body": "alt szn?  More like (s)alt szn.\n\nI guess it just takes the market a few decades to learn but can you imagine wanting to buy penny stocks that trade OTC as pinks over the SP500 or Mag7?  Asinine."}
{"id": "n69pc75", "author": "HauntingAardvark521", "body": "I’m certainly bearish for the month of August, however, I bet we see a run when rates start getting cut in September"}
{"id": "n6cuea1", "author": "Indigovyre", "body": "Nobody knows anything about what will happen in the future."}
{"id": "n6ao9p5", "author": "Dzerikas", "body": "Uhhhhhhh"}
{"id": "n69py21", "author": "HauntingAardvark521", "body": "Until proven wrong my friend. Once you’ve been through a 90% loss, it’s hard to not be a skeptic and overly cautious."}
{"id": "n6fg1lj", "author": "Annual_Juggernaut_47", "body": "FED itself didn’t decided not to cut for ‘transitory’ inflation post COVID. Tariffs are the definition of transitory price increases. The FED is a walking contradiction. \n\nTariffs are not a monetary phenomena and can’t even be defined as inflation. Their tools are useless against tariffs. Choking an entire economy because of one time price increase is ridiculous and useless. \n\nOn top, real inflation is trending down. And will accelerate. Tariffs or no tariffs. Jobs are heading south fast. Trumps constant bickering with Powell is annoying, but he will be proven right. The FED is definitely late as they should not be reacting to today’s data, but what will happen in six months. By the time they cut it will be too late."}
{"id": "n6fbla9", "author": "Dzerikas", "body": "Woahhhhhh really? That high? Holy shit i thought they were still 45\n\nWow so an actual chance"}
{"id": "n6b5bkn", "author": "MarioWilson122", "body": "Well yeah either way we could get screwed whether they cut it or refuse to because of the tariffs. Hopefully they get us those two 2 point ones next month and he slows back after these last ones he just did. Not to certain on how smooth that will go though."}
{"id": "n6ba7zv", "author": "MarioWilson122", "body": "Yeah recently it finally started showing some life but this tariff business can ruin the momentum on that aswell. Hopefully he eases up on those after this month."}
{"id": "n6g1u57", "author": "VincenteThomp", "body": "You fat bastard, learn to read. I never said we were risk off. He asked what to buy when everything goes down. Isn’t it past your bedtime?"}
{"id": "n6ezhac", "author": "b1mm3rl1f3", "body": "RemindMe! 2 months"}
{"id": "n6c22pn", "author": "Nequientt", "body": "How did the market react in the past when the fed had to cut because of deteriorating market conditions?"}
{"id": "n6ddq9s", "author": "whataboutbenson", "body": "Well, after going from 16k to 123k, I certainly don’t think you could argue that we’re early."}
{"id": "n6g1ips", "author": "reversenotation", "body": "If you actually were someone to offer genuine 'opportunity' then you wouldn't be so desperate to have to create many alt accounts to astroturf and get others to be your exit liquidity"}
{"id": "n6fbpxe", "author": "TheGreatCryptopo", "body": "Shill it baby, shill the fuck out of it. Yea send us Moons babys to the mother moon teet."}
{"id": "n6fngwt", "author": "LTP-N", "body": "There was no question"}
{"id": "n6bx6zg", "author": "Due-Inspection-5660", "body": "how is inflation very low? are you trolling or something?"}
{"id": "n6bprvz", "author": null, "body": "[deleted]"}
{"id": "n6f2w60", "author": "jdf-", "body": "It’s Friday night and you are crashing out on a crypto sub. Please reevaluate"}
{"id": "n6cd144", "author": "Due-Inspection-5660", "body": "lol 1 day? are you trolling or something? there were several big legs up, starting from april and continuing until july.\n\nand who cares anyway? we can bleed for 99 days and then have 1 day with a god candle and that's fine, profit is profit.\n\nalso about eth, who cares about its high? most of us bought at prices way below it, so it's not relevant."}
{"id": "n6cf1u6", "author": "decomposition_", "body": "The real burgers are the ones we made along the way"}
{"id": "n6fvllk", "author": "VariatCA", "body": "Even in this sub, nobody cares about your random $moodeng $pengu $fartcoin shitcoins as everyone tries to shill the next short-lived meme before it dumps into the hands of permanent bagholders. Least of all the Burgers, the days of bailing out the newest garbage meme-of-the-week is over."}
{"id": "n6buos7", "author": "arveena", "body": "You people are just to dense right. No country is raising/imposing tariffs but the US. So only the US is gonna get more expensive products for the consumer. Inflation is growth of consumer prices. Its really not hard to understand\n\nWhich 100% is gonna happen. Maybe the other countries are gonna have some economical pain because they sell less. But more expensive and raising inflation is gonna happen in the country that imposes tariffs. Aka the US.\n\nWhy would prices rise in europe we are not imposing tariffs on anyone"}
{"id": "n69qzg9", "author": "VariatCA", "body": "This market is WAY too greedy and cash-rich to let another nothingburger drag it down for too long. Even with most of this tariff business, Trump has shown his hand time and time again about what the inevitable outcome will be. Delay, downgrade, deal.\n\nEven today's tariffs outlined a 7-day timer before *those* go into effect, giving himself yet another week to spend trickling concern into the market before he \"miraculously\" finds another solution/concession."}
{"id": "n6c3la2", "author": "Due-Inspection-5660", "body": "that's if they cut too late and we enter a recession, then all risk-on assets dont perform well."}
{"id": "n6dgj2m", "author": "Due-Inspection-5660", "body": "yes but what's to say that bitcoin wont hit $200k before end of 2025? there are many tailwinds"}
{"id": "n6g1mbn", "author": "TomorrowFinancial468", "body": "Oh no you keep digging that hole"}
{"id": "n6f68zf", "author": null, "body": "Wee little yank"}
{"id": "n6fwnzq", "author": "bizaroo933", "body": "And who are you to speak on behalf of others? Are you in their heads? Do you even know all the members and which coins they hold? Just read the replies here, plenty of people are in altcoins. But dumb guys like you try to act smart on days like this with your Bitcoin. Yet when these ‘shitcoins’ double in value, guys like you vanish like snow in the sun. And again there is a sub called ‘Bitcoin’ in reddit. Go there if you only like bitcoin nobody is going to miss a loser like you trying to act interesting as bitcoin maxi."}
{"id": "n6dh4au", "author": "whataboutbenson", "body": "It’s possible, sure, but not so much that your conviction should be high enough to take out personal loans. The time to do that was two years ago."}
{"id": "n6g5snw", "author": "reversenotation", "body": "Someone who has an MO to create yet more alt accounts on Reddit to shill their moon bags is actually in a big hole.  And otherwise they wouldn't spend their days creating these alt accounts and manipulating dupes to be their exit liquidity"}
{"id": "n6g0b3q", "author": "VariatCA", "body": "Nobody cares nor notices when some brand new low-marketcap shitcoin doubles in price lol, least of all Bitcoin Maxis. They understand that it's blind gambling on not only hype, but that it will be the 1-in-1000 memecoin that *doesn't* get rugpulled into oblivion.\n\nThe maxis have been around long enough to know that the \"HODL!\" meme crowd are always the ones permanently holding a bag down 75-99%, because they're hypotized by dreams of 1000x moonshots and consider selling a cardinal sin.\n\nYou can chase longshot gambles all you want, but *no crying in the casino every day when you lose.*"}
{"id": "n6dmw6m", "author": "Due-Inspection-5660", "body": "yes i agree"}
